{"title":"Anal Bombshells (2012) [WEB-DL]","uid":7114359,"size":4798596532,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:007bbb6d134b00287e36fcb5360540950224cf85&amp;dn=Anal+Bombshells+%282012%29+%5BWEB-DL%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"webchella","files":4,"time":1332175591,"description":"Anal Bombshells (2012) [WEB-DL]\n &lt;a href=&quot;\nhttp://www.excaliburfilms.com/AdultDVD/3005460D1_Anal_Bombshells_dvd.htm&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.excaliburfilms.com/AdultDVD/3005460D1_Anal_Bombshells_dvd.htm&lt;/a&gt;\n\nTitle: Anal Bombshells\nYear: 2012\nCategory: Anal\nStarring: Kagney Linn Karter, Eva Angelina, Alanah Rae, Jayden Jaymes, Remy LaCroix, Mike Adriano\nStudio: Evil Angel\nTime: 01:05:01 + 01:28:08 + 01:20:31 + 01:25:07\n\nDescription: \nGonzo porn master Mike Adriano has developed a dedicated fan base with his unique style of close-up and POV camerawork; a nasty, fetishistic attention to detail; and his single-minded pursuit of the finest ass. The double-DVD &quot;Anal Bombshells&quot; contains four epic-length rectal adventures starring gorgeous babes who are happy to indulge this well-hung performer / director 's special perversions. In addition to the relentless sodomy, Mike's girls love giving head, so there's plenty of intimate cocksucking and lewd ass-to-mouth action - anything goes for these talented anal sluts! First, we join bespectacled American Latina Eva Angelina, who has returned to porn after a long hiatus. Hallelujah! Fortunately, Eva's saved her ass for Mike, and the luscious fan favorite gets ferociously butt-fucked here for the first time since her retirement. Next, huge-titted blonde cupcake Kagney Linn Karter is ready to have her asshole expanded, and Mike is happy to oblige. He rams the busty cutie's soft rump and stretches her sphincter with his signature medical speculum until Kagney's rear entrance is a cavernous gape. Petite, adorable brunette Remy Lacroix takes an enema and several toys in her sweet butthole before a hard anal plundering, and the cute newcomer gulps down a gooey oral cum shot. Finally, curvaceous French bombshell Anissa Kate uses her enormous boobs, sexy bare feet and thick ass to service Mike's prick. The DVD includes bonus scenes featuring Alanah Rae and Jayden James. When it comes to butt sex, Mike's chicks crave the kind that's explosively intense. &quot;Anal Bombshells&quot; is the bomb!\n\nFormat: MP4\nQuality: WEB-DL\nVideo: h264, yuv420p, 960x544, 2024 kb / s, 29.97 fps (r)\nAudio: aac, 44100 Hz, 2 channels, s16, 151 kb / s\nSize: 4.47 Gb\n","torrent":{"xt":"urn:btih:007bbb6d134b00287e36fcb5360540950224cf85","amp;dn":"Anal+Bombshells+%282012%29+%5BWEB-DL%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"007bbb6d134b00287e36fcb5360540950224cf85","infoHashBuffer":{"type":"Buffer","data":[0,123,187,109,19,75,0,40,126,54,252,181,54,5,64,149,2,36,207,133]},"announce":[],"urlList":[]}}