{"title":"WRATH OF THE TITANS XVID CAM GLOBE","uid":7149886,"size":964973480,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:00cd80e7f4309f939079a9bdc6cbb20dd554d120&amp;dn=WRATH+OF+THE+TITANS+XVID+CAM+GLOBE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"globeplus","files":-1,"time":1333280553,"description":"* XVID CAM  * 01H27M23S    * + 1300 Bitrate    * Worked with the Dub plugins\n\n\n* FILE INFO :\n\n\n- Black borders at the top and the bottom in full screen corrected\n\n- particles on the picture background reduced to the minimum\n\n- colours improved\n\n- English audio with ARABIC subtitles\n\n\n\n\n* Plot :\n\nAfter the defeat of the Kraken, Perseus (Sam Worthington), the demigod son of Zeus (Liam Neeson), now lives as a fisherman with his 10-year-old son, Helius (John Bell), from his recently deceased wife Io. One night, Perseus is visited by Zeus, who tells him that the powers of the gods are fading and the walls of the underworld prison of Tartarus are breaking due to the lack of devotion from humans and states they will need the world's armies to combat the potential threat, but Perseus declines to get involved. Zeus then descends to Tartarus to meet with his brothers Hades (Ralph Fiennes) and Poseidon (Danny Huston), and his son Ares (Edgar Ramirez). Zeus tells Hades they must forget the past and unite to rebuild Tartarus, but Hades orders his demons to attack him and Poseidon. Poseidon is wounded, and Ares betrays Zeus over showing Perseus more affection, taking him prisoner and stealing his thunderbolt. Hades and Ares plan to drain Zeus' power to revive their father Kronos in exchange for the two to remain immortal.\n\nThe walls of Tartarus break, unleashing various monsters unto the world, including a Chimera that attacks Perseus's village before Perseus kills it. He takes Helius to the Mount of Idols, so they can speak to Zeus, but Poseidon arrives instead. A weak Poseidon informs Perseus that Hades and Ares have joined Kronos. He tells him to meet with Queen Andromeda (Rosamund Pike) and his demigod son Agenor (Toby Kebbell) to find the fallen god Hephaestus (Bill Nighy), who knows the way into Tartarus. He gives Perseus his trident to give to Agenor before he succumbs to his injuries and turns to ash.\n\n\n\n\n\n* enjoy ...\n\n\n\n\n\n\n\n* GLOBE FILES 2012\n","torrent":{"xt":"urn:btih:00cd80e7f4309f939079a9bdc6cbb20dd554d120","amp;dn":"WRATH+OF+THE+TITANS+XVID+CAM+GLOBE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"00cd80e7f4309f939079a9bdc6cbb20dd554d120","infoHashBuffer":{"type":"Buffer","data":[0,205,128,231,244,48,159,147,144,121,169,189,198,203,178,13,213,84,209,32]},"announce":[],"urlList":[]}}