{"title":"crux-ppc64-2.7a.iso","uid":7254015,"size":340396032,"categoryP":"applications","categoryS":"unix","magnet":"?xt=urn:btih:01f71b5b509294360af95d7e3984f7f5880f30f7&amp;dn=crux-ppc64-2.7a.iso&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"jackman0","files":1,"time":1336531554,"description":"CRUX PPC is a port of CRUX for the Power ArchitectureÂ® platform. It's a GNU system with a Linux kernel and runs on Apple NewWorld (both 32 and 64bit) PowerPC, YDL Powerstation, Genesi PegasosII and EFIKA, ACube Sam440ep and Sam460ex, IBM Power Systems servers. CRUX PPC includes support for laptop-specific features, extended hardware support and server tools.\n\nCRUX PPC is a volunteer driven non-profit project based on the releases of CRUX for x86. It contains software written by a lot of different people, each software comes with its own license, chosen by its author. Parts written by CRUX PPC Team are to intend as free software; you can redistribute it and/or modify it under the terms of the GNU General Public License as published by the Free Software Foundation; either version 2 of the License, or (at your option) any later version.\n\nUnlike other distributions, the primary goal of CRUX is not to be the most popular (read: biggest number of users) or to put as many features as possible into the system. The idea is rather to build a streamlined distribution, targeted at a specific audience which in turn gets a system without compromises. The result may not be the best distribution for everybody, but as mentioned above, that's not the goal. If you're part of the target audience however, you might enjoy running CRUX just as much as we do.\n","torrent":{"xt":"urn:btih:01f71b5b509294360af95d7e3984f7f5880f30f7","amp;dn":"crux-ppc64-2.7a.iso","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"01f71b5b509294360af95d7e3984f7f5880f30f7","infoHashBuffer":{"type":"Buffer","data":[1,247,27,91,80,146,148,54,10,249,93,126,57,132,247,245,136,15,48,247]},"announce":[],"urlList":[]}}