{"title":"Caccia alla volpe / After the fox (1966) - Vittorio De Sica DVD9","uid":7157524,"size":6659354624,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:035c38f63549bf5d79b63dbe16db734c22b85596&amp;dn=Caccia+alla+volpe+%2F+After+the+fox+%281966%29+-+Vittorio+De+Sica+DVD9&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Mariann1","files":-1,"time":1333492928,"description":"Caccia alla volpe / After the fox (1966) - Vittorio De Sica DVD9 PAL\n\nYear: 1966\nDirector: Vittorio De Sica\nCountry: Italy, UK\nGenre: Comedy \nRuntime: 103  Min.\nWriting credits: Neil Simon, Cesare Zavattini\nPhotography: Leonida Barboni\nOriginal Music: Piero Piccioni \nCast: Peter Sellers, Victor Mature, Britt Ekland, Martin Balsam, Akim Tamiroff, Paolo Stoppa, Tino Buazzelli, Mac Ronay, Lydia Brazzi, Lando Buzzanca, Maria Grazia Buccella, Maurice Denham, Tiberio Murgia, Francesco De Leone, Carlo Croccolo, Nino Musco, Pier Luigi Pizzi, Lino Mattera, Piero Gerlini, Daniele Vargas, Franco Sportelli, Giustino Durano, Mimmo Poli, Enzo Fiermonte, Roberto De Simone, Angelo Spaggiari, Mario Del Vago, Timothy Bateson, Vittorio De Sica, Carlo Delle Piane\n\n:: Synopsis ::\nThe story begins in Cairo with the hijacking of $3 million in gold bullion. The thieves need a way to smuggle the two tons of gold bars into Europe. There are only four master criminals considered able to smuggle the gold: one is French (but so crippled he can barely move his wheelchair); one is Irish (but so nearsighted that he is arrested after trying to hold up a police station instead of a bank); one is German (but so fat he can barely get through a door). The only man cunning enough to outwit Interpol is Aldo Vanucci, also known as The Fox, a master criminal with a talent for disguise. Vanucci poses as an Italian neo-realist director named Federico Fabrizi. He plans to bring the gold ashore in broad daylight as part of a scene in an avant garde film. To give the picture an air of legitimacy, he cons over-the-hill American matinee idol Tony Powell to star in the film, which is blatantly titled The Gold of Cairo. Fabrizi then enlists the starstruck population of a tiny fishing village to unload the shipment. He is caught, and Vanucci's &quot;film&quot; is used as evidence.\n\n\n:: Technical Info ::\nDVD Distributor: MGM DVD\nVideo Format: Pal\nDVD Source: DVD9\nAspect Ratio: 2.35:1\nAudio: English, Spanish, German, Italian, French  1.0\nSubtitles: English, French, Portuguese, Swedish, Dutch, Norwegian, Finnish, Danish, Greek.  \nExtraction: DVD Shrink\n","torrent":{"xt":"urn:btih:035c38f63549bf5d79b63dbe16db734c22b85596","amp;dn":"Caccia+alla+volpe+%2F+After+the+fox+%281966%29+-+Vittorio+De+Sica+DVD9","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"035c38f63549bf5d79b63dbe16db734c22b85596","infoHashBuffer":{"type":"Buffer","data":[3,92,56,246,53,73,191,93,121,182,61,190,22,219,115,76,34,184,85,150]},"announce":[],"urlList":[]}}