{"title":"Cyber Update Mar.2012------FM-21442 Isis Love and Kendra May Lu","uid":7147749,"size":598561807,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:0457b8b25ac1a3f53ce858427c717c595ed80d2f&amp;dn=Cyber+Update+Mar.2012%5C------FM-21442+Isis+Love+and+Kendra+May+Lu&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"merzedes","files":-1,"time":1333194618,"description":"Cyber Update Mar.2012FM-21442 Isis Love and Kendra May Lust  + Pics\n\n\nEveryday is Valentine's Day for Isis Love. She has girls and guys alike professing their crushes and desires to her all the time. Isis knows when you have this many people after you, you get to be VERY picky about who gets the rare chance to be with you. \nKendra Lust meets the high standards Isis has set for her admirers and after months of internet stalking, Kendra gets her fantasy granted - to debut in a porn with Isis Love. \n\nKendra is fit with &quot;300&quot; style abs and a compact little body that wiggles with anticipation when Isis touches her. This is the golden moment that you will NEVER see again - that first time on camera nervousness, the unknown and intimidating deep waters of fucking machines that are controlled by someone you have only fantasied about, and it's all happening live while we watch in the room and over the net. \nKendra doesn't even know how amazingly sexy and genuine her reactions are - she has no idea that her first time is harder than most seasoned models experience. She is tied spread eagle with her nipples sucked tight by suction cups that pull milk from her tits. Isis doesn't miss one beat and rams her fingers into Kendra's cum drenched pussy until her entire fist plunges inside. Her cunt is fisted for the first time in her LIFE! Kendra's orgasms come fast and surprising with her sweet Midwest accent screaming out &quot;oh I'm cummin&quot; \n\nAnd Isis never disappoints with her intense squirting orgasms and pure dominant desire to use Kendra in all the ways she wants to be used and all the ways she could never image. You will never witness Kendra cum like this again because she knows what to expect. This is it, this is the scene to watch. \n\n\nScreens &lt;a href=&quot; http://www.fuckingmachines.com/site/shoot.jsp?shootId=21442&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.fuckingmachines.com/site/shoot.jsp?shootId=21442&lt;/a&gt;\n\n\nCheers  :-)","torrent":{"xt":"urn:btih:0457b8b25ac1a3f53ce858427c717c595ed80d2f","amp;dn":"Cyber+Update+Mar.2012%5C------FM-21442+Isis+Love+and+Kendra+May+Lu","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0457b8b25ac1a3f53ce858427c717c595ed80d2f","infoHashBuffer":{"type":"Buffer","data":[4,87,184,178,90,193,163,245,60,232,88,66,124,113,124,89,94,216,13,47]},"announce":[],"urlList":[]}}