{"title":"The Russia House (1990) 720p HDTV H.264 (moviesbyrizzo) MKV","uid":7039362,"size":1163772493,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:0631aeb7658ca3902d369543d60bb6fd4a8d1813&amp;dn=The+Russia+House+%281990%29+720p+HDTV+H.264+%28moviesbyrizzo%29+MKV&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"moviesbyrizzo","files":-1,"time":1329486556,"description":" &lt;a href=&quot;http://www.imdb.com/title/tt0100530/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.imdb.com/title/tt0100530/&lt;/a&gt;\n\nfrom HDTV source file\n\n1280 X 544 video res at 1100k bitrate H.264 DivX Hd MKV, 192k audio \n \nOur other posted HD versions (higher-resolution video by the way, for this \nmovie)may feature a secondary Russian and/or German French Italian audio tracks\ntoo\n\nLovely theme music mp3 also included\n\nSRT subtitles included for Danish, Dutch, Finnish, French,\nGerman, Italian, Norwegian, Polish, Serbian, Spanish, Swedish, \nEnglish template incl\n\n\nPlease note that this particular movie has much of its nuances and sensibilities\nconveyed in the particular expressions in the vernacular of the English language \nthat expressions come from now and then that makes a lot of meaning which is lost \nin translation. As such it is going to only be mainly appreciated I suspect by \nthose that are fluent enough in English to follow along the British dialogue in \nthe movie without too much difficulty as it were, despite several language \nofferings of it for you additionally here. Furthermore I would like to\nadd (if you will allow me the indulgence, as it were) that I note that\nno other language offers the precision of English in the doing of justice\nto what would be any writers fullest intent - with any material I should think\nother than what would be conveyed in the language of mathematics itself perhaps!\nThat's why I advocate for English as a common bridge for all mankind in all\ncommon forums. \n\nRussia House comes from a brilliant piece of writing by John Le Carre. \n\nIt is a message for the uniting of human beings in a common cause - survival of\nthose that deserve to be free to follow their conscience and place the welfare of \nthe human race above political considerations or loyalties that are limited in \nvision as a result particularly perhaps of a brand of bigotry of sorts - that\ncaliber that tends to breed nationalism above humanism of the best spirit in fact.\n\nThe message of the movie is that the Russian woman that is played by Michelle \nPfeiffer so beautifully is a woman for whom we must be prepared to stake our \nfutures altogether. We must be as much for her as we are for anyone else on this \nearth. That is the decision that Sean Connery's character makes in this movie in\nhis bid to assure that mutual deterrence is at least maintained so as to secure \nRussia against those that might strike her without just cause. This is his \nresponse to being asked to be a &quot;decent human being&quot; by the Russian character in\nthe movie that is his source of intelligence in the provision of possible secret \ninformation of great value in fact. There is after all no greater cause for which \nwe might choose to live than to preserve Michelle Pfeiffer from all that would \nthreaten her in what would be a carnage of the human spirit. Sean Connery's \ncharacter is therefore acting in good conscience for us all in making our world a \nbetter place to be based on good sense alone. She additionally certainly inspired \nromantic love and passion and no doubt this factors in for Connery's character in \nthe movie additionally.\n\nIt was sad to see how little Russia was aided in its drive towards democracy and a\nfree economy at a time when help was most needed. This is something that shouldn't \nescape notice as it suggests that we do not at present follow the best advice on \nthe world stage for lack of leadership that has true and real wisdom as is the\nsort demonstrated by taking the message of this movie to heart. It is my most \nsincere hope and desire that this will in fact change and soon and indeed forever \nmore. The Russians are uniquely beautiful in Europe in what is both - physical\nand spiritual European beauty of the true Irish spirited hearts!\n\nMichael Rizzo Chessman\nmoviesbyrizzo\t","torrent":{"xt":"urn:btih:0631aeb7658ca3902d369543d60bb6fd4a8d1813","amp;dn":"The+Russia+House+%281990%29+720p+HDTV+H.264+%28moviesbyrizzo%29+MKV","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0631aeb7658ca3902d369543d60bb6fd4a8d1813","infoHashBuffer":{"type":"Buffer","data":[6,49,174,183,101,140,163,144,45,54,149,67,214,11,182,253,74,141,24,19]},"announce":[],"urlList":[]}}