{"title":"The Trillion-Dollar Lawsuit That Could End Financial Tyranny","uid":7059066,"size":54392151,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:08bea8b7c5aba8acc4203962e539c23d47faa386&amp;dn=The+Trillion-Dollar+Lawsuit+That+Could+End+Financial+Tyranny&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"aware76","files":10,"time":1330272857,"description":"---PDF files made using web2pdfconvert.com---\n\nThis folder contains PDFs of the entire 'Financial Tyranny' articles created by David Wilcock at divinecosmos.com\n\nSeveral people in the comments section following the article have said it needs to be made into pdf format to allow easy sharing of this mind blowing material. And since David is no doubt still mentally and physically exhausted after the sheer amount of time and effort it took him to compile these articles, I felt he could use a helping hand. I consider this my humble contribution to helping more people access this material. I do not wish to recieve any credit for this, all credit and thanks are due to David Wilcock, all those who aided him in the article's production, and divinecosmos.com for hosting the material. They have done simply amazing work with this.\n\nTo those out there who enjoy bad mouthing what they don't believe in, please take the time to at least attempting to read these. All the proof is in there.\n\nAnd please keep comments positive! :)\n\nI will seed whenever I can so please bear with me if my connection isn't great, I will seed it at all possible times I have.\n\nHELP THIS BECOME VIRAL - THERE HAS BEEN NO BIGGER NEWS IN OUR PLANET'S HISTORY!\n\nNamaste, love and light to all :)","torrent":{"xt":"urn:btih:08bea8b7c5aba8acc4203962e539c23d47faa386","amp;dn":"The+Trillion-Dollar+Lawsuit+That+Could+End+Financial+Tyranny","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"08bea8b7c5aba8acc4203962e539c23d47faa386","infoHashBuffer":{"type":"Buffer","data":[8,190,168,183,197,171,168,172,196,32,57,98,229,57,194,61,71,250,163,134]},"announce":[],"urlList":[]}}