{"title":"FS2004 &amp; FSX - Addictive VC-10 âœˆ","uid":7130161,"size":55541531,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:09a2930d8fb93a6ef4f53d58c4e5480df88b258b&amp;dn=FS2004+%26amp%3B+FSX+-+Addictive+VC-10+%E2%9C%88&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"P-51","files":-1,"time":1332634923,"description":"The model features a highly detailed virtual cockpit as well as a bright 2d cockpit with all around views. There are several liveries to choose from starting with the original BOAC Gold Speedbird livery and the British Airways &quot;Red Tail&quot; livery of the Seventies and early eighties. The East African Airways livery is also included plus a special RAF &quot;Tactical Grey&quot; K3 model which has deployable refueling hoses. There is also a special AI version of the K3 which deploys it's hoses automatically at altitudes between 10,000 and 25,000 feet so that you may set up AI flights for refueling practice using the freely available &quot;Traffic Tools&quot; program by Lee Swordy or other AI traffic programs.\n\nAs well as these real life liveries there are the current British Airways &quot;Union Flag&quot; livery, a virtual airline &quot;Trans Global Aviation&quot; with stunning glossy metallic effects and a plain white &quot;paint kit&quot; which you can use to create your own liveries.\n\nThe model features all the moving control surfaces, opening main doors and opening windows in the Virtual Cockpit. Deployable refueling hoses in the K3 model. A realistic sound set. Engine Smoke, Jetwash and Wing Tip Vortices effects. Great flight dynamics and a fully functioning autopilot. A more realistic High Fidelity (ie. harder!) autopilot will be available shortly as a free download for those who desire accuracy in detail. This will include the IAS and Mach Climb modes which were used in the real VC10 but does away with the climb rate and IAS speed settings. It is your choice which version you use.\n\nManufacturer's Description\nOne of the most powerful planes in its heyday, the charismatic VC-10 is known for its superb handling and flight dynamics. Loved by pilots from both the commercial and military sectors, the VC-10 is now available for your Flight Simulator and features photo-textures for all of the gauges and instruments in the 2D panel and the virtual cockpit.\n\nFeatures the following aircraft models:\nStandard VC-10\nSuper VC-10 including RAF K3 tanker\nVC-10 C1K\n\nLiveries included:\nAir Malawi\nBA Union\nBOAC (three versions '62, '65 and '69)\nBritish Airways\nBritish Caledonian\nBUA\nGhana Airways (two versions 1968 1975)\nGulf Air\nMiddle East Airlines\nNigeria Airways\nOmani Royal Flight\nSierra Leone\nUnited Arab Emirates\nFor Super VC-10\nBA Union Flag\nBOAC\nEast Afrikan Airlines\nRAF Tactical Grey K3\nTrans Global Aviation Virtual Airline\nAlso includes RAF Grey and Transport Command for VC-10 C1K ","torrent":{"xt":"urn:btih:09a2930d8fb93a6ef4f53d58c4e5480df88b258b","amp;dn":"FS2004+%26amp%3B+FSX+-+Addictive+VC-10+%E2%9C%88","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"09a2930d8fb93a6ef4f53d58c4e5480df88b258b","infoHashBuffer":{"type":"Buffer","data":[9,162,147,13,143,185,58,110,244,245,61,88,196,229,72,13,248,139,37,139]},"announce":[],"urlList":[]}}