{"title":"Ancestors in the Attic S01 to S04 - Canada FamilyTreeHunting Typ","uid":7148254,"size":7337224472,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:0a518c9754800e691f5ae74e6eb187ed805ffb17&amp;dn=Ancestors+in+the+Attic+S01+to+S04+-+Canada+FamilyTreeHunting+Typ&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"psspss","files":30,"time":1333208849,"description":"Ancestors in the Attic S01 to S04 - Canada FamilyTreeHunting Type Series (2010-2012) Season 1 to 4 Collection2 (like Who Do you think you are)\n\ndocu-reality show.. where people go looking into the past of family trees\nsome say this is way better then who do you think you are?\n\nhowever I converted these from a low bitrate webstream.. video is\nnot too bad but audio has some harmonics.. which you can improve\nusing VLC real time audio EQ setting like FLAT preset!\n\nthis is the rest of the programme I could source.. theres a few episodes\nmissing in Season 1 but rest are complete\nexcept some of Season 4 I previous uploaded so go and grab that\nto complete the set\nhowever I see only 55 downloaded it and one only seeding it still :((\nso good luck getting those.\n\n\nIF GRABBING HELP TO SEED!!!\n\nenjoy\n\n==I recommend VLC 2.0.1 alpha Mar 2012 to watch\nxvids and to set real-time sharpener on and slide\nthe knob a little to the right (not too much) it\nreally makes a big difference to the video output\ntry it and see what I mean .. get it from videolan.org\nit rid the noise and washed out feel and\nbrighten key white areas on the fly. also enable GPU\nacceleration can really help playback speeds\ntry this before complaining about corrupted video\nand bad video. also the 2.1 beta plays xvids\nworse in fact but maybe plays mp4s better\nhowever Im still wondering if ver 1.11.1 plays\nbetter as it seems more smooth. MPC with K-lite is\ngood to but lacks the sharpener filter VLC has\n===================================","torrent":{"xt":"urn:btih:0a518c9754800e691f5ae74e6eb187ed805ffb17","amp;dn":"Ancestors+in+the+Attic+S01+to+S04+-+Canada+FamilyTreeHunting+Typ","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0a518c9754800e691f5ae74e6eb187ed805ffb17","infoHashBuffer":{"type":"Buffer","data":[10,81,140,151,84,128,14,105,31,90,231,78,110,177,135,237,128,95,251,23]},"announce":[],"urlList":[]}}