{"title":"RailWorks 3 - West Coast Main Line North","uid":7188569,"size":417864532,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:0b2bed16f503bfcf44db96f72e059981ad32fb25&amp;dn=RailWorks+3+-+West+Coast+Main+Line+North&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"SH0CK90","files":-1,"time":1334536486,"description":"The most significant route expansion since the launch of RailWorks, West Coast Main Line North brings you well over 100 miles of highly-detailed railway line, with stations, yards, cuttings, viaducts and stunning scenery. West Coast Main Line North recreates the route between Carlisle and Glasgow as it appeared in the early 1990s, with no less than 26 realistically-modelled stations and halts. Also included is the brand new Class 86 electric locomotive, which was built specifically to haul express passenger services on the route, and which comes with accurate British Rail Mk3 buffered coaches. Built to cover the distance quickly and comfortably, the Class 86 can really stretch its legs on this long and fast line. For a change of pace, there are also full recreations of the yards along the route including Polmadie, Mossend and Kingmoor yards.\n\n\nIncludes:\nAccurate recreation of the West Coast Main Line northern section from Carlisle to Glasgow\nClass 86 electric locomotive in British Rail Intercity Executive livery\nBuffered Mk3 coaches in British Rail Intercity Executive livery\n\n12 scenarios\nFree Roam: Carlisle Station\n\nPick a train by clicking on it, then explore the route.\nFree Roam: Carstairs Station\n\nPick a train by clicking on it, then explore the route.\nFree Roam: Glasgow Central Station\n\nPick a train by clicking on it, then explore the route.\nFree Roam: Mossend Yard\n\nPick a train by clicking on it, then explore the route.\nFree Roam: Motherwell Station\n\nPick a train by clicking on it, then explore the route.\nFree Roam: Polmadie Depot\n\nPick a train by clicking on it, then explore the route.\nPolmadie Hop\n\nUsing celebrity 47569 Gloucestershire Regiment form a southbound express at Polmadie depot before hauling it into Glasgow Central.\nHand Over\n\nDrive the Class 86 passenger train assembled in the Polmadie Hop scenario from Glasgow Central down to Carstairs, stopping at Motherwell.\nKingmoor Sunset\n\nUsing a Class 37, perform freight shunting duties at Kingmoor, assembling two rakes in preparation for departure all over the WCML.\nCarstairs Split (Career System Scenario)\n\nDrive a Class 86 on a semi-fast service to Glasgow Central from Carlisle. The train needs splitting at Carstairs, where the rear four coaches are bound for Edinburgh. Your stops are timetabled.\nThe Argyle Line (Career System Scenario)\n\nThe multiple units usually running on the Argyle line have been suspended this weekend for maintenance so Class 86 hauled stock is being used instead. Try and maintain the usual timetable as you stop at the suburban stations on the line until Rutherglen.\nScots Pine (Career System Scenario)\n\nDrive a shipment of timber using a Class 47 from Mossend to Kingmoor. You will need to stop at a couple of passing loops to allow priority trains to pass.","torrent":{"xt":"urn:btih:0b2bed16f503bfcf44db96f72e059981ad32fb25","amp;dn":"RailWorks+3+-+West+Coast+Main+Line+North","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0b2bed16f503bfcf44db96f72e059981ad32fb25","infoHashBuffer":{"type":"Buffer","data":[11,43,237,22,245,3,191,207,68,219,150,247,46,5,153,129,173,50,251,37]},"announce":[],"urlList":[]}}