{"title":"Turbo Squid : Fume FX Advanced tutorial","uid":7187552,"size":6092791813,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:0cc51422ede83f8431ba75b5d218ea7562a4c46d&amp;dn=Turbo+Squid+%3A+Fume+FX+Advanced+tutorial&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"orbit_u","files":-1,"time":1334499775,"description":"for sample visit\n\nFume FX: Advanced - the ultimate solution for Fume FX Training\nThe sequel to the highly acclaimed Fume FX: Essentials, which is has \nmade its way into practically every major visual effects studio \naround the world as their primary resource for fluids and Fume FX, as \nwell as utilized during the development of many big Hollywood visual \neffects films. With over 10,000 units sold, this makes the Fume FX: Essentials the most popular fluids training resource for 3D Studio Max\nin the world!\n\nJust released, the new and highly anticipated Fume FX: Advanced, focuses \non covering many of the advanced subjects for fluid simulations, \ncreating photo realistic Fire and smoke, and massive explosions that \nrival most real explosions and stock footage. This DVD prepares both intermediate and professionals alike, for tackling the most difficult of visual effects shots, with confidence and solid knowledge and understanding of fluids and particles, shaders and compositing to conquer the most ambitious FX and approach the tasks correctly.\n\nThis DVD covers industry techniques and walks through many practical examples of real life visual effects shots, from the initial pre-production and planning, building scripts to automate your tasks and enhance particles to manage your fluids containers for you, or to be driven by your fluids, all the way through to rendering and preparing your scenes, rendering, and finally compositing the final effects into your visual effects shots.\n\nWith high resolution and crystal clear sound, and over 24 \nhours of video! This DVD is the ultimate training solution for both film \nand game studios alike! Aimed at advanced users, the DVD does cover topics thoroughly and explain methods clearly enough that most people should still be able to follow at any level, but having a good solid understanding of FX is recommended.","torrent":{"xt":"urn:btih:0cc51422ede83f8431ba75b5d218ea7562a4c46d","amp;dn":"Turbo+Squid+%3A+Fume+FX+Advanced+tutorial","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0cc51422ede83f8431ba75b5d218ea7562a4c46d","infoHashBuffer":{"type":"Buffer","data":[12,197,20,34,237,232,63,132,49,186,117,181,210,24,234,117,98,164,196,109]},"announce":[],"urlList":[]}}