{"title":"We.Need.to.Talk.About.Kevin.2011.720p.BDRip.x264.AC3-Zoo","uid":7036265,"size":2792689956,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:0ce49133f28bf19e73ef13f8201a83fe6e58b1e5&amp;dn=We.Need.to.Talk.About.Kevin.2011.720p.BDRip.x264.AC3-Zoo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":2,"time":1329351013,"description":"Adolescent Kevin Katchadourian (Ezra Miller) is in prison after committing a massacre at his high school and killing his father and little sister using a high tech bow and arrow set. His mother, Eva (Swinton), a once-successful travel writer, lives alone in a run-down house and works in a mall travel agency in a town near the prison where she visits Kevin. She looks back at her memories of him growing up as she tries to cope with the anger and hostility of her neighbors, who know her to be Kevin's mother. Her memories are shown in flashbacks.\n\nThroughout Kevin's life he has been detached and difficult. He does not bond with his mother; as a baby he cries incessantly, resists toilet training, rebuffs her attempts at affection, and shows no interest in anything. While he is still small, Eva's frustration with his intractability drives her to throw Kevin against the wall, breaking his arm. When Eva tries to talk to her husband, Franklin (John C. Reilly), about her increasing concern about Kevin's problems, he dismisses her concerns and makes excuses for Kevin's strange behaviour. Their second child, Celia, is lively and cheerful. Kevin finally shows interest in something when Franklin gives Kevin a bow and arrow set and teaches him archery. Kevin becomes an excellent marksman. When Celia's pet is killed, and she is blinded in one eye by an incident with a caustic cleaning fluid, Eva is convinced Kevin has hurt her and her pet on purpose, while Franklin insists these events were accidents and that he is blameless. This pattern of suspicion on Eva's part and excuse on Franklin's intensifies Eva's fear of her son, as she sees growing evidence of Kevin's pleasure in hurting others. This culminates with his plotting and executing the multiple killings of his father, Celia, his teachers, and fellow students, and his imprisonment for the crimes.\n\nThe film concludes on the second anniversary of the massacre, when Eva visits Kevin in prison. Kevin is anxious because his eighteenth birth-day and transfer to an adult prison is imminent. Eva asks him why he committed the murders and he responds that he no longer knows why. Eva gives Kevin a hug and says her good-byes while he is taken away. &lt;a href=&quot;\nhttp://www.host-images.com/u/files/pseflvn0yj9p08xnaivl.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.host-images.com/u/files/pseflvn0yj9p08xnaivl.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://www.host-images.com/u/files/ht8qbhk9ulpo2hogh3sl.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.host-images.com/u/files/ht8qbhk9ulpo2hogh3sl.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://www.host-images.com/u/files/eux0zwqz9l09cdzw1h1l.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.host-images.com/u/files/eux0zwqz9l09cdzw1h1l.jpg&lt;/a&gt;\n\n\nTitle ______________ We Need to Talk About Kevin\nSource _____________ Blu-ray\nRelease ____________ 02-16-2012\nRipper _____________ Zoo\nRuntime ____________ 01:51:58\nVideo ______________ x264 @ 2,877 Kbps\nAudio ______________ AC3 6CH @ 448 Kbps\nResolution _________ 1280 x 544\nGenre ______________ Drama | Thriller\nLanguage ___________ English\nSubtitle ___________ N/A\n","torrent":{"xt":"urn:btih:0ce49133f28bf19e73ef13f8201a83fe6e58b1e5","amp;dn":"We.Need.to.Talk.About.Kevin.2011.720p.BDRip.x264.AC3-Zoo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0ce49133f28bf19e73ef13f8201a83fe6e58b1e5","infoHashBuffer":{"type":"Buffer","data":[12,228,145,51,242,139,241,158,115,239,19,248,32,26,131,254,110,88,177,229]},"announce":[],"urlList":[]}}