{"title":"WINDOWS 7 ULTIMATE USB STICK and EXTERNAL HDD EDITION","uid":7153164,"size":6505322657,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:0db3504e1c0e778db504711b69983782d5f86448&amp;dn=WINDOWS+7+ULTIMATE+USB+STICK+and+EXTERNAL+HDD+EDITION&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"bloxwich0","files":1,"time":1333373443,"description":"WINDOWS 7 ULTIMATE USB EDITION v4Beta\n\n\n\nTHE INITIAL PROGRAM WAS PRODUCED BY iMortaluz...\n...it's his work, not mine, so please give him the credit he deserves!\n\n\nTHIS NOW MEANS YOU CAN CARRY WINDOWS 7 ULTIMATE WITH YOU ANYWHERE YOU GO,\nON A USB MEMORY STICK OR AN EXTERNAL HARD DISK DRIVE!\n\n\n\nI HAVE PRODUCED TWO ACRONIS TRUE IMAGE BACKUPS, USING ACRONIS TRUE IMAGE HOME 2010,\nIN AN ATTEMPT TO MAKE IT EASIER TO INSTALL &quot;iMortaluz's&quot; SOFTWARE ON A USB MEMORY STICK OR\nEXTERNAL USB/HDD. YOU WILL ALSO NEED A COPY OF ACRONIS TRUE IMAGE HOME 2010 INSTALLED ON YOUR PC.\n\n\nEXTRACT THE TWO FILES &quot;Windows7-USB-Edition-v4Beta.tib&quot; AND &quot;Windows7-USB-HDD-Edition.tib&quot;\nFROM THE WINRAR ARCHIVE TO A TEMPORARY FOLDER, DO NOT OPEN THEM UP.\n\n\nBEFORE YOU START EITHER OF THE FOLLOWING TWO METHODS, MAKE SURE YOUR USB or HDD IS FORMATTED IN NTFS\nAND ALSO PLEASE BEAR IN MIND THAT ANY SOFTWARE ON THESE TWO DRIVES WILL BE ERASED,\nSOMETHING FOR WHICH I AM NOT RESPONSIBLE!\n\n\n\n\n1.) METHOD FOR USB MEMORY STICK:-\n\n\na] MAKE SURE YOU USE A USB MEMORY STICK WITH A MINIMUM CAPACITY OF AT LEAST 8GB AND FAST DATA TRANSFER.\n\n(YOU SHOULD ENSURE THE USB WHICH YOU USE IS CAPABLE OF HAVING THE REMOVABLE MEDIA BIT &quot;FLIPPED&quot;)\n\nI USED A LEXAR 8GB JUMPDRIVE RETRAX USB AND BOOTIT.EXE, WHICH IS A LEXAR FILE UTILITY TO FLIP THE &quot;RMB&quot;.\n\n\nb] PLUG THE USB INTO YOUR PC AND RUN BOOTIT.EXE (IT IS INSIDE THE WINRAR ARCHIVE), FOLLOW THE INSTRUCTIONS.\n\nTHE BOOTIT.EXE FILES (SEE THE ARCHIVE) COULD ALSO BE EXTRACTED TO THE TEMPORARY FOLDER YOU CREATED.\n\n\nc] IN ORDER TO RUN WINDOWS ON A USB, THE PC MUST RECOGNISE THE USB AS A FIXED DRIVE AND NOT A REMOVABLE ONE.\n\nCHECK IN WINDOWS EXPLORER/COMPUTER AND ENSURE THAT THE USB IS NOW SHOWN IN THE HARD DISK DRIVES SECTION AND\n\nNOT AS A REMOVABLE STORAGE DEVICE. WHERE THE USB DRIVE IS FOUND INDICATES WHETHER THE BIT IS FLIPPED OR NOT!\n\nYOU MAY NEED TO TRY SEVERAL MANUFACTURERS USB's AS NOT ALL OF THEM WILL &quot;FLIP THE BIT&quot;.\n\n\nd] IF THE USB IS RECOGNISED AS A HARD DISK DRIVE, IMAGE &quot;WINDOWS 7-USB-Edition-v4Beta.tib&quot; ACROSS TO YOUR \n\nUSB STICK USING ACRONIS TRUE IMAGE HOME 2010 AND THE RECOVERY OPTION.\n\n\ne] RE-BOOT YOUR PC WITH THE USB INSERTED AND CHECK THAT THE BIOS WILL SEE THE USB AS THE FIRST BOOTABLE MEDIA.\n\n\n\nPLEASE BE PATIENT, THE FIRST TIME WILL TAKE A WHILE, BUT IT DOES WORK VERY QUICKLY ONCE CONFIGURED.\n\n\n\n\n\n\n2.) METHOD FOR EXTERNAL USB/HDD:-\n\n\na] CONNECT THE HDD, USING A SUITABLE CABLE, TO A USB PORT ON YOUR PC.\n\n\nb] IMAGE &quot;WINDOWS 7-USB-HDD-Edition.tib&quot; ACROSS TO YOUR USB/EXTERNAL HDD (I USED A 2.5&quot; SEAGATE SATA 20GB CAPACITY HDD) \n\nUSING ACRONIS TRUE IMAGE HOME 2010 AND THE RECOVERY OPTION.\n\n\nc] RE-BOOT YOUR PC WITH THE USB/HDD CABLE STILL CONNECTED AND CHECK THAT THE BIOS WILL SEE THE USB/HDD AS THE FIRST \n\nBOOTABLE MEDIA.\n\n\n\nPLEASE BE PATIENT, THE FIRST TIME WILL TAKE A WHILE, BUT IT DOES WORK VERY QUICKLY ONCE CONFIGURED.\n\n\n\n\n!!!PLEASE LEAVE FEEDBACK!!!\n\nI WILL TRY TO HELP OR ADVISE ABOUT MY METHOD IF YOU HAVE A PROBLEM!\n\n\n\nDO NOT FORGET, THE ORIGINAL PROGRAM WAS CO0MPLETED BY iMortaluz, GIVE HIM THE RESPECT HE DESERVES!!!\n","torrent":{"xt":"urn:btih:0db3504e1c0e778db504711b69983782d5f86448","amp;dn":"WINDOWS+7+ULTIMATE+USB+STICK+and+EXTERNAL+HDD+EDITION","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0db3504e1c0e778db504711b69983782d5f86448","infoHashBuffer":{"type":"Buffer","data":[13,179,80,78,28,14,119,141,181,4,113,27,105,152,55,130,213,248,100,72]},"announce":[],"urlList":[]}}