{"title":"Binary Domain RF Xbox360","uid":7040029,"size":8738850596,"categoryP":"games","categoryS":"xbox360","magnet":"?xt=urn:btih:115b1d262db171b6c89d2a6a8638e32c50a9186b&amp;dn=Binary+Domain+RF+Xbox360&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"doponme22","files":-1,"time":1329505553,"description":"Year: 2012\nGenre: Action (Shooter) / 3D / 3rd Person\nDeveloper: Ryu ga Gotoku Studio\nPublisher: Sega\nFirmware: LT +3.0. (XGD3)\nRegion: Region Free\nDashboard: 13,599\nPlatform: XBOX360\nLanguage: English (ENG)\n\nDescription: Tokyo, 2080. On the streets of metropolis converged in fierce fighting people, and robots. International peacekeeping force, sent to stabilize the situation, fights in abandoned areas. But in a war with such an unusual and seemingly alien to human nature of the enemy soldiers are beginning to wonder whether what they are doing? Does the machine have become so humane? Or is it people are gradually turning into robots?\n\n-Especially for the Binary Domain created an innovative artificial intelligence system. Opponents will be able to assess the situation on the battlefield and be responsive to changes. Therefore, players will have to carefully plan their actions and do not forget to be careful. Only then can they succeed!\n\nFeatures:\nTwo-faced city. Discover two different Tokyo started and destroyed the &quot;lower city&quot; and a great technologically advanced &quot;upper city&quot;.\nIrreversible effects. In the midst of battle motivate his comrades; Marshall trusting relationships in the unit, check its ability to promptly make difficult decisions, knowing what the consequences they may lead. Every action, every choice, every word can change everything!\nInvaluable information. Fully destructible, but at the same time extremely hardy robots can adapt to the damage inflicted by them, so do not miss the opportunity to scrutinize the enemy, to find its strengths and weaknesses, and then use this knowledge in action.\nFully prepared. At your disposal a vast arsenal of unique weapons - modify any! And do not forget to improve the ability to become faster, stronger, more accurate shooting.\nWar online. A variety of multiplayer modes make it possible to test himself in the battles on the network - shoulder to shoulder with friends or against each other","torrent":{"xt":"urn:btih:115b1d262db171b6c89d2a6a8638e32c50a9186b","amp;dn":"Binary+Domain+RF+Xbox360","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"115b1d262db171b6c89d2a6a8638e32c50a9186b","infoHashBuffer":{"type":"Buffer","data":[17,91,29,38,45,177,113,182,200,157,42,106,134,56,227,44,80,169,24,107]},"announce":[],"urlList":[]}}