{"title":"Broken Lance (1954) PAL DVD5","uid":7054922,"size":4049172480,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:12a51e0e4eaa945a53d7c10cbcf262fe82bbf47a&amp;dn=Broken+Lance+%281954%29+PAL+DVD5&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"bradpito","files":-1,"time":1330080434,"description":"IMDB: http://www.imdb.es/title/tt0046808/\nYear: 1954\nDirector: Edward Dmytryk\nCountry: USA\nGenre: Western\nRuntime: 94 min.\nCast: pencer Tracy (Matt Devereaux), Robert Wagner (Joe Devereaux), Jean Peters (Barbara), Richard Widmark (Ben Devereaux), Katy Jurado (SeÃƒÂ±ora Devereaux), Hugh O'Brian (Mike Devereaux)\n\n\n:: Synopsis ::\nIn this Western with curiously Shakespearean undertones, Matt Devereaux (Spencer Tracy) is a ranch owner who has tried to raise his sons to carry on the fierce, hard-working spirit that helped make him a success. However, as a consequence, he never learned to show them affection and treats his boys little better than the hired help. Joe (Robert Wagner), is Matt's son by Native American wife SeÃƒÂ±ora (Katy Jurado). Because of Joe's mixed ethnicity, he is treated prejudicially by his three half-brothers, Ben (Richard Widmark), Mike (Hugh O'Brian), and Danny (Earl Holliman) -- all Caucasian sons of Matt's first wife. Joe loves his father and would do nearly anything for him, but his siblings resent Matt's emotional distance. When Matt discovers a nearby copper mine is polluting a stream where he waters his cattle, he becomes furious and leads a raid on the mine that causes the law to visit the ranch; the police have a warrant to arrest whoever was responsible for the attack. To spare his father the agony and humiliation of a stay behind bars, Joe claims responsibility and spends several years in prison. When he's released, he discovers that Ben and his other brothers rebelled against their father with such extremity that the old man suffered a fatal stroke. While SeÃƒÂ±ora tries to persuade Joe not to seek revenge, Ben is more than willing to fight his brother for taking his father's side. Screenwriter Philip Yordan won an Academy Award for his work on Broken Lance, while Katy Jurado received a Best Supporting Actress nomination for her performance as SeÃƒÂ±ora. -- Mark Deming\n\n\n:: Technical Info ::\nVideo Format: PAL\nDVD Source: DVD5\nAspect Ratio: 16:9\nAudio: DD 2.0 Spanish, English\nSubtitles: Spanish, English\nExtraction: DVD Decrypter\n\n","torrent":{"xt":"urn:btih:12a51e0e4eaa945a53d7c10cbcf262fe82bbf47a","amp;dn":"Broken+Lance+%281954%29+PAL+DVD5","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"12a51e0e4eaa945a53d7c10cbcf262fe82bbf47a","infoHashBuffer":{"type":"Buffer","data":[18,165,30,14,78,170,148,90,83,215,193,12,188,242,98,254,130,187,244,122]},"announce":[],"urlList":[]}}