{"title":"Angry Birds Portable","uid":7254628,"size":161889636,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:12f3bfea6ebadd989e13a8994e8af2fb3f3964cc&amp;dn=Angry+Birds+Portable&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"thoinfocam","files":734,"time":1336551450,"description":"All Portable included:\n\nAngry Birds Space - \nfrom floating through space to using the\ngravity of nearby planets to set up spectacular trick shots,\nAngry Birds Space takes the gameplay that fans already know\nand love to a totally new level. With brand new birds, brand\nnew superpowers, and a whole galaxy to explore, the sky is no\nlonger the limit!\n\n\nAngry Birds Rio\nThe Angry Birds have been captured, caged, and taken to Rio!\nThere they meet new friends, and work together to make their\nescape from a desolate grey warehouse to the lush green\njungle. Help the Angry Birds escape and beat their captors by\nbombarding the evil marmosets and smashing all obstacles in\nthe way!\n\n\n\nAngry Birds Season\nFireworks popping, lanterns glowing, red envelopes bursting\nwith money - it's Chinese New Year! This holiday is China's biggest and longest festival, a time for feasting with family and friends, setting off fireworks, and having fun. The are celebrating the start of the Year of the Dragon, but the piggies are trying to scare them away from their eggs! Luckily the Angry Birds have some help -- the Mighty Eagle has transformed into the fearsome Mighty Dragon!\n\n\n\nIn this torrent is Angry Birds, Rio, Seasons and Space.\n\nUse this code to activate all the games: THET-ALEV-LEFR-USWO\n\nVisit and support:","torrent":{"xt":"urn:btih:12f3bfea6ebadd989e13a8994e8af2fb3f3964cc","amp;dn":"Angry+Birds+Portable","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"12f3bfea6ebadd989e13a8994e8af2fb3f3964cc","infoHashBuffer":{"type":"Buffer","data":[18,243,191,234,110,186,221,152,158,19,168,153,78,138,242,251,63,57,100,204]},"announce":[],"urlList":[]}}