{"title":"The Pirates! Band Of Misfits XVID CAM GLOBE","uid":7186467,"size":885131623,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:131cfc596f898d2ab5ed241f9ab0e148aab4cf58&amp;dn=The+Pirates%21+Band+Of+Misfits+XVID+CAM+GLOBE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"globeplus","files":-1,"time":1334445261,"description":"* XVID CAM  * 01H20M28S    * + 1300 Bitrate    * Worked with the Dub plugins\n\n\n\n* FILE INFO :\n\n\n- Black borders at the top and the bottom in full screen corrected\n\n- particles on the picture background reduced to the minimum\n\n- colours improved\n\n \n\n\n* Plot :\n\n\nA crew of amateur pirates under the direction of the ambitious but \n\nequally inexpert Pirate Captain try to plunder ships so that the \n\nPirate Captain can accomplish his dream of winning the Pirate of the \n\nYear Award and outsmart his rivals, Black Bellamy and Cutlass Liz. \n\nAfter various failed raids on useless ships- including a plague boat, \n\na nudist boat, and a ghost ship-, they hijack the Beagle and encounter \n\nCharles Darwin, who informs them that Polly, the supposed parrot of \n\nthe pirate crew, is actually the last living dodo. The pirates go with \n\nDarwin and his trained chimpanzee Mr. Bobo to London to show Polly to \n\nthe Royal Society. Their plan is a success, but the pirates (who are \n\ndisguised as scientists) are unmasked by Queen Victoria, who hates \n\npirates.\n\nThe Pirate Captain leaves Polly with the queen in return for a pardon \n\nand a large gold treasure. He presents the treasure at the Pirate of \n\nthe Year competition, but he is disqualified and exiled when his \n\npardon is discovered; in addition, his crew abandons him when they \n\nlearn that he sold Polly. Returning to London in an attempt to save \n\nPolly, the Pirate Captain reunites with Darwin. Together they find out \n\nthat Queen Victoria is planning to eat Polly and other rare animals at \n\na secret meeting with other heads of state on her flagship, the QV1. \n\nThe duo hijack an airship from the Royal Society, fly to the QV1 and \n\nconfront Victoria. With the support of the pirate crew and Mr. Bobo, \n\nthey are able to save Polly, sink the QV1 and defeat Victoria. In the \n\nend, the Pirate Captain learns the value of friendship and loyalty \n\nwhile Darwin finds a girlfriend on the Galapagos Islands and Mr. Bobo \n\njoins the pirate crew.\n","torrent":{"xt":"urn:btih:131cfc596f898d2ab5ed241f9ab0e148aab4cf58","amp;dn":"The+Pirates%21+Band+Of+Misfits+XVID+CAM+GLOBE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"131cfc596f898d2ab5ed241f9ab0e148aab4cf58","infoHashBuffer":{"type":"Buffer","data":[19,28,252,89,111,137,141,42,181,237,36,31,154,176,225,72,170,180,207,88]},"announce":[],"urlList":[]}}