{"title":"tlDatabase data editing software","uid":7186444,"size":24525267,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:14abd1153c18b13eee611476273f4037cb9c9b81&amp;dn=tlDatabase+data+editing+software&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"you_see","files":3,"time":1334444583,"description":"tlDatabase 2011 data editing software (original crack)\n\nInstructions\n~~~~~~~~~~~~\n\n1. Run installer\n2. Copy cracked exe over real one in Program Files\n3. Run the app twice\n4. Software is now cracked\n\nDescription\n~~~~~~~~~~~\n\nEasy-to-use data editing software\n- Get up and running quickly with templates\n- Customisable: Create any kind of structured data\n- Advanced Styles system\n- Multi-user system with privileges\n- Fully internationalized (full Unicode support)\n- Integrated scripting [Advanced]\n- Sophisticated Search System\n- Advanced Document Statistics\n- XML-based\n- User-friendly: Allow users to edit structured data without them having to 'get their hands dirty' with XML! \n- Free Reader for viewing a tlDatabase document\n- Advanced Filter ('conditional search') allows you to find, work with or export a subset of the data based on many different advanced conditions. This is combined with our advanced statistics filters, allowing you to do things such as say &quot;show me all entries where element X has 3 or more Y child elements&quot;. User-based filters allow you to perform queries such as &quot;show me all entries edited by Bob or Alice, last month&quot;.\n- Tagging allows you to easily tag individual records for viewing, working with or exporting\n- XML Line by Line Import can help you import &quot;weak&quot; SGML-ish data and convert it to XML, including automatic fixing of various badly nested tags\n- Command-line driven functionality, optionally combined with the integrated scripting language, allows the application to be automated\n- Styled RTF Exporter allows you to easily export your data for opening in Microsoft Word or OpenOffice\n- Styled HTML Exporter allows you to easily export your data for upload to a website\n- Automatic Numbering styles allow any element to automatically be numbered (e.g. ingredient or 'step' lists in a cookbook). Numbering schemes may also be chosen (e.g. Arabic numerals vs Roman numerals).\n- Watch Folders allows you to specify folders in which incoming XML files are automatically imported into your database. An automated order processing system can therefore, for example, automatically process incoming orders using the integrated scripting language.\n- Our advanced electronic/Web publishing platforms allow you to publish your data with advanced features for end-users (for example, an electronic cookbook with sophisticated search functionality for users)\n- Localizable Interface\n- &quot;Smart Styles&quot; allow styled output generation to be programmed using the integrated scripting language\n","torrent":{"xt":"urn:btih:14abd1153c18b13eee611476273f4037cb9c9b81","amp;dn":"tlDatabase+data+editing+software","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"14abd1153c18b13eee611476273f4037cb9c9b81","infoHashBuffer":{"type":"Buffer","data":[20,171,209,21,60,24,177,62,238,97,20,118,39,63,64,55,203,156,155,129]},"announce":[],"urlList":[]}}