{"title":"The Cabinet of Dr. Caligari (1919) FULL DVD (ISO)","uid":7051439,"size":3681615872,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:1768909a9436e009a4ce28dd258ba359ccadc12b&amp;dn=The+Cabinet+of+Dr.+Caligari+%281919%29+FULL+DVD+%28ISO%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Auge","files":-1,"time":1329973305,"description":"I am providing important films in ISO for the film buff or novice film historian. It is nearly impossible to find torrent files that include all the extras or even important commentaries. \n\n*** PLEASE SEED FOR AT LEAST FIVE DAYS, THATS NOT ASKING TO MUCH AND IT WILL HELP TO INSURE THAT I CAN KEEP PROVIDING THESE DVDS. ***\n\nThis is a DVD rip to an ISO so you can watch it on your media player, mount it to a virtual drive or burn it to a DVD.\n\nThis file includes EVERYTHING the original DVD has:\n\n1919\n72 minutes\nBlack and White (cyan)\n1.33:1\nSpoken Language: English  \nSubtitles: Title Cards\n\nDirector: Robert Wiene\n\nCast: Werner Krauss, Conrad Veidt, Fredrich Feher, Lil Dagover, Hans Heinrich von Twardowski, Rudolf Lettinger\n\nGenres: Classics, Horror Classics, Silent Films, Germany, Foreign Regions\n\nDisc Features:\n* An interesting presentation from Image. The print is seriously flawed, but then again, it is 80 years old. On an audio level, theres a choice of a re-created score or full commentary by film scholar Mike Budd, who talks at length about the films artistic, technological and social context. There are also some extras -- original art and photographs from the films 1920 opening and a short excerpt of the film Genuine: A Tale of a Vampire, by Caligaris creators. \nSYNOPSIS:  \nIn this silent 1920s masterpiece, an insane asylum inmate explains to his psychiatrist how he came to the institution, telling the shrink the story of the evil hypnotist Caligari (Werner Krauss) and his unwitting pawn, the sleepwalker Cesare (Conrad Veidt). This stark expressionist film from German director Robert Wiene astonishes with the power of its sets and visuals, and the creepy plot easily raises hackles on the back of ones neck.\n","torrent":{"xt":"urn:btih:1768909a9436e009a4ce28dd258ba359ccadc12b","amp;dn":"The+Cabinet+of+Dr.+Caligari+%281919%29+FULL+DVD+%28ISO%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1768909a9436e009a4ce28dd258ba359ccadc12b","infoHashBuffer":{"type":"Buffer","data":[23,104,144,154,148,54,224,9,164,206,40,221,37,139,163,89,204,173,193,43]},"announce":[],"urlList":[]}}