{"title":"Hard Anal Love","uid":7047561,"size":5768851088,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:17e2df736262628f085329033b5c8136a6f51f64&amp;dn=Hard+Anal+Love&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"filthy3825","files":6,"time":1329801592,"description":" &lt;a href=&quot;http://sharezones.biz/view.php?filename=2011/11/12/20b3b55b4c16ed932017d61284155b6a.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://sharezones.biz/view.php?filename=2011/11/12/20b3b55b4c16ed932017d61284155b6a.jpg&lt;/a&gt;\n\n\nClose-up anal artiste Mike Adriano presents \\\\\\&quot;Hard Anal Love,\\\\\\&quot; five scenes of hard-core butt play for just about anyone who longs to climb inside a beautiful woman\\\\\\'s asshole. The Adriano modus operandi is in full effect: slobbery blow jobs, evil ass-to-mouth action, intimate sodomy, tasty analingus - and three scenes that include the use of a bunghole-widening speculum. A spectacular variety of anal sluts take every inch of Mike\\\\\\'s love in this erectifying two-disc set. First, bodaciously endowed, leggy blonde MILF Julia Ann tempts us with her juicy ass and the huge, gravity-defying boobies that spill from her hot pink cotton mesh dress. The seasoned performer treats herself to some backdoor loving from Mike\\\\\\'s sturdy cock. Next, freaky Asian fox London Keyes wears silver spandex tights that cling to her phat, round buttocks. The tanned, busty cutie deep-throats Mike\\\\\\'s massive tool and drools spit into a glass bowl. Lovely Italian troublemaker Gia DiMarco offers up her anus for some hard buggery. The stacked, tattooed brunette tongues the director\\\\\\'s sphincter and eats his cum from a spoon. Big-assed fortysomething porn newcummer Tara Holiday joins sexy brunette Diana Prince in a nasty three-way. Mike reams the hot mama\\\\\\'s large, oily, glistening ass, then shoots his cum into Diana\\\\\\'s mouth. And gorgeous, willing, 21-year-old French blonde Jessie Volt shows off her perfect, all-natural body and winking asshole, then takes an anal stretching that transforms her rear end into a cavernous gape. These girls will do anything for anal love!","torrent":{"xt":"urn:btih:17e2df736262628f085329033b5c8136a6f51f64","amp;dn":"Hard+Anal+Love","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"17e2df736262628f085329033b5c8136a6f51f64","infoHashBuffer":{"type":"Buffer","data":[23,226,223,115,98,98,98,143,8,83,41,3,59,92,129,54,166,245,31,100]},"announce":[],"urlList":[]}}