{"title":"Home grown paranormal team videos - The ghost hunter &amp; SWAT ","uid":7258860,"size":1006583132,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:1919724111556724c69dd07fdfba0271daf9611a&amp;dn=Home+grown+paranormal+team+videos+-+The+ghost+hunter+%26amp%3B+SWAT+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"psspss","files":5,"time":1336662420,"description":"Cryptic Shadows S.W.A.T. Paranormal Team-Poltergeist Ghost Caught on Camera (Investigators Own House)-Aug2011.xvid avi\n\nI found these on youtube various home grown ghost hunters- they seemed interesting ghost investigations but with youtube its hard ot know\nwhats been faked but these looked legit or entertaining espc\nthe black dude with top hat and eye patch\ni had to crop them and up the volume heaps .. very bad editing and\nit always makes me laugh all these home grown paranormal groups\nlove their heavy metal music intros and annoying music louder  then person speaking why do they add music at all when someone is speaking\ncrazy!\n\nhelp to seed if grabbing\n\nenjoy\n\n==I recommend VLC 2.0.1 alpha Mar 2012 to watch\nxvids and to set real-time sharpener on and slide\nthe knob a little to the right (not too much) it\nreally makes a big difference to the video output\ntry it and see what I mean .. get it from videolan.org\nit rid the noise and washed out feel and\nbrighten key white areas on the fly. also enable GPU\nacceleration can really help playback speeds\ntry this before complaining about corrupted video\nand bad video. also the 2.1 beta plays xvids\nworse in fact but maybe plays mp4s better\nhowever Im still wondering if ver 1.11.1 plays\nbetter as it seems more smooth. MPC with K-lite is\ngood to but lacks the sharpener filter VLC has\n===================================\nPs/3 , phone and xbox users may consider grabbing\nthe free tool umile encoder 3.1.1.2 it can convert\nto most devices to make compatible in 8mins\non dual core or higher. as some of my converts may\nfail for certain devices.. you will need a pc to run it\nthough. no link just google it.. \n======================================","torrent":{"xt":"urn:btih:1919724111556724c69dd07fdfba0271daf9611a","amp;dn":"Home+grown+paranormal+team+videos+-+The+ghost+hunter+%26amp%3B+SWAT+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1919724111556724c69dd07fdfba0271daf9611a","infoHashBuffer":{"type":"Buffer","data":[25,25,114,65,17,85,103,36,198,157,208,127,223,186,2,113,218,249,97,26]},"announce":[],"urlList":[]}}