{"title":"Port.Royale.3-SKIDROW","uid":7238115,"size":4286520404,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:1c797f1a97c5ed491e96ffc56339f7d70565992b&amp;dn=Port.Royale.3-SKIDROW&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"ontotita","files":88,"time":1336055948,"description":"S K I D R O W\nthe leading force\n\nproudly presents\nPort Royale 3 (c) Kalypso Media\n\n03-05-2012....Release Date &lt;-&gt; Protection...........Serial+Custom\nStrategy.........Game Type &lt;-&gt; Disk(s)......................1 DVD\n\nRELEASE NOTES\n\nThe Caribbean, in the turbulent 17th Century. The mighty kingdoms of\nSpain, England, France and the Netherlands fight over the colonies\nAnd there you are, a young sea captain whose only goal is to become\nthe most powerful man in the New World. To achieve that goal, you may\nchoose one of the two available campaigns: will you become an\nAdventurer or a Trader?\n\nIf you chose the way of the Adventurer, lead an unforgiving campaign\nfor the conquest of the seas: invasion, piracy, bounty hunting\nraiding; do whatever it takes to build your own empire in the\nCaribbean. And of course, trade will have a less important role to\nplay in your rise\n\nThe way of the Trader is, on the opposite, mostly about developing\nyour riches and your economic power. To be the most powerful Trader of\nthe New World, you have to create trade routes, build industries and\ndevelop the economy of the colonies\n\nOf course, in Free Play mode, you can mix both of those in any way you\nwant, letting you create your own unique and exciting story\n\nFor the first time in the acclaimed Port Royale series, you are not\nalone in the beautiful and seemingly so peaceful seas of the Caribbean\nThe Multiplayer mode allows up to 4 players to play through LAN or over\nthe Internet. Develop a successful trading company, lead your ships in\nbeautiful 3D naval battles and force your opponents to their knees!\n\nKey Features:\n\nTwo different single player campaigns: Adventurer and Trader\n\nNaval battles, raids, plundering and invasions await the Adventurer\nwhile the Trader will develop trade routes and the economy to earn\nglory, fortune and power\n\n16 different ship types, such as powerful Galleons or versatile\nFrigates\n\nOrganize trade with 60 different cities such as Port-au-Prince or\nTortuga\n\nA competitive Multiplayer mode for up to 4 players\n\nA comprehensive trade system, with supply and demand dynamically\nsetting the price of goods and wares, like in the real world\n\nINSTALL NOTES\n\n1. Unpack the release\n2. Mount or burn image\n3. Install\n4. Copy everything from the SKIDROW folder into the game installation\n5. Play the game\n6. Support the companies, which software you actually enjoy!\n\n**NOTE**\nDont allow the game to get online, so block it with a firewall\n\nGREETINGS\n\nTo all friends of the family and honorable rival groups!\n\nascii art by the\ngodlike &amp; terrific duo\nmalodix + irokos\ntitan artdivision.","torrent":{"xt":"urn:btih:1c797f1a97c5ed491e96ffc56339f7d70565992b","amp;dn":"Port.Royale.3-SKIDROW","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1c797f1a97c5ed491e96ffc56339f7d70565992b","infoHashBuffer":{"type":"Buffer","data":[28,121,127,26,151,197,237,73,30,150,255,197,99,57,247,215,5,101,153,43]},"announce":[],"urlList":[]}}