{"title":"Project Diva 2 Extend","uid":7137980,"size":1333714670,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:1d7bbbea5b59b6595b9548fc237078e403410677&amp;dn=Project+Diva+2+Extend&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Haru-chan","files":1,"time":1332910546,"description":"For all you Vocaloid fans that are wanting the game text in english\nLook no further. The game itself is not in english but i put a patch with it so you can play without any worries. copy SEPLUGINS folder on the main area of your memory stick if you dont already have one. The patch is inside. &quot;DO NOT DELETE WHATS INSIDE OR IT WONT TRANSLATE THE GAME&quot; if you have a custom firmware (EXAMPLE: 6.39ME) you are set, but if you dont go here and get one http://psp.dashhacks.com/articles/custom-firmwares  the patch will only work with a custom firmware.\n\nPutting the firmware on your psp is simple. go into your memory stick and open the folder called PSP inside will be a folders called GAME SAVEDATA and SYSTEM both files go into the GAME folder the files will say &quot;installer&quot; and &quot;launcher&quot; after you have it saved into the GAME folder disconnect the psp from your computer. go to your psp and scroll over to your memory stick and click the installer. Once finished you can delete the installer. next click the launcher and hold R until a screen with options appear there should be an option called plugins. click plugins and 2 options will appear &quot;nploader.prx [GAME] and divapatch.prx [GAME]&quot; they will be disabled. click them to enable them. Once activated you wont need to activate it again. \n\nNow exit the program to start your game and enjoy.\n\nIf you have any problems or need help just comment :3","torrent":{"xt":"urn:btih:1d7bbbea5b59b6595b9548fc237078e403410677","amp;dn":"Project+Diva+2+Extend","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1d7bbbea5b59b6595b9548fc237078e403410677","infoHashBuffer":{"type":"Buffer","data":[29,123,187,234,91,89,182,89,91,149,72,252,35,112,120,228,3,65,6,119]},"announce":[],"urlList":[]}}