{"title":"MINECRAFT 1.2.5 | MULTILANGUAGE | AUTOUPDATE | ONLINE","uid":7337456,"size":50062527,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:1eb540d5ccaf8797096056236877cfa20e82c4a8&amp;dn=MINECRAFT+1.2.5+%7C+MULTILANGUAGE+%7C+AUTOUPDATE+%7C+ONLINE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Codeman320","files":-1,"time":1339109753,"description":"About the game\n\nMinecraft is developed by Markus Persson. It's been under development since about May 10, 2009.\n\nI started Minecraft after playing some Infiniminer with a couple of people from TigSource. I realized that a game that simple yet that dynamic had a lot of potential to turn into a really great game, and kept coming up with things I wanted to change and stuff I wanted to add.\n\nI had recently quit my job as a game developer to be able to focus more on indie game dev during my free time, and I was looking for a new game to develop. I had a few ideas floating around, but most required really long development times.\n\nThese two factors led to Minecraft.\nDevelopment and philosophy\n\nWaterfall is dead, long live agile!\n\nI've got a few plans and visions, but my only true design decision is to keep it fun and accessible. There's no design doc, but there are two lists; one for bugs, and one for features I want to add but think I might forget.\n\nI make sure to play the game a lot, and I've built my share of towers, and flooded my share of caves. If something ever doesn't feel fun, I'll remove it. I believe that I can combine enough fun, accessibility and building blocks for this game to be a huge melting pot of emergent gameplay.\n\nI strongly believe that all good stories have a conflict, and that all good games tell a good story regardless of if it's pre-written or emergent. Free building mode is fine and dandy, but for many people it will ultimately become boring once you've got it figured out. It's like playing a first person shooter in god mode, or giving yourself infinite funds in a strategy game.. a lack of challenge kills the fun.\n\nFor survival mode, I'd rather make the game too difficult than too easy. That also means I'm going to have to include some way of winning the game (or some other climax) to prevent it becoming too exhausting.\n\nBut if it's no fun, I'll redesign.\nThe future\n\nI plan on developing Minecraft until it's a finished complete game, with a downloadable client (with fullscreen mode), custom key re mappings and possibly modding support.\n\nFor as long as people enjoy and purchase the game, I will develop extensions after the game is done.\n\nOnce sales start dying and a minimum time has passed, I will release the game source code as some kind of open source. I'm not very happy with the draconian nature of (L)GPL, nor do I believe the other licenses have much merit other than to boost the egos of the original authors, so I might just possibly release it all as public domain.\n","torrent":{"xt":"urn:btih:1eb540d5ccaf8797096056236877cfa20e82c4a8","amp;dn":"MINECRAFT+1.2.5+%7C+MULTILANGUAGE+%7C+AUTOUPDATE+%7C+ONLINE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1eb540d5ccaf8797096056236877cfa20e82c4a8","infoHashBuffer":{"type":"Buffer","data":[30,181,64,213,204,175,135,151,9,96,86,35,104,119,207,162,14,130,196,168]},"announce":[],"urlList":[]}}