{"title":"Sardari Begum [1996] Shyam Benegal Classic VCD","uid":7175084,"size":1236194742,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:1f62a8348b4bc6e6b00d59b0ac5dbb0ae10eba9d&amp;dn=Sardari+Begum+%5B1996%5D+Shyam+Benegal+Classic+VCD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"redpirate172","files":6,"time":1334085816,"description":"Shyam Benegal made a trilogy on Indian Muslim women, starting with Mammo (1995), Sardari Begum (1996), and Zubeidaa (2001), which was written by filmmaker and critic Khalid Mohammed.\n\nSardari Begum is a 1996 Hindi movie which focuses the complex portrait of family relationships, generational and sexual politics as well as social mores in India.\n\nPlot:\nThe police are called to investigate the death of a woman during a riot in the walled city of Delhi. She was killed by a stone thrown by an agitated mob. The woman killed is known in the community as &quot;Sardari Begum&quot; (Kiron Kher), a popular singer and courtesan. The religious nature of the incident and the impending elections combine to attract the media's attention. When a young reporter covering the funeral, Tehzeeb Abbasi (Rajina Raj Bisaria), discovers her father among the mourners, her curiosity prompts her to investigate further. Then comes the revelation that the singer was in fact her aunt, who was disowned by her family for rebelliously learning music from a concubine.\n\nAwards:\nFilm's lead actress Kiron Kher won the 1997 National Film Award - Special Jury Award. Rajeshwari Sachdev, won the 1997 National Film Award for Best Supporting Actress. Film's music by Vanraj Bhatia also received wide acclaim, Arati Ankalikar-Tikekar, the play back singer of the film also received accolades in the category of 'Best Playback Singer'.\n\nDirector: Shyam Benegal\nCountry: India \nLanguage: Hindi \nSubtitle: None\nResolution: 352x288\nSource: Big Home Video Retail VCD\n\nPS: The torrent will be slow due to limited bandwidth. The screenshots are in the file. The seeding is subject to light and internet availability. Please seed after downloading so others can also enjoy!\n\nDedicated to SaM, Malikjee, Sujaidr, YIFY, WAF, neon, kickass, Fxg, SecretMyth (Kingdom-Release), aXXo, and many more uploaders!!!!\n\n\n","torrent":{"xt":"urn:btih:1f62a8348b4bc6e6b00d59b0ac5dbb0ae10eba9d","amp;dn":"Sardari+Begum+%5B1996%5D+Shyam+Benegal+Classic+VCD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1f62a8348b4bc6e6b00d59b0ac5dbb0ae10eba9d","infoHashBuffer":{"type":"Buffer","data":[31,98,168,52,139,75,198,230,176,13,89,176,172,93,187,10,225,14,186,157]},"announce":[],"urlList":[]}}