{"title":"20120322-Stossel-[Illegal Jobs].Fox Business.CF.avi","uid":7129291,"size":335469958,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:2027e37ad4c7b1534b9e29f41a8cf722379c99e1&amp;dn=20120322-Stossel-%5BIllegal+Jobs%5D.Fox+Business.CF.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"skJGZV6z","files":-1,"time":1332635180,"description":"----------\n\nSTOSSEL - [Illegal Jobs] - Fox Business Network\n2012, March 22, Thursday (captured 03240500z)\n\nXvid/MP3 AVI - encoded from medium quality ReplayTV stream\n\n----------\n\n[excerpted from John Stossel's blog:]\n\nWhen I tried to open a lemonade stand outside my Fox office, I learned about the piles of regulations that make it so tough for new businesses to get off the ground. But it's not just burdensome paperwork. Some entrepreneurs are charged with crimes, simply for trying to be entrepreneurs.\n\nTonight, we'll be joined by small business owners who get squeezed.\n\nShelly Goodman wanted to start a bed and breakfast at her big home on ten acres in Arizona. Greg Garrett tried to farm oysters on his property in Virginia. Both were stopped by the bureaucrats' endless rules.\n\nMedical Marijuana is legal in 17 states. Lynnette Shaw sold it in California for 15 years. She had support from the town's mayor and planning commission. But the feds demanded that she shut down.\n\nThe smell of cigars disgusts me, and I'd support some rules against cigar smoke in public places, but Rocky Patel, owner of one of the largest cigar businesses, will explain how the government goes way beyond that.\n\nClimatologist Roy Spencer will tell us how the EPA's constant push for new laws chokes-off commerce without improving the environment.\n\nThe bill for regulation has increased sharply under the Obama administration, says a new Heritage Foundation study that Alison Fraser will explain.\n\nMichael Holthouse got rich by creating the computer company Paranet and selling it to Sprint. He sees the need for small business, so he now runs Lemonade Day, an event that shows thousands of kids how to run their own business.","torrent":{"xt":"urn:btih:2027e37ad4c7b1534b9e29f41a8cf722379c99e1","amp;dn":"20120322-Stossel-%5BIllegal+Jobs%5D.Fox+Business.CF.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2027e37ad4c7b1534b9e29f41a8cf722379c99e1","infoHashBuffer":{"type":"Buffer","data":[32,39,227,122,212,199,177,83,75,158,41,244,26,140,247,34,55,156,153,225]},"announce":[],"urlList":[]}}