{"title":"Starcraft","uid":7115920,"size":1275431465,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:20943362f97f79ec8d1467bda98099cc8ee3461c&amp;dn=Starcraft+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"VaderLoks","files":1,"time":1332215762,"description":"Starcraft Info - \nStarCraft is the successor to Blizzard's highly successful Warcraft games. While the basic game mechanics remain the same, StarCraft moves the action to space. Instead of two very similar races, StarCraft brings you three very diverse but well-balanced sides to play. Does StarCraft live up to its worthy predecessors?\n\nIn StarCraft, you play as one of three races, the Terrans, Protoss, and Zerg, in a battle for galactic supremacy.  Games are played over different maps and can have varying victory conditions, although the elimination of the other players is the most common.  Those who are familiar with Warcraft will not have too much trouble transitioning to StarCraft.  The interface is very similar and the game basics - gather resources in order to build structures that create your armies - are still the same.  For those who haven't played Warcraft, you will find that the game interface is quite well-done.  It is easy to learn and makes it easy to command your units.  You can either play the campaign game, which is a series of linked scenarios, or set-up a custom game.\n\nBlizzard provides free play over its Battle.net game network.  Logging on and joining a game is a snap, as long as you have a connection to the internet.  You can play as any side on a variety of maps against one or more other players.  The variety of games and the ever-changing competition will keep your interest in the game going for quite some time.\n\nThe campaign game is quite well-designed.  The scenarios introduce you to each of the three races, providing access to more and more units as you progress through the game.  This is an excellent way to teach the player about the strengths and weaknesses of each race.  The challenge also increases as the player progress through the campaign, providing good challenge in the latter stages.  I recommend that new players play through the campaign before venturing into the online arena - it will prepare them for the challenges of facing human opponents quite nicely.\n\nStarCraft is one of those rare games that is not overly complex, but provides a challenging and fun gaming experience.  It never seems to get old or boring, and the free online service provides an always changing game experience.\n\nIn The End, This Game Hath Been Rated: 96%. This game is one of the best in the genre and should be a part of all strategy gamer's libraries. You'll find yourself coming back to StarCraft again and again.\n\nSystem Requirements:  Pentium 90; 16 MB RAM; SVGA Video Card; 2x CD-ROM; 100 MB Hard Drive Space; Mouse; 14.4 Kbps Modem or TCP/IP Internet Connection for internet multiplayer games.","torrent":{"xt":"urn:btih:20943362f97f79ec8d1467bda98099cc8ee3461c","amp;dn":"Starcraft+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"20943362f97f79ec8d1467bda98099cc8ee3461c","infoHashBuffer":{"type":"Buffer","data":[32,148,51,98,249,127,121,236,141,20,103,189,169,128,153,204,142,227,70,28]},"announce":[],"urlList":[]}}