{"title":"A Valley Without Wind (Steam)","uid":7321370,"size":396594374,"categoryP":"games","categoryS":"mac","magnet":"?xt=urn:btih:21f2969417d13fbdcfcc9bcbd507360b627b3aa6&amp;dn=A+Valley+Without+Wind+%28Steam%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"WinterGale","files":2,"time":1338632013,"description":"About the Game\n\nA 2D sidescroller without a linear path. An action game with tactical combat and strategic planning. An adventure game that lets you free-roam a vast, procedurally-generated world. A Valley Without Wind defies genre stereotypes. Unlike other procedurally-generated games, you also get a logical progression in difficulty, plus helpful tips and checklists to guide your travels (should you need them).\n\nChoose for yourself how to prepare to face the vastly stronger Overlord. Complete a variety of missions to earn arcane rewards, or roam the wilds to uncover secret missions and stashes of magical loot. Customize your characters with unique combinations of enchants and spells that change how you move, jump, and fight. Or rescue people and bring them back to your settlement, recruiting them to help you in return.\n\nYou choose how to play, and the world adapts around you.\n\n-------------------------------------------------------------------------------------\n\nKey features:\n\n- Travel alone or with friends across an ever-expanding world of dangerous creatures, powerful magic, high technology, and mysteries.\n- You have choice. The world of Environ is procedurally generated, and lets you go anywhere you see -- including right into the overlord's keep at any time. (Good luck with that.)\n- Environ is endless. When you save one continent from an overlord, a larger and more complex continent appears.\n- The game adapts to how you play: as you demonstrate your proficiency, monsters upgrade accordingly. Killed 100 bats? Okay, time for... bats on fire!\n- Crazy amounts of character customization. Combine a multitude of spells, enchants, and equipment to create specialized character builds.\n- Play as a long line of brave adventurers. It's not a question of IF your character is going to die, but WHEN. Any character that dies is permanently lost, but you keep all your inventory, enchants, and general progress in the game.\n- Become a community leader. Rescue NPCs, have them join your settlement, and construct buildings for them -- they may return the favor and help you.\n- Be a clever problem-solver. Challenges have more than one solution, each with its own pros and cons. You get to figure things out rather than just jumping through a set of hoops.\n- Difficulty levels give exactly the challenge you want, from casual to hardcore on both platforming and combat independently.\n- New updates are arriving all the time packed with additional content, improvements, and more.\n\n-------------------------------------------------------------------------------------\n\nOS: OS X version Leopard 10.5.8, or later.\nProcessor: 1.6Ghz CPU (more is recommended for multiplayer servers)\nMemory: 2 GB RAM\nHard Disk Space: 2 GB RAM\nVideo Card: 800x600 or greater desktop screen resolution (1024x768 recommended) Graphics card must support 1024x1024 textures (most 32MB and up graphics cards do).","torrent":{"xt":"urn:btih:21f2969417d13fbdcfcc9bcbd507360b627b3aa6","amp;dn":"A+Valley+Without+Wind+%28Steam%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"21f2969417d13fbdcfcc9bcbd507360b627b3aa6","infoHashBuffer":{"type":"Buffer","data":[33,242,150,148,23,209,63,189,207,204,155,203,213,7,54,11,98,123,58,166]},"announce":[],"urlList":[]}}