{"title":"Countdown with Keith Olbermann: 2012-03-19 H.264 AAC MP4","uid":7118609,"size":123443891,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:22925217abf8e99faa458dc98886bc673f90b23e&amp;dn=Countdown+with+Keith+Olbermann%3A+2012-03-19+H.264+AAC+MP4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"theburningbush","files":-1,"time":1332289434,"description":"** See my comment at the bottom of this description **\n\nCountdown with Keith Olbermann from Current.TV - Monday, March 19, 2012\n\nGuests:\no  Eliot Spitzer: former Governor of New York\no  David Shuster: Countdown Correspondent\no  Ken Vogel: reporter for Politico\no  Sahil Kapur: congressional reporter, Talking Points Memo\no  Robert Kuttner: co-founder and co-editor of The American Prospect\no  Gloria Feldt: former president and CEO of Planned Parenthood\no  Ydanis Rodriguez: New York City Council Member\no  Ryan Devereaux: reporter for Democracy Now!\n\n\n&quot;Please watch Keith on Current if you can get the channel, harass your cable company if you cannot. Keep celebrating freedom of news.&quot;\n~olberfann @ demonoid\n\nReduced in size by handbrake.\n\nContainer: MP4\nVideo codec: H.264\nResolution: 512 x 384\nAudio: AAC 44.1KHz Stereo\n\n*** Discussion thread for this torrent series:\n*** https://forum.suprbay.org/showthread.php?tid=113586\n\n\n** COMMENT **\nThe formerly reliable live-streaming source which I captured, processed, and uploaded to TPB seems to have seen its last days. It was only because of this source that I was able to provide this program in a timely manner, so that it was &quot;news&quot; and not &quot;olds.&quot;\n\nOther live-stream sources for CWKO are sporadically available, but they don't have the same quality as the source I'd been using, and, in any case, the capture software I use is incapable of capturing these alternate streams.\n\nThere is a regular torrent of CWKO on demonoid, but it is typically posted 12-16 hours or more after the original broadcast. By the time I download, process, and upload from that source, it may be 24+ hours before it shows up here.\n\nIn the last couple weeks, a person identified as &quot;anonymous&quot; has been regularly uploading CWKO here. The quality, IMO, of those videos is less than what I have been posting, and they aren't posted as quickly as when I had a good, reliable live-stream source, and the files are larger than what I post. However, anonymous's posts are quick enough, IMO, to meet the threshold of being &quot;news.&quot; Therefore, until such time as either (1) a reliable, capture-able, live-stream source is available, or (2) someone posts a good-quality torrent elsewhere (like demonoid) in a time-frame that is not &quot;olds,&quot; this will be my last upload of CWKO torrents.","torrent":{"xt":"urn:btih:22925217abf8e99faa458dc98886bc673f90b23e","amp;dn":"Countdown+with+Keith+Olbermann%3A+2012-03-19+H.264+AAC+MP4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"22925217abf8e99faa458dc98886bc673f90b23e","infoHashBuffer":{"type":"Buffer","data":[34,146,82,23,171,248,233,159,170,69,141,201,136,134,188,103,63,144,178,62]},"announce":[],"urlList":[]}}