{"title":"STAR TREK TOS REMASTERED SEASON1 _episodes 01-04","uid":7238728,"size":2232824037,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:244647a25cc75650d6d9e44ac6ace68a61751566&amp;dn=STAR+TREK+TOS+REMASTERED+SEASON1+_episodes+01-04&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"reppirg","files":12,"time":1336075404,"description":"Created by Gene Roddenberry, the science fiction television series Star Trek (which eventually acquired the retronym Star Trek: The Original Series) starred William Shatner as Captain Kirk, Leonard Nimoy as Mr. Spock, and DeForest Kelley as Dr. Leonard &quot;Bones&quot; McCoy aboard the fictional Federation USS starship Enterprise. The series originally aired from September 1966 through June 1969 on NBC.\n\n\nTHIS IS A TEST RUN, TO EVALUATE IF YOU LIKE WHAT YOU SEE.\n\nPLEASE SEED AND COMMENT.\n\n\n\n01\t&quot;The Man Trap&quot;\tSeptember 8, 1966\n\t\nThe Enterprise visits planet M-113 for a routine medical inspection of the husband-wife archaeological team stationed there, but the crew finds that the wife has been replaced by a deadly, shape-shifting creature.\n\n02\t&quot;Charlie X&quot;\tSeptember 15, 1966\n\t\t\nWhile traveling aboard the Enterprise, a dangerous young man named Charlie Evans terrorizes the crew with his unusual mental powers.\n\n03\t&quot;Where No Man Has Gone Before&quot;\tSeptember 22, 1966\n\nAfter the Enterprise attempts to cross the Great Barrier at the edge of the galaxy, crew members Gary Mitchell and Elizabeth Dehner develop &quot;godlike&quot; psychic powers which threaten the safety of the crew.\n \n04\t&quot;The Naked Time&quot;  September 29, 1966\t\n\nA strange, intoxicating infection, which lowers the crew's emotional inhibitions, spreads throughout the Enterprise. A crew member's inebriated actions place the ship in danger, forcing Scotty to perform a hazardous and untested engineering procedure to save the ship from destruction.","torrent":{"xt":"urn:btih:244647a25cc75650d6d9e44ac6ace68a61751566","amp;dn":"STAR+TREK+TOS+REMASTERED+SEASON1+_episodes+01-04","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"244647a25cc75650d6d9e44ac6ace68a61751566","infoHashBuffer":{"type":"Buffer","data":[36,70,71,162,92,199,86,80,214,217,228,74,198,172,230,138,97,117,21,102]},"announce":[],"urlList":[]}}