{"title":"Kuroshitsuji - 4รยบ Episodio","uid":7163298,"size":105878570,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:25ce8b9584040ee0bb39049d9186ef244dc66710&amp;dn=Kuroshitsuji+-+4%26ordm%3B+Episodio&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"mateuslima","files":1,"time":1333689147,"description":"The news of Jack the Ripper terrorizes the city of London. After receiving information from Undertaker, Sebastian narrows the suspects down to a a man known as the Viscount of Druitt. Madame Red creates a plan for Sebastian, Ciel, and Lau to attend a ball to catch the culprit, which involves Ciel, in a dress and wig, posing as her young niece and Sebastian in the role of his tutor. They realize that Elizabeth is attending the ball and must avoid her, lest she blow their cover. The Viscount takes a liking to Ciel, who flirts with him hoping to learn his plans. Sebastian distracts Elizabeth and the other guests by pretending to be a magician. Alone in a room with the Viscount, Ciel loses consciousness, later awaking to find himself being sold in a large underground auction, bound and blindfolded. When the Viscount removes the blindfold in order to display Ciel's eyes, Ciel keeps them closed, then opens them and calls for Sebastian. The lights go out, cries are heard, and the candles are suddenly relighted to reveal Sebastian, who takes Ciel home as the police arrive at the scene. ","torrent":{"xt":"urn:btih:25ce8b9584040ee0bb39049d9186ef244dc66710","amp;dn":"Kuroshitsuji+-+4%26ordm%3B+Episodio","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"25ce8b9584040ee0bb39049d9186ef244dc66710","infoHashBuffer":{"type":"Buffer","data":[37,206,139,149,132,4,14,224,187,57,4,157,145,134,239,36,77,198,103,16]},"announce":[],"urlList":[]}}