{"title":"Up with Chris Hayes 5-6-12.mp4","uid":7248375,"size":179614384,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:26ab5ff9981cad1ccd0d9972a6147e03d60c6ddd&amp;dn=Up+with+Chris+Hayes+5-6-12.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"liberal42","files":1,"time":1336370453,"description":"On Sunday Up looked at the complicated relationship between the U.S. and China, with a focus on dissident Chen Guancheng, who escaped from house arrest and fled to the U.S. embassy in Bejing earlier this week. They also discussed the Dodd/Frank Act, which was signed into law two years ago and hailed as the most comprehensive financial reform bill since the Great Depression. Chris and his guests looked at how the bill is being undermined in its enforcement and the rule-making process. Plus, they talked about former EPA regional administrator Alfredo Juan Armendariz who was forced out of his job by Republicans for being too tough on law-breakers. Chris was be joined by these guests:\n\nEric Schneiderman, New York attorney general and co-chair of the Mortgage Crisis Unit and Financial Fraud Enforcement Task Force.\n\nRaj Date, deputy director of the Consumer Financial Protection Bureau.\n\nCatherine Rampell, economics reporter for the The New York Times.\n\nAlexis Goldstein, former Wall Street information technologist and member of Occupy the SEC.\n\nJames Fallows, national correspondent for The Atlantic and author of China Airborne.\n\nDavid Frum, former speechwriter for President George W. Bush and contributing editor for Newsweek/Daily Beast.\n\nAnn Lee, Senior Fellow at Demos, author of What the US Can Learn From China, Former investment banker.","torrent":{"xt":"urn:btih:26ab5ff9981cad1ccd0d9972a6147e03d60c6ddd","amp;dn":"Up+with+Chris+Hayes+5-6-12.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"26ab5ff9981cad1ccd0d9972a6147e03d60c6ddd","infoHashBuffer":{"type":"Buffer","data":[38,171,95,249,152,28,173,28,205,13,153,114,166,20,126,3,214,12,109,221]},"announce":[],"urlList":[]}}