{"title":"Kiraâ˜†Kira(eng) ipod.ipad.iphone","uid":7203334,"size":1021597307,"categoryP":"games","categoryS":"ios_(ipad_iphone)","magnet":"?xt=urn:btih:2740c75d4c9edb752fa25f795339a88cdaaa2b56&amp;dn=Kira%E2%98%86Kira%28eng%29+ipod.ipad.iphone&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"cad40","files":1,"time":1335014269,"description":"High potential game can be played on iPhone UI as well as high quality sound of music\ncan be done on it. \n\nThe opening movie are perfectly included. \nThe 10 music on volal voice included. \nThis fascinate you with portable feeling as if you carry PS2.\nThe features of the piece are as follows,\nHigh definition graphic (Beautiful graphic)\nThis game can be played on iPhone UI.\nLot of letters like novel.\nMore than 100 computer graphics.\nCall menu Double touch.\nThe function to skip parts which you have read and call up parts which you have read before. \nAutomatic moving text in line with your reading speed. \nThe pictures automatically turn along with the turn of iPhone-ware.\nWhen game is interrupted by an incoming phone call, you can resume the game with Home Key.\nText Lang.: English\nVoice Lang.: Japanese\n\nStory / Detail\nShikanosuke Meajima is a student at the Missionary school, Oubi Academy. He doesn't attend his club, he doesn't put much effort in his studies, all he does is show up at his part time job; in short, his life could be better. One day, he meets a strange girl, Kirari Shiino, at work and before he knows it, they've formed a punk band.\n\nThe band consists of Shikanosuke, Kirari, his childhood friend Chie Isurugi, and a rich but weak young lady by the name of Sarina Kashiwara. The four of them are members of the Second Literature Club, which has hardly any active members and is already scheduled to be disbanded. This band is their chance to stand out and give one final farewell at the Culture Festival.\n\nThe challenge was foolhardy, but after eccentric training they managed to succeed and rock out the peaceful Oubi Academy with their debut performance. That should have been it. \nThey were satisfied. \nThey should have returned to their normal lives. \nHowever, their final performance at a local Live House became a hit on the Internet and requests for their performance start flying in from far and wide. \n\nOne problem: exams are coming up and their parents are opposed to the band!\n\nWho cares!\n\nThe four of them embark on their final adventure, a long tour of Japan, armed with their dreams and their instruments, all aboard a rickety van that could fall apart at any moment.\n\n&quot;First stop, Nagoya!&quot;\n\n*If youre application d'ont wake up then serius tupping on wake up application to move game title.\n*Can do it movie skip for right flick in game playing.\nWhat's new in Version 1.5\nFixed Voice bugs and other bugs","torrent":{"xt":"urn:btih:2740c75d4c9edb752fa25f795339a88cdaaa2b56","amp;dn":"Kira%E2%98%86Kira%28eng%29+ipod.ipad.iphone","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2740c75d4c9edb752fa25f795339a88cdaaa2b56","infoHashBuffer":{"type":"Buffer","data":[39,64,199,93,76,158,219,117,47,162,95,121,83,57,168,140,218,170,43,86]},"announce":[],"urlList":[]}}