{"title":"Cyber Update Feb.2012-------HT-19577  Rain DeGrey","uid":7046412,"size":150613383,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:28153e31585e06e69d87a665aa8cd8ca39680988&amp;dn=Cyber+Update+Feb.2012-------HT-19577++Rain+DeGrey&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"merzedes","files":-1,"time":1329759186,"description":"From Kink.com  (Hogtied)  + Pics\n\n\nIt has been almost a year since Rain DeGrey has done a normal studio shoot with Hogtied. This tall sexy girl has, long legs and massive boobs. Did we mention she is pretty tough also?\n\n One of the hardest bondage positions the world. There is no name for it so we can call it anything we want. Lets call it the OMEGA tie. We have only met a few girls that can even do it.\n\n The OMEGA tie is a category 5 position to the max. The body does not like to bend this way. And if you are at home thinking you might want to try this or one of those wanta be riggers that see what other do and try to copy, don't! You will no doubt hurt someone. Leave this to the professionals.\n\n We are not going to describe how we tied her, just look. However what we did to her was fun. A brutal face fucking, a good deep throat pounding. Nothing is sexier then a helpless girl in a nasty bondage predicament, having a cock slammed down her throat, and there is nothing she can do but take it for as long as you want to give it.\n\n We then vibrate her to to near orgasm teasing her, not letting her cum, until we LIFT the Omega tie of the ground. Now this is something extra special, the strain on the body is intense. Only the vibrator, and series of catastrophic orgasms that rip her brain to shreds, keeps the pain at bay, long enough to stay in the suspension. Well done Rain, well done.\n\n\nScreens &lt;a href=&quot; http://www.hogtied.com/site/shoot.jsp?shootId=19577&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.hogtied.com/site/shoot.jsp?shootId=19577&lt;/a&gt;\n\n\nCheers  :-)","torrent":{"xt":"urn:btih:28153e31585e06e69d87a665aa8cd8ca39680988","amp;dn":"Cyber+Update+Feb.2012-------HT-19577++Rain+DeGrey","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"28153e31585e06e69d87a665aa8cd8ca39680988","infoHashBuffer":{"type":"Buffer","data":[40,21,62,49,88,94,6,230,157,135,166,101,170,140,216,202,57,104,9,136]},"announce":[],"urlList":[]}}