{"title":"HoT EQEmu","uid":7142839,"size":6937573812,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:28b8d6f2a2a524dd31c353b90543d50b2decffbe&amp;dn=HoT+EQEmu&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":1,"time":1333057264,"description":"EverQuest House of Thule is the seventeenth expansion of the groundbreaking EverQuest franchise, now in its unprecedented twelfth year. EverQuest House of Thule continues to add immersive gameplay, captivating storytelling and exciting worlds to the EverQuest legacy, set in a never-before-seen dreamland full of mystery and adventure. House of Thule offers an expansion rich in content and packed with game-changing features including a level cap increase and the addition of player housing, which new players, veterans and MMO fans will relish.\n\n\nHouse of Thule Storyline: Across Norrath prominent figures are falling into dream-induced comas. The clerics and mystics of the land are powerless to wake their leaders from their unnatural sleep, evidence that something is deeply wrong in the world of dreams. A strange home has appeared in the Feerrott jungle, its look sinister, its purpose, unknown. Upon entering the house, the air is thick with tension, caused by an ensuing conflict between the Thule deities: Cazic, Terris and Morell, the Lord of Dreams. Their turmoil has affected the world of Norrath, clashing reality with delusion, and around every twisting passageway, dreams and nightmares take on their physical forms. Unhinged by imagination, there's no way of knowing what beings lay in wait for intrepid explorers. Prevail over the overlords of the House of Thule. Unravel its secrets and prevent Norrath from being consumed by the power of its dreams.\n\nGo from 85 to 90 - Achieve a new max level of 90 and set a new standard of gameplay\nMore than 800 AAs - Elevate your power and abilities beyond the norm\nIn-game Housing Addition - Make your permanent mark on the world! Collect and display treasured items\nNew Housing Trophy System - Display your trophies and receive statistical benefits\nHundreds of New Housing Items - Decorate your house to your own style\nSystem Requirements\n\n \tMinimum Specifications:\tRecommended Specifications:\nOS:\tWin 7, Vista and XP\nProcessor:\tPentium II 400 equivalent or greater\tPentium 4 equivalent or greater\nRAM:\t256 MB\t1 GB\nHard Drive:\t500 MB Hard Drive Space; 8 GB Available Hard Drive Space (depending on how many expansions are installed)\t \nVideo Card:\tATI Radeon 7500/NVidia GeForce 1 equivalent or greater* (Note: All Direct 3D cards not supported. DirectX 9.0b or greater is required for all XP/Vista. System requirements subject to change as the game progresses and you may need to upgrade your current system (or obtain a new system) to play the game over its lifetime.)\tNVidia GeForce FX 5700/ATI Radeon 9500 equivalent or greater* (*Note: All Direct 3D cards not supported. DirectX 9.0b or greater is required for all XP/Vista. System requirements subject to change as the game progresses and you may need to upgrade your current system (or obtain a new system) to play the game over its lifetime.)\nAdditional Info:\tDirectX 9.0\n28K + Internet Connection (56.6K + Internet Connection Recommended)\nSupported Video Cards at Time of Release:\tUnknown","torrent":{"xt":"urn:btih:28b8d6f2a2a524dd31c353b90543d50b2decffbe","amp;dn":"HoT+EQEmu","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"28b8d6f2a2a524dd31c353b90543d50b2decffbe","infoHashBuffer":{"type":"Buffer","data":[40,184,214,242,162,165,36,221,49,195,83,185,5,67,213,11,45,236,255,190]},"announce":[],"urlList":[]}}