{"title":"Documentales sobre el calentamiento global","uid":7066369,"size":4810523736,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:2ccc76f1b8d92f7ce9e2c9ab0d350524eac4e7f5&amp;dn=Documentales+sobre+el+calentamiento+global&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"hglbrt","files":5,"time":1330527630,"description":"Documentales sobre el calentamiento global\n\nTÃƒÂ­tulo: Climate wars, (Primera parte: Comienza la batalla)\nDirecciÃƒÂ³n: Jonathan Renouf \nPaÃƒÂ­s: Gran BretaÃƒÂ±a - (BBC, 2008)\nDuraciÃƒÂ³n: 48 minutos\nTamaÃƒÂ±o del archivo: 681 MB\nIdioma: espaÃƒÂ±ol\n\nSinopsis: Comienza considerando las previsiones climatolÃƒÂ³gicas hechas hacia la dÃƒÂ©cada de los 70, cuando se pasa de la teorÃƒÂ­a del enfriamiento global a la del calentamiento global y seÃƒÂ±ala la funciÃƒÂ³n que tuvo en esto la mediciÃƒÂ³n precisa de los niveles de biÃƒÂ³xido de carbono. Se explica el vÃƒÂ­nculo entre el biÃƒÂ³xido de carbono y el calentamiento atmosfÃƒÂ©rico. Comenta las primeras reacciones de los polÃƒÂ­ticos ante el problema y el surgimiento del movimiento de los escÃƒÂ©pticos. \nReseÃƒÂ±a el debate en torno a tres de los argumentos centrales de los escÃƒÂ©pticos por aquel entonces: 1) si el clima cambia, lo hace lentamente; 2) el sistema climÃƒÂ¡tico es demasiado grande para ser afectado por los humanos; 3) no hay pruebas fehacientes de que la temperatura vaya en aumento debido a la actividad humana.\n\n\nTÃƒÂ­tulo: Climate wars, (Segunda parte: El contraataque)\nDirecciÃƒÂ³n: Nathan Williams\nPaÃƒÂ­s: Gran BretaÃƒÂ±a - (BBC, 2008)\nDuraciÃƒÂ³n: 48 minutos\nTamaÃƒÂ±o del archivo: 687 MB\nIdioma: espaÃƒÂ±ol\n\nSinopsis: Expone el debate, hacÃƒÂ­a fines del siglo veinte, entre los llamados escÃƒÂ©pticos (que no creÃƒÂ­an en el calentamiento global) y los investigadores que sostenÃƒÂ­an que sÃƒÂ­ habÃƒÂ­a un calentamiento global. Se mencionan los debates sobre el &quot;efecto de isla de calor urbana&quot;, las diferencias en las mediciones de la temperatura mediante satÃƒÂ©lites y termÃƒÂ³metros terrestres, las diferentes interpretaciones sobre el llamado &quot;periodo medieval templado&quot; y los debates motivados a partir de la informaciÃƒÂ³n recabada de diversas fuentes naturales sobre la temperatura del planeta hace miles de aÃƒÂ±os. TambiÃƒÂ©n se menciona el discusiÃƒÂ³n sobre la actividad solar como posible causa del calentamiento, en vez de que sea originado por la actividad humana. \nTermina comentando el por quÃƒÂ© de la intromisiÃƒÂ³n de las empresas y los polÃƒÂ­ticos en el debate para tratar de convencer al pÃƒÂºblico de que el calentamiento global no existe.\n\n\nTÃƒÂ­tulo: Climate wars, (Tercera parte: Nuevos retos)\nDirecciÃƒÂ³n: Gaby Hornsby\nPaÃƒÂ­s: Gran BretaÃƒÂ±a - (BBC, 2008)\nDuraciÃƒÂ³n: 49 minutos\nTamaÃƒÂ±o del archivo: 707 MB\nIdioma: espaÃƒÂ±ol\n\nSinopsis: El ÃƒÂºltimo episodio de la serie se centra en los retos de la predicciÃƒÂ³n climÃƒÂ¡tica, actividad cientÃƒÂ­fica a la que se tendrÃƒÂ­a que recurrir para hacernos una idea de lo que se puede esperar del calentamiento global. Se recorre brevemente el proceso desde los primeros experimentos hasta la creaciÃƒÂ³n y puesta a prueba de los modelos climÃƒÂ¡ticos computarizados. \nSe seÃƒÂ±ala la naturaleza estadÃƒÂ­stica de las predicciones computarizadas, (lo cual implica que no se pueden hacer predicciones locales precisas) y se comenta la necesidad de completar este trabajo con el trabajo de campo. En particular se menciona el estudio del desplazamiento de especies de insectos producidos por cambios climÃƒÂ¡ticos en el pasado y el desprendimiento de icebergs en Groenlandia. El trabajo de campo en diversos frentes ha puesto en evidencia que el clima (contra lo que se habÃƒÂ­a creÃƒÂ­do hasta entonces) puede cambiar abruptamente.\n\n\nTÃƒÂ­tulo: La era de la estupidez\nDirecciÃƒÂ³n: Franny Armstrong\nPaÃƒÂ­s: Reino Unido, 2009\nDuraciÃƒÂ³n: 88 minutos\nTamaÃƒÂ±o del archivo: 1.26 GB\nIdioma: inglÃƒÂ©s - subtÃƒÂ­tulos en espaÃƒÂ±ol\n\nSinopsis: El documental estÃƒÂ¡ estructurado a partir de las reflexiones de un personaje imaginario que, hacia el aÃƒÂ±o 2055 y luego de una catÃƒÂ¡strofe climÃƒÂ¡tica global, se pregunta cÃƒÂ³mo es que la humanidad llegÃƒÂ³ al desastre si contÃƒÂ³ con advertencias claras e inequÃƒÂ­vocas sobre lo que podÃƒÂ­a suceder. Al ir consultando informaciÃƒÂ³n pretÃƒÂ©rita en su computadora recorre muchas situaciones reales de carÃƒÂ¡cter militar, econÃƒÂ³mico, polÃƒÂ­tico y cultural que, en conjunto, habrÃƒÂ­an conducido desde las primeras advertencias de que el planeta experimentaba un calentamiento global, hasta una situaciÃƒÂ³n catastrÃƒÂ³fica para el clima y la civilizaciÃƒÂ³n entera. \n\n\nTÃƒÂ­tulo: Una verdad incÃƒÂ³moda\nDirecciÃƒÂ³n: Davis Guggenheim\nPaÃƒÂ­s: Estados Unidos, 2006\nDuraciÃƒÂ³n: 96 minutos \nTamaÃƒÂ±o del archivo: 1.3 GB\nIdioma: inglÃƒÂ©s - subtÃƒÂ­tulos en espaÃƒÂ±ol\n\nSinopsis: El documental transcurre alternando entre una exposiciÃƒÂ³n que sigue el patrÃƒÂ³n de las conferencias que ha dado Al Gore sobre el calentamiento global y la exposiciÃƒÂ³n de algunas reflexiones que derivan de su experiencia personal. Se explican algunos aspectos sobre el origen del calentamiento global y sus mecanismos bÃƒÂ¡sicos (con una intenciÃƒÂ³n didÃƒÂ¡ctica muy trabajada). En las reflexiones intercaladas se mencionan factores culturales, polÃƒÂ­ticos y sociales vinculados al tema del calentamiento global; se plantea el tema de la falta de visiÃƒÂ³n de polÃƒÂ­ticos y empresarios, asÃƒÂ­ como las dificultades para que la mayorÃƒÂ­a de la poblaciÃƒÂ³n tome conciencia de la naturaleza y la magnitud del problema. \n","torrent":{"xt":"urn:btih:2ccc76f1b8d92f7ce9e2c9ab0d350524eac4e7f5","amp;dn":"Documentales+sobre+el+calentamiento+global","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2ccc76f1b8d92f7ce9e2c9ab0d350524eac4e7f5","infoHashBuffer":{"type":"Buffer","data":[44,204,118,241,184,217,47,124,233,226,201,171,13,53,5,36,234,196,231,245]},"announce":[],"urlList":[]}}