{"title":"Boujou 5.0","uid":7128065,"size":51914343,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:2cd0b44623f353a1084e1d9203c3af7600f6504f&amp;dn=Boujou+5.0&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":4,"uploader":"ZIKADIMOV","files":1,"time":1332598253,"description":"Emmy Award-Winning Matchmoving software that enables you to add computer generated effects seamlessly into your film or video footage. \n\nBuilding on its industry leading automatic toolset boujou software, boujou 5 allows you to solve complex shots even faster and to step in and work directly with the data. boujou 5 has a unique way of solving which radically accelerates the way you work, you can now solve even more shots in less time. \n\nboujou 5 takes the headache out of matchmoving. Two clicks and the majority of your shots can be matchmoved automatically. No manual tracking required, saving you time and resources.\nNew Automatic Sequential Solver\n\nPrevious versions of boujou took the entire shot into account before delivering a solve. boujou 5 looks at a single frame at a time, enabling the user to intervene as needed and making the entire process significantly faster.\n\nFully Functional Graph Editor\n\nThe Graph Editor enables the user to manually tweak the camera data and, if necessary, resolve. boujou 5 also provides the ability to lock valid sections of solve data or sections known to be correct. Those sections can then be used to improve other areas. \n\n\nReference Frames\n\nThe Reference Frames feature enables users to import still images taken with any camera and use them to assist in a solve. \n\n\nNew Target Tracker \nThe Pattern Matching Tracker in boujou has been completely rewritten so it provides a faster workflow. Target Tracking now can specify a pattern on a single frame as well as tracking multiple patterns simultaneously. \n","torrent":{"xt":"urn:btih:2cd0b44623f353a1084e1d9203c3af7600f6504f","amp;dn":"Boujou+5.0","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2cd0b44623f353a1084e1d9203c3af7600f6504f","infoHashBuffer":{"type":"Buffer","data":[44,208,180,70,35,243,83,161,8,78,29,146,3,195,175,118,0,246,80,79]},"announce":[],"urlList":[]}}