{"title":"The.SD.x264.TV.Release.Standards.2012.REPACK-SDx264","uid":7046778,"size":30571,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:2d23436a3b11a78da682d7dfc1f9e82de008fb8b&amp;dn=The.SD.x264.TV.Release.Standards.2012.REPACK-SDx264&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"sceneline","files":5,"time":1329782780,"description":"- &lt;a href=&quot;\nhttp://www.Speed.Cd&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.Speed.Cd&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.Speed.Cd&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.Speed.Cd&lt;/a&gt;      fast  and The Hottest Private Tracker on the net\n\n(((--submit for invite!!--)))\n\nPlease Seed back to make the speed Faster!!!\n\nand don't forget to visit .......http://www.Speed.Cd  ......\n\n\n ............ NFO .............\n--\n-                                                                             -\n-                  The SD x264 TV Releasing Standards 2012                    -\nLTTTT-\n-++TT++\n-                              L[ INTRO ]-                              -\n-                                                                             -\n- x264 has become the most advanced video codec over the past few years.      -\n- Compared to XviD, it is able to provide higher quality and compression at   -\n- greater SD resolutions. It also allows better control and transparency over -\n- encoding settings. With CRF in the mix, we can also ensure that a diverse   -\n- array of material will get the most appropriate bitrate for them and not    -\n- arbitrary and fixed sizes. This standard aims to bring quality control back -\n- to SD releases. There are many standalone players/streamers such as TviX,   -\n-Hour, WDTV HD Media Player, Boxee, Xtreamer, PS3, XBOX 360, iPad, &amp; -\n- HDTVs that can playback H264 and AAC encapsulated in MP4.                   -\n-                                                                             -\n- The SD x264 TV section was formed to separate releases from the ruleless    -\n- world of TV-XviD. This document will cover the rules and guidelines for     -\n- only SD resolution x264 television rips.                                    -\n-                                                                             -\nLTTTT-\n-++TT++\n-                          L[ RELEASE RULES ]-                          -\n-                                                                             -\n-  Compliance with this document is optional as of its pre date, and          -\n-  mandatory as of 2012-02-22 16:00 UTC.                                      -\n-                                                                             -\n-  Video:                                                                     -\n-   - Sources requiring resize are to be cropped and resized using sharp      -\n-     resizers such as  Lanczos/Lanczos4, Spline36, or Blackman. Bicubic is   -\n-     banned.                                                                 -\n-   - HD video taken from the decoded HD output of a set-top box (e.g.        -\n-     component, DVI, HDMI) may be used as a source; source must be tagged    -\n-     in dirname as AHDTV. Decoded output of PDTV or DSR sources is banned.   -\n-     Releases taken from a natively recorded transport stream shall be tagged-\n-     as HDTV, PDTV, or DSR. Dupes are as follows: HDTV &gt; AHDTV &gt; PDTV &gt; DSR. -\n-     AHDTV captures must be done at the native format of the channel, e.g.   -\n-     720p or 1080i.                                                          -\n-   - Sources that sideconvert 1080i to 720p (such as BellTV) are allowed but -\n-     must be tagged as PDTV or DSR.                                          -\n-   - If there is a question as to the validity of a source, the release      -\n-     may be nuked source.sample.requested_&lt;reason.for.nuke&gt; (e.g.            -\n-     source.sample.requested_suspicion.of.analog.source) within 24 hours of  -\n-     pre. The group has 24 hours from the nuke to pre a RARed SOURCE.SAMPLE  -\n-     that is at least 10 seconds in length in order to document that the     -\n-     source is valid. Failure to provide source proof or providing bad       -\n-     source proof shall result in the release remaining nuked, and it may    -\n-     then be propered.                                                       -\n-   - Improper IVTC methods that result in jerky playback, such as Force      -\n-     Film, are banned                                                        -\n-   - Interlaced video sources must be deinterlaced with a smart deinterlacer -\n-     such as Yadif. FieldDeinterlace is banned.                              -\n-   - Group watermarks of any kind on the video are banned                    -\n-   - Intros, outros, betweenos, or any other form of defacement of the       -\n-     episode are banned                                                      -\n-   - &quot;Native&quot; refers to the standard in which the video was produced (e.g.   -\n-     NTSC or PAL). NTSC produced video is native to NTSC, PAL produced video -\n-     is native to PAL. PAL produced video that is broadcast in NTSC is       -\n-     converted. NTSC produced video that is broadcast in PAL is converted.   -\n-   - Converted video that has significant artifacting (e.g. blended frames)  -\n-     and cannot be reversed to native must use CONVERT tag                   -\n-   - Converted video that does not have significant artifacts does not need  -\n-     convert tags and may not be nuked for the conversion                    -\n-   - Native releases are allowed after those tagged CONVERT. Use NATIVE tag. -\n-                                                                             -\n-  Audio:                                                                     -\n-   - Allowed audio formats are VBR AAC LC (Low Complexity).                  -\n-   - Average bitrate on AAC audio must be 96 - 160 kbps.                     -\n-   - AAC audio must be normalized and downconverted to stereo.               -\n-   - Nero and Apple encoders are recommended. FFmpeg is banned.              -\n-   - Dupes  based  on audio format are forbidden and must be tagged INTERNAL -\n-   - Multiple language audio tracks are allowed and must be listed in NFO    -\n-   - Dupes are not allowed based on multiple audio tracks                    -\n-   - Severe audio drops resulting in one full missing word or otherwise the  -\n-     inability to  understand material dialogue is considered to be a        -\n-     technical flaw and may be propered                                      -\n-   - Audio that is 120ms or more out of sync or drifts more than 120ms       -\n-     between any two points (e.g. needing -80 at one and +40 at another) is  -\n-     considered to be technically flawed and may be propered                 -\n-                                                                             -\n-  Framerate:                                                                 -\n-   - IVTC or deinterlacing must be applied as needed                         -\n-   - 50/60fps video may be released at 50/60fps or 25/30fps. Releasing true  -\n-     25/30fps video at 50/60 is considered a technical flaw.                 -\n-   - In rare cases, 25/50Hz sources should be IVTC'd to 24 or 30 fps.        -\n-   - In rare cases, 30/60Hz sources should be IVTC'd to 25fps.               -\n-     Failure to apply IVTC when needed is a technical flaw.                  -\n-                                                                             -\n-  Codec/Container:                                                           -\n-   - Video codec must be x264 (8-bit depth).                                 -\n-   - Container must be MP4.                                                  -\n-   - You will have 30 days from latest  x264  rev date to update in order to -\n-     maintain all bug fixes and improvements in the x264 codec               -\n-   - Stripping or falsifying encode information in the file header is banned -\n-   - Custom  muxing  tools are permitted; however, output must be compatible -\n-     with standard demuxers.                                                 -\n-   - Custom Matrices are allowed                                             -\n-   - Encoded colorspace must be 4:2:0.                                       -\n-   - Deblocking  must  be  used;  values are at the discretion of the group. -\n-     (default is enabled, 0:0 settings)                                      -\n-   - No setting can go below what is specified by --preset slow.             -\n-   - Keyframe  interval  (--keyint) must be at least 200 and at most 300. It -\n-     is  recommended  to  be  10*framerate  (film=240,  PAL=250,  NTSC=300). -\n-   - Minkeyint must be 30 or less                                            -\n-   - Colormatrix must be set to source specification. If not specified by    -\n-     source, bt709 must be used for sources with resolution greater than or  -\n-     equal to 1280x720 (e.g. HDTV and some PDTV) and sources with lower      -\n-     resolutions must use bt601 (e.g. DSR and some PDTV).                    -\n-   - Constant Rate Factor (--crf) must be as follows:                        -\n-     -TT -\n-     - Compressibility -  CRF  - General Examples                          - -\n-     ++++ -\n-     - High            - 19-20 - Scripted, Talk Shows, Poker, Animation    - -\n-     - Medium          - 21-22 - Documentary, Reality, Variety             - -\n-     - Low             - 23-24 - Sports, Awards, Live Events, Competitive- - -\n-     -                 -       - Reality                                   - -\n-     L++- -\n-   - x264 parameters shall not vary within a release                         -\n-   - Zones (--zones) are forbidden.                                          -\n-   - Any deviation in CRF from given examples must be specifically justified -\n-     in the NFO. Use discretion when deviating CRF by matching the           -\n-     compressibility of the show to a corresponding CRF value. CRF values    -\n-     below 19 and above 24 are never permitted.                              -\n-   - As a general suggestion, average video bitrate in excess of 1500kb/s    -\n-     is a sign that a higher CRF value should be chosen, when possible       -\n-   - Allowed parameters for --tune (optional) are film/grain/animation       -\n-   - Level 3.1 must be respected.                                            -\n-   - Suggested command line:                                                 -\n-     x264.exe --crf ## --preset slow --level 3.1 --colormatrix bt709 -o      -\n-     out.h264 in.avs                                                         -\n-                                                                             -\n-  Resolution:                                                                -\n-   - WS HDTV and WS PDTV sources with greater than 720px horizontal res must -\n-     be cropped as needed and resized to 720px width and mod2 height to      -\n-     maintain proper AR.                                                     -\n-   - WS PDTV sources with horizontal source res of 720-704px must be cropped -\n-     as needed and only height must be resized to the proper anamorphic AR   -\n-     using mod2. Upscaling/downscaling is forbidden.                         -\n-   - All other sources, including FS HDTV, must be cropped as needed and     -\n-     resized to 640px width and mod2 height to maintain proper AR.           -\n-   - When cropping, remove everything that is not actual picture, including  -\n-     black or other colored borders, duplicate lines, and full-time tickers. -\n-     Removing or retaining fading edges is at capper's discretion and shall  -\n-     not be considered undercropped or overcropped.                          -\n-   - In the case of varying crops, crop to the most common frame size (e.g.  -\n-     pitch/primary view in sports).                                          -\n-   - Actual picture area may be over- or under-cropped by 1px maximum per    -\n-     side. More than 1px on any side is considered a technical flaw.         -\n-   - Encoded Video resolution must be within 2% of the original aspect ratio -\n-     To calculate AR error (%): (Original AR - Release AR)/Original AR * 100 -\n-     OAR = (SourceWidth-CropLeft-CropRight)/(SourceHeight-CropTop-CropBottom)-\n-     Release AR  = EncodedWidth / EncodedHeight                              -\n-                                                                             -\n-  Subs:                                                                      -\n-   - Optional, but encouraged                                                -\n-   - Text based format is preferred (e.g. SubRip, SubStation Alpha, etc).    -\n-   - Subtitles must be in &quot;Subs&quot; directory.                                  -\n-   - Burned subtitles will only be allowed when the source exhibits such     -\n-     subtitles in the picture itself                                         -\n-   - Subtitles cannot be used as a basis for a dupe                          -\n-   - Group marks in subtitles are banned                                     -\n-                                                                             -\n-  Packaging:                                                                 -\n-   - Releases must be packed in RAR file format.                             -\n-   - Rars may be in 15, 20, or multiples of 50 MB. 15 and 20 MB sizes must   -\n-     contain 1-101 files. Multiples of 50 MB must contain 10-101 files.      -\n-     1MB = 1,000,000 bytes.                                                  -\n-   - Multi-episode  releases  with no clear delineation such as credits must -\n-     not be split                                                            -\n-   - RAR compression must not be used                                        -\n-   - Recovery and MD5 record are optional                                    -\n-   - Encryption or password protection is forbidden                          -\n-   - Must have SFV and NFO                                                   -\n-   - RAR, SFV, and sample files must have unique, lowercase filenames with   -\n-     the group tag.                                                          -\n-   - Missing SFV or RAR(s) on all sites is considered a technical flaw.      -\n-     Corrupt RARs (errors on extraction) are considered technical flaws.     -\n-     SFVFix and RARFix are not permitted. Uploading a missing SFV or RAR to  -\n-     all presites after pre is not permitted. Release REPACK.                -\n-                                                                             -\n-  Credits/Previously On:                                                     -\n-   - Previously on footage is optional, but suggested to be included         -\n-   - Full end credits must be included if they contain show content or       -\n-     outtakes/bloopers. End credits are optional and suggested if they are   -\n-     clean, and purely optional in other cases.                              -\n-                                                                             -\n-  Samples:                                                                   -\n-   - REQUIRED!                                                               -\n-   - 50-70 seconds in length and  in  a  separate  folder  marked  as Sample -\n-   - Must be taken from the episode, not encoded separately                  -\n-   - Stream samples are recommended for any questionable issue with the      -\n-     source, e.g. no IVTC possible                                           -\n-                                                                             -\n-  Propers:                                                                   -\n-   - Propers are only permitted in the case of a technical flaw in the       -\n-     original release (e.g. Bad IVTC, Interlacing, missing footage, bad crop,-\n-     commercials, bad x264 settings used, bad source, etc.)                  -\n-   - Scrolling or other alert messages added by a station (e.g. weather,     -\n-     Amber alerts) must be at least 30 seconds in length in order to         -\n-     nuke/proper                                                             -\n-   - Drops with missing footage but no missing dialog must be at least 2     -\n-     seconds long in any one instance to be considered a technical flaw      -\n-   - Proper  reason  must  be clearly stated in nfo, including timecodes and -\n-     extent of the flaw when appropriate                                     -\n-   - Sample of propered release is encouraged                                -\n-   - Qualitative propers are not allowed                                     -\n-   - Flaws  (such  as  drops) present in any optional content are not a flaw -\n-     and shall not be nuked or propered.                                     -\n-   - Propers based upon the rules set forth here are allowed only on         -\n-     releases that come after this document goes into effect                 -\n-                                                                             -\n-  Internals:                                                                 -\n-   - Internals are allowed to be pred for any reason, including releases     -\n-     with technical flaws or those done with alternate codecs, containers,   -\n-     or settings for experimental purposes                                   -\n-   - Any severe technical flaws or deviations must be mentioned in the NFO   -\n-   - With the exception of the following rule, internal releases may only be -\n-     nuked for severe technical flaws or deviations that are not mentioned   -\n-     in the NFO                                                              -\n-   - Using  DIRFIX.iNTERNAL to avoid a dupe nuke is banned, and such         -\n-     dirfixes shall be nuked fix.for.nuke                                    -\n-                                                                             -\n-  Directory Naming:                                                          -\n-   - Show.Name.SXXEXX.Episode.Title.HDTV.x264-GROUP                          -\n-   - Show.Name.YYYY.MM.DD.Guest.Name.HDTV.x264-GROUP for daily or other      -\n-     dated shows                                                             -\n-   - Episode title and guest name are optional                               -\n-   - Show.Name.PartXX.HDTV.x264-GROUP for miniseries                         -\n-   - ALL others are FORBIDDEN. (e.g 0x00 000 EXX.EP.TITLE PART.VI)           -\n-     Sport:                                                                  -\n-     - League.YYYY.MM.DD.Event.EXTRA.TAGS.HDTV.x264-GROUP                    -\n-     - Competition.YYYY-MM.Event.EXTRA.TAGS.HDTV.x264-GROUP                  -\n-     Using just the year is only permitted if the event is once per year     -\n-     (e.g. a WWE PPV). In the case of leagues which have seasons that span   -\n-     multiple years, it is permissible to tag the release with just the years-\n-     of the season. Inclusion of MM and DD is mandatory for all constantly   -\n-     running shows (e.g. WWE).                                               -\n-     If there is no league, the sport needs to be used instead               -\n-     The following are some examples of correct directory names:             -\n-     - EPL.2010.01.01.Manchester.United.vs.Arsenal.HDTV.x264-GROUP           -\n-     - TNA.Impact.2010.03.02.HDTV.x264-GROUP                                 -\n-     - WWE.WrestleMania.2010.PPV.HDTV.x264-GROUP                             -\n-     - Tennis.US.Open.2011.Final.Player1.vs.Player2.HDTV.x264-GROUP          -\n-   - Different  shows  that have the same title in different countries (e.g. -\n-     The Marriage Ref) must have the ISO 3166-1 alpha 2 country code in the  -\n-     directory name, except for UK shows (e.g. The.Marriage.Ref.UK not       -\n-     The.Marriage.Ref.GB). ISO country code is not needed for the original   -\n-     show (e.g. The.Marriage.Ref.US is forbidden).                           -\n-   - Different shows with the same name in the same country produced in      -\n-     different years must have the year of the first season in the directory -\n-     name, e.g. Human.Target.2010 and Doctor.Who.2005. Year is not needed    -\n-     for the first show with a particular name.                              -\n-   - Channel name (e.g. National.Geographic, History.Channel) shall not be   -\n-     tagged on any normal series starting after this ruleset's effective     -\n-     date. Miniseries and single-episode docus may optionally be tagged with -\n-     the channel name.                                                       -\n-   - The use of audio format tags such as AAC, and AAC.x.x is FORBIDDEN      -\n-   - READ.NFO tag is allowed; however, discretion is recommended             -\n-   - PROPER.READ.NFO is NOT allowed. The NFO is REQUIRED to have a reason;   -\n-     therefore, the tag is redundant.                                        -\n-   - All repacks must include detailed reason as to why it's being repacked  -\n-     in the nfo                                                              -\n-   - Other  permitted  tags are: PROPER, REPACK, RERIP, REAL, UNCUT, DUBBED, -\n-     SUBBED, iNTERNAL, OAR, PPV, CONVERT, NATiVE                             -\n-   - Acceptable  characters  in  naming  a  directory  include (NO spaces or -\n-     double dots - single dots ONLY):                                        -\n-                                                                             -\n-       ABCDEFGHIJKLMNOPQRSTUVWXYZ                                            -\n-       abcdefghijklmnopqrstuvwxyz                                            -\n-       0123456789._-                                                         -\n-                                                                             -\n-  Nukes:                                                                     -\n-   Releases must be nuked for any of the following reasons:                  -\n-   - Any valid proper listed in the propers section                          -\n-   - Missing nfo, or missing Sample                                          -\n-   - Invalid directory naming format                                         -\n-   - Mislabeled  directory  that  could  prevent  finding  the  release in a -\n-     dupecheck,  including  incorrect season/episode/date or incorrect title -\n-   - Dupe                                                                    -\n-   - Releases may not be propered for bad tagging or missing nfo/sample      -\n-                                                                             -\n-   Fixes:                                                                    -\n-   - The  following  fixes are  allowed: NFOFix, SampleFix, DirFix, SyncFix, -\n-     ProofFix                                                                -\n-   - DirFix requires NFO and NFO must state which release is being fixed     -\n-   - The original release shall be unnuked when a valid fix is released      -\n-   - A proper may not be released for an issue that was fixed, unless the    -\n-     fix does not completely correct the issue                               -\n-                                                                             -\nLTTTT-\n-++++\n-             The SD x264 TV Releasing Standards 2012 (2012-02-22)            -\n-                                                                             -\nLTTTT-\n-++TT++\n-                        L[ GROUPS ]-                         -\n-                                                                             -\n-              TVx2642012 rules created by the following groups:              -\n-                            -\n-                   ASAP BAJSKORV C4TV D2V DiVERGE FTP KYR                    -\n-                       LMAO LOL MOMENTUM SYS TLA YesTV                       -\n-                                                                             -\nLTT-\n   LT\\   Thanks to the x264 developers for their assistance in     /T-\n    LT\\      determining assistance in determining the best       /T-\n     L\\                mix of encode settings.                  /-","torrent":{"xt":"urn:btih:2d23436a3b11a78da682d7dfc1f9e82de008fb8b","amp;dn":"The.SD.x264.TV.Release.Standards.2012.REPACK-SDx264","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2d23436a3b11a78da682d7dfc1f9e82de008fb8b","infoHashBuffer":{"type":"Buffer","data":[45,35,67,106,59,17,167,141,166,130,215,223,193,249,232,45,224,8,251,139]},"announce":[],"urlList":[]}}