{"title":"RailWorks 3 - DD40x","uid":7190571,"size":93994070,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:2dad8e2bff64c9f79a89a1bf07e8e629b739ba2a&amp;dn=RailWorks+3+-+DD40x&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"SH0CK90","files":-1,"time":1334603905,"description":"The DDA40X comes to Train Simulator 2012! And talk about arriving in style, with 6,600 horsepower and a length of 98 feet. The largest diesel locomotive we have created for TS2012, the EMD DDA40X says it loud and clear: if you are gonna have a locomotive, have a LOCOMOTIVE!'\n\nThe giant DD40X first ran in 1969, when Union Pacific was getting ready to retire its fleet of gas turbine locos and wanted to move its diesel technology forward. Given an X suffix for 'eXperimental, the DDA40X (re-designated DD40X by the Union Pacific Railroad) was introduced not only to haul heavy freight trains, but also to act as a test bed for new systems which would soon be found on other EMD locomotives. Externally, the most obvious new design was the full-width or Comfort cab which became commonplace across the EMD range. This giant loco also earned the nickname Centennial after it hauled the Gold Spike Ltd on May 10, 1969.\n\nAt 98 feet long and with 6,600 horsepower, the DDA40X has real rail presence, and the same is true in TS2012. Developed by Digital Train Model, the TS2012 DDA40X includes many realistic features such as cab lights, step lights, number board lights and folding mirrors. Three slight loco variations are modeled including the preserved 6936.\n\n\nIncludes\nDDA40X diesel locomotive in Union Pacific livery, with three build variants including preserved 6936 with green hood. The DD40X features in-cab lighting, step lights, strobe light, number board lights, folding front and rear mirrors and realistic instrument readouts.\n\n3 scenarios for Barstow-San Bernadino:\n\nCement Delivery\nBig Jacks Climb\nFreight to Victorville","torrent":{"xt":"urn:btih:2dad8e2bff64c9f79a89a1bf07e8e629b739ba2a","amp;dn":"RailWorks+3+-+DD40x","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2dad8e2bff64c9f79a89a1bf07e8e629b739ba2a","infoHashBuffer":{"type":"Buffer","data":[45,173,142,43,255,100,201,247,154,137,161,191,7,232,230,41,183,57,186,42]},"announce":[],"urlList":[]}}