{"title":"The Children Of Huang Shi DVD NL (dvd5)(Nl subs) RETAIL TBS B-SA","uid":7076685,"size":4681289223,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:2df101e39b9563290d4f1bfcd9ef6875579ba030&amp;dn=The+Children+Of+Huang+Shi+DVD+NL+%28dvd5%29%28Nl+subs%29+RETAIL+TBS+B-SA&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Sammynet","files":-1,"time":1330870244,"description":"The Children of Huang Shi (2008)\n\nNederlands\nNa de Japanse invasie van het Chinese Mantsjoerije in 1937,\nlopen de spanningen in heel China hoog op.\nDe jonge Britse journalist George Hogg (Jonathan Rhys Meyers) krijgt ongevraagd de leiding over een jongensweeshuis,\neen lastige taak vanwege zijn gebrekkige kennis van de Chinese taal en cultuur.\nGelukkig krijgt hij hulp van de stoere Australische verpleegster Lee Pearson (Radha Mitchell).\nAls de oorlog het weeshuis erg dicht begint te naderen,\norganiseert Hogg samen met Lee en guerrillastrijder Chen (Chow Yun-Fat) een enorme voettocht dwars door China\nom de zestig weesjongens in veiligheid te brengen. Ze trotseren de koude winter om dwars door de woestijn de veilige tempels van Shandan te bereiken.\n\nEnglish\nPeople thrown into an unexpected and desperate situation discover their capacity for love and responsibility.\nA young Englishman, George Hogg,\ncomes to lead sixty orphaned boys on a journey of over 500 perilous miles across\nthe snow-bound Liu Pan Shan mountains to safety on the edge of the Mongolian desert.\nAnd how, in doing so, he comes to understand the meaning of courage. During his journey,\nHogg learns to rely on the support of Chen, the leader of a Chinese communist partisan group who becomes his closest friend.\nHe soon finds himself falling in love with Lee,\na recklessly brave Australian nurse whom war has turned into an unsentimental healer on horseback.\nAlong the way Hogg befriends Madame Wang, an aristocratic survivor who has also been displaced by war,\nwho helps the young Englishman, his friends and their sixty war orphans make their way across mountain\nand desert regions to a place of safety near the western end of the Great Wall of China.\n\nSpotinformatie\n\nSource............: Retail\nFormaat...........: DVD5\nVideo.............: PAL\nAudio.............: English DD5.1\nGenre.............: Drama\nSubs..............: nederlands instelbaar\nMenu..............: Yes\njaar uitgave......: 2008\nCover &amp; label.....: Yes\nAudio.............: English spoken\nSpeelduur.........: 114 minuten","torrent":{"xt":"urn:btih:2df101e39b9563290d4f1bfcd9ef6875579ba030","amp;dn":"The+Children+Of+Huang+Shi+DVD+NL+%28dvd5%29%28Nl+subs%29+RETAIL+TBS+B-SA","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2df101e39b9563290d4f1bfcd9ef6875579ba030","infoHashBuffer":{"type":"Buffer","data":[45,241,1,227,155,149,99,41,13,79,27,252,217,239,104,117,87,155,160,48]},"announce":[],"urlList":[]}}