{"title":"20120213-Freedom Watch-[final].Fox Business.CF.avi","uid":7035016,"size":372786002,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:2f03b72646db3dcc3097ace8e34b955e7c69b91e&amp;dn=20120213-Freedom+Watch-%5Bfinal%5D.Fox+Business.CF.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"skJGZV6z","files":-1,"time":1329346647,"description":"----------\nJudge Andrew Napolitano's Freedom Watch\n\nFox Business Network\n2012, February 13, Monday\n\nXvid/MP3 AVI - Transcoded from a medium-quality ReplayTV stream.\n----------\n\n[uploader note:]\n\nRelated to the earlier note in the prior program, this program is the final regular episode of Freedom Watch.\n\nThe shows running the remainder of the week, until the program halts on Friday, are previously assembled special episodes (used when the host is out on vacation, assignment, etc.). It's unclear if these have been previously broadcast, or are unaired. If compelling, you might see a couple more listings. Otherwise, you can presume this to be the final listing for this show.\n\nNapolitano is appearing regularly on FBN's Varney &amp; Company morning show, so if time and inclination allow, I might try now and again to compile a sequence of his appearances for your enjoyment...we'll see if I'm up for that.\n\nI hope you've enjoyed these and been inspired to seek out more. The world's best resource for the economic underpinnings and justification of the sort of libertarianism Judge Napolitano so brilliantly eludes can be found at:\n &lt;a href=&quot;\nhttp://www.mises.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.mises.org&lt;/a&gt;\n\nThe material there ranges from podcasts, to short daily articles for a general audience, all the way to the most thorough scholarly material. If you want to know the arguments for liberty, and examine the refutations of the various forms of central state planning by technocrats, autocrats, or plain tyrants, this is the place for you.\n\n\n\nA final parting word: The most common theme of Freedom Watch over its run has been the character and systematic dilution of our system of fiat dollars, and the numerous side-effects this causes. The argument against systems which replace free-market forms of commodity money with state-controlled fiat money is foundational to libertarian or classical liberal thinking. Liberty cannot truly exist while the means by which we store the value of our work are corrupted to suit the objectives of the central state. Judge Napolitano repeatedly engaged us in this notion in his suspicion of and attacks upon the US Federal Reserve system.\n\nIn your wallet right now are likely a few paper notes which nearly everyone would accept as money. In the USA they read across the top, &quot;Federal Reserve Note&quot;; in Europe they carry the initials for the European central bank. What do these notes actually represent?\n\nTake a current banknote out of your wallet and study its wording very closely. Now, compare it to this example of an earlier form of paper money which existed before our present system of fiat money had yet totally destroyed it:\n &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/File:US_$1_1886_Silver_Certificate.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/File:US_$1_1886_Silver_Certificate.jpg&lt;/a&gt;\n\nStudy its wording. Note well the differences, one is a nonsensical assertion of a nebulous concept, gilded with images of majesty and state power in authoritative lettering. The other, while similarly gilt, is a clear contract of precise and specific terms. One is an obligation, the other a piffle. One is a firm handshake supervised by law, the other a wink-wink-nudge-nudge.\n\nWhat real difference does this make? As it turns out, all the difference in the world. And you can learn how and why it matters in Murray Rothbard's easy-to-understand classic, &quot;The Mystery of Banking&quot;, available freely, right here:\n &lt;a href=&quot;\nhttp://mises.org/document/614&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://mises.org/document/614&lt;/a&gt;\n\nEvery user of fiat money in any nation, owes it to himself to understand better the nature of the money they use. It is an insight which will unlock vary many new ideas in your mind, and cause you to adopt a new perspective on the world.\n\nThe removal of one liberty, diminishes all liberty.","torrent":{"xt":"urn:btih:2f03b72646db3dcc3097ace8e34b955e7c69b91e","amp;dn":"20120213-Freedom+Watch-%5Bfinal%5D.Fox+Business.CF.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2f03b72646db3dcc3097ace8e34b955e7c69b91e","infoHashBuffer":{"type":"Buffer","data":[47,3,183,38,70,219,61,204,48,151,172,232,227,75,149,94,124,105,185,30]},"announce":[],"urlList":[]}}