{"title":"Gold Of The Seven Saints [1961] - Western","uid":7256575,"size":1283547354,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:300408fe6f6cb3252fb7f22acb27b7b6267a234e&amp;dn=Gold+Of+The+Seven+Saints+%5B1961%5D+-+Western&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"alien99","files":-1,"time":1336600924,"description":"Black/White Western staring Clint Walker and a unlikely role for Roger Moore in a western.\n\n\nStoryline\n\nFur-trapper Shawn Garrett gets out of a horse-stealing charge in a small, frontier town by agreeing to buy the horse with a gold nugget. This nugget attracts the attention of a man named McCracken who, with his gang, secretly follows Garrett across the desert in the hope of finding the source of his gold. Garrett joins up with his partner, Jim Rainbolt, and together they manage to hold off McCracken's gang long enough to hide their gold before seeking refuge in the hacienda of a landowner named Gondora. Gondora soon finds out about the gold, however, and Rainbolt and Garrett now find themselves in a fight to save their gold and their lives as well.\n\nUser Review\n\nClint Walker probably does not jump to anyone's mind anymore when thinking about B-Western stars, but he is worth remembering. Although a mammoth of a man, his characters tend to be genial and soft-spoken - imagine an appealing combination of Paul Bunyan and Henry Fonda. Too bad he didn't make more Westerns than he did.\n\nIn &quot;Gold of the Seven Saints&quot;, Walker and his partner Roger Moore are on the run, trying to escape basically everyone else, because the partners are carrying a large amount of gold that everyone wants a piece of. Walker never loses his cool when things go wrong, as they often do here. In a beautiful, and perhaps deliberate, contrast to the potential explosive violence contained in his titanic frame, Walker reacts to the wrong turns fate throws at him with a laconic acceptance that is pleasingly understated. His innately kindly and gentle personality always shines through. A very likable hero indeed.\n","torrent":{"xt":"urn:btih:300408fe6f6cb3252fb7f22acb27b7b6267a234e","amp;dn":"Gold+Of+The+Seven+Saints+%5B1961%5D+-+Western","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"300408fe6f6cb3252fb7f22acb27b7b6267a234e","infoHashBuffer":{"type":"Buffer","data":[48,4,8,254,111,108,179,37,47,183,242,42,203,39,183,182,38,122,35,78]},"announce":[],"urlList":[]}}