{"title":"La guerra civil en Andalucia.6 de 6.No ha llegado la paz, ha lle","uid":7032124,"size":732565504,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:305f849250a11576a6c0327fbd3786c7a7b34704&amp;dn=La+guerra+civil+en+Andalucia.6+de+6.No+ha+llegado+la+paz%2C+ha+lle&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"thimba","files":1,"time":1329252370,"description":"CapÃƒÂ­tulo 6: No ha llegado la paz, ha llegado la victoria\n\n\nLa serie realiza, desde una perspectiva netamente andaluza, un recorrido cronolÃƒÂ³gico de la guerra, comenzando por el golpe militar y finalizando con las consecuencias inmediatas al fin de la lucha el 1 de abril de 1939. Gracias a un trabajo documental sin precedentes, la serie muestra imÃƒÂ¡genes inÃƒÂ©ditas de la contienda en AndalucÃƒÂ­a extraÃƒÂ­das, entre otros, de prestigiosos archivos televisivos del Reino Unido y los Estados Unidos de AmÃƒÂ©rica. La serie cumple, ademÃƒÂ¡s, el objetivo de recorrer el territorio andaluz al completo, recopilando acontecimientos acaecidos desde AlmerÃƒÂ­a hasta Huelva.\nComo hilo conductor de la historia, la serie cuenta con personajes ficticios que representan el prototipo de una familia anÃƒÂ³nima durante la guerra. La producciÃƒÂ³n establece un paralelismo entre la divisiÃƒÂ³n que se produce en sus vidas y la batalla fratricida que enfrentÃƒÂ³ a las dos EspaÃƒÂ±as existentes en aquella ÃƒÂ©poca. Con sus intervenciones, los miembros de esta familia andaluza dan entrada al desarrollo de cada uno de los 42 hitos histÃƒÂ³ricos que estructuran La Guerra Civil en AndalucÃƒÂ­a: desde el minuto uno del alzamiento, que incluye una breve introducciÃƒÂ³n de sus antecedentes; hasta sus ÃƒÂºltimas consecuencias, ya en los primeros momentos de la EspaÃƒÂ±a franquista.","torrent":{"xt":"urn:btih:305f849250a11576a6c0327fbd3786c7a7b34704","amp;dn":"La+guerra+civil+en+Andalucia.6+de+6.No+ha+llegado+la+paz%2C+ha+lle","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"305f849250a11576a6c0327fbd3786c7a7b34704","infoHashBuffer":{"type":"Buffer","data":[48,95,132,146,80,161,21,118,166,192,50,127,189,55,134,199,167,179,71,4]},"announce":[],"urlList":[]}}