{"title":"NEW.ZEALAND.TROPHY.WATERS.VOL3.FLYFISHING[DVDRIP.BY.JENNIFER]","uid":7258000,"size":4418744320,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:34f379af16499aa780e828a9b3e7e0de3a622ddf&amp;dn=NEW.ZEALAND.TROPHY.WATERS.VOL3.FLYFISHING%5BDVDRIP.BY.JENNIFER%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"flygirl9","files":10,"time":1336644418,"description":" &lt;a href=&quot;http://www.fishingvideo.co.nz/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.fishingvideo.co.nz/&lt;/a&gt;\n\n\nNew Zealand Trophy Waters Volume Three.\n\n\n\nVolume three is a compilation of five separate days fly-fishing on five totally different waters. Its mostly dedicated to nymph fishing with a running time of 120 minutes and like its predecessors is split into five sections.\n\nSection One --  is called -- &quot;Anglers With Attitude&quot; **  This production was filmed at the opening of the season on a spectacular small high country river with Robbie McPhee the angler. A valley rated by many to be the most scenic in the South Island. Some great footage of eye balling the trout taking and rejecting nymphs. \n\nSection Two -- is called -- &quot;Lined Up&quot; ** This segment is very different from any previous footage. Chris Jackson shows his fly-fishing skills on a rather large river, no big dry flies used on this occasion.  The trout are lined up very close to the surface and only centimetres from the rivers edge, where they are feeding on spent spinners. Keith shows how he attaches  the strike indicator..  \n\nSection Three -- called &quot;Deer Oh Dear&quot; **  A special day for us all, Keith and Robbie are the anglers. We share  our encounters with the wild deer and pigs during the one-hour cross country drive to reach our starting point for the days fishing. As we fish our way up this incredible valley, we capture on film several more encounters with these wonderful animals roaming the hills. The river is high from recent rain, about double its normal flow, thus making the fishing even more difficult.\n\nSection Four -- called &quot;Our Tribute To Ron Wood&quot; ** Several months previous Ron Wood &amp; Robbie planned a fishing trip outside their normal hunting grounds, an area that Ron enjoyed immensely, however Ron became to ill to travel but insisted Rob and Bruce go anyway. After fruitlessly searching up another river not to far away from the intended, they finally arrived at 1.30 pm. They were greeted by gale force wind, Bruce said he would have been happy to head back home, but they stayed and fished on with some spectacular results. \n\nSection Five -- called &quot;Lost Opportunities&quot; **  Keith &amp; Robbie are the anglers on this day of frustration when things don't always go to plan. Some huge trout are seen and missed during the day, but  all were not lost. This section is one of my favourite videos as it shows not all trout are catch able. Even though one presents his best fly at the end of his best cast for the day, the trout streaks away leaving us grasping the rod handle very tightly, our minds pondering what we did so wrong. The only comfort we have in these moments of self doubt are, knowing that all anglers will suffer the same fate at one time or another, that's what keeps us coming back time and time again.\n\n","torrent":{"xt":"urn:btih:34f379af16499aa780e828a9b3e7e0de3a622ddf","amp;dn":"NEW.ZEALAND.TROPHY.WATERS.VOL3.FLYFISHING%5BDVDRIP.BY.JENNIFER%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"34f379af16499aa780e828a9b3e7e0de3a622ddf","infoHashBuffer":{"type":"Buffer","data":[52,243,121,175,22,73,154,167,128,232,40,169,179,231,224,222,58,98,45,223]},"announce":[],"urlList":[]}}