{"title":"Touch season 1 e01x12","uid":7321125,"size":3816670929,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:353e6e25916c3775b919475932855c02e1a1cf60&amp;dn=Touch+season+1+e01x12&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":12,"time":1338624669,"description":"Touch (season 1 e01-12)\n\n\nWe are all interconnected. Our lives are invisibly tied to those whose destinies touch ours.\n\nBlending science, spirituality and emotion, the series will follow seemingly unrelated people all over the world whose lives affect each other in ways seen and unseen, known and unknown. At the story's center is MARTIN BOHM (Kiefer Sutherland), a widower and single father, haunted by an inability to connect to his emotionally challenged 11-year-old son, JAKE (David Mazouz). Caring, intelligent and thoughtful, Martin has tried everything to reach his son. But Jake never speaks, shows little emotion, and never allows himself to be touched by anyone, including Martin. Jake is obsessed with numbers - writing long strings of them in his ever-present notebooks - and with discarded cell phones.\n\nSocial worker CLEA HOPKINS (Gugu Mbatha-Raw) believes that Jake's needs are too serious for Martin to handle. She sees a man whose life has become dominated by a child he can no longer control. She believes that it's time for the state to intervene. So Jake is placed in foster care, despite Martin's desperate objections.\n\nBut everything changes after Martin meets ARTHUR TELLER (Danny Glover), a professor and an expert on children who possess special gifts when it comes to numbers. Martin learns that Jake possesses an extraordinary gift - the ability to perceive the seemingly hidden patterns that connect every life on the planet. While Martin wants nothing more than to communicate directly with his son, Jake connects to his father through numbers, not words. Martin realizes that it's his job to decipher these numbers and recognize their meaning. As he puts the pieces together, he will help people across the world connect as their lives intersect according to the patterns Jake has foreseen.\n\nMartin's quest to connect with his son will shape humanity's destiny.\n\nAdditonal Information: &lt;a href=&quot;\nhttp://www.tvrage.com/Touch&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.tvrage.com/Touch&lt;/a&gt; &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Touch_(TV_series)&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Touch_(TV_series)&lt;/a&gt;\n","torrent":{"xt":"urn:btih:353e6e25916c3775b919475932855c02e1a1cf60","amp;dn":"Touch+season+1+e01x12","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"353e6e25916c3775b919475932855c02e1a1cf60","infoHashBuffer":{"type":"Buffer","data":[53,62,110,37,145,108,55,117,185,25,71,89,50,133,92,2,225,161,207,96]},"announce":[],"urlList":[]}}