{"title":"backgrounds","uid":7158334,"size":578295496,"categoryP":"other","categoryS":"pictures","magnet":"?xt=urn:btih:3879b7b35b411a07f942c2388493a9c0b73f29e9&amp;dn=backgrounds&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"me2soundtrack","files":299,"time":1333524266,"description":"These are 300 high resolution, high quality astronomy, astrophysics, and space related wallpapers taken from the Astronomy Picture of the Day (APOD), Hubble Space Telescope, and other sites. As a professional astronomer, I selected what I believed were the finest, most beautiful, and most dramatic images, covering everything from the Sun, the Earth, the solar system, to the star forming and reflection nebulae, all the way to distant galaxies and galaxy clusters.\n\nOf the pictures, 290 are &gt; 1600x900 quality, and 250 are &gt; 1920x1080 quality. All but one are in JPG format.\n\nFor the most part, these are actual recorded light images; only one (the one tracing the orbits around the Milky Way's central black hole) is an artist's conception. Note that non-optical waveband images are by necessity false color, yet we astronomers are careful about making false color images (like those taken in the X-ray and infrared) as accurate a reflection of the system's energetics as possible.\n\nI have edited images to improve quality and suitability for usage as wallpapers as follows. I have removed almost all of the annoying text and border decorations that occur typically in such images, leaving 100% pure scientific image when possible. Whenever the images were large and oversampled (e.g., 4000x4000 images where the stars were blurry or noisy at 1:1 zoom), I have tried to perform noise-reducing image reduction to a saner resolution for higher quality at 1:1.\n\nUse these wallpapers with the &quot;Zoom&quot; function of your desktop. Trust me---if you are a space fan and do not have a similar collection of your own, you will enjoy these wallpapers.","torrent":{"xt":"urn:btih:3879b7b35b411a07f942c2388493a9c0b73f29e9","amp;dn":"backgrounds","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3879b7b35b411a07f942c2388493a9c0b73f29e9","infoHashBuffer":{"type":"Buffer","data":[56,121,183,179,91,65,26,7,249,66,194,56,132,147,169,192,183,63,41,233]},"announce":[],"urlList":[]}}