{"title":"Painkiller Redemption 2011 PC Full Rip [meghbaria]","uid":7169011,"size":2034101537,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:3a628f52ae7b2217967bb27cdf388cc988ed6bff&amp;dn=Painkiller+Redemption+2011+PC+Full+Rip+%5Bmeghbaria%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"mbtorrents","files":1,"time":1333892797,"description":"MEGHBARIA\n                                   PRESENTS\n                                                                       YOU\n___________________________________________________________________________________\n                      \n                  Painkiller Redemption 2011 [HD RELEASE]\n-----------------------------------------------------------------------------------\nDescription:\n\nPainkiller: Redemption is an add-on released in February 25, 2011, as a downloadable game. Similarly to Overdose, the new expansion pack was originally a mod, created by a small group of fans under the label &quot;Eggtooth'&quot;. Additional development by &quot;Homegrown&quot;. Official publisher of Painkiller: Redemption is DreamCatcher. It features new heavy metal soundtrack, better graphics, and 6 levels with nearly 6000 enemies to kill. Redemption continues the story of the series, featuring the return of Daniel Garner and Belial, both as playable characters. The development team has released free post-release support for the game, which includes extra content for multiplayer, co-op, or a new single-player chapter. Eggtooth Team didn't create any new content, so the new maps are the ones originally used in multiplayer, and all monsters are taken from previous Painkiller installments, including the final boss, who uses the model of King Alastor from Battle Out of Hell.\n\nThe game is narrated through animated text messages, and starts when Belial, the hero of Painkiller: Overdose, saves Daniel Garner from Eve, the current queen of Hell. Together, Daniel and Belial fight a big battle through her minions in the Purgatory, until they've found Bill Sherman, the protagonist of Painkiller: Resurrection. With Bill's help, they are able to strike at Eve and destroy her. The game ends with the surprising arrival of Samael, an angel of God who once tasked Daniel with destroying Hell's leaders. With Eve dead, Samael plans to use the dark essence left by her to become a new ruler of Hell. The game concludes with Belial and Daniel understanding that the battle is not yet over.\n___________________________________________________________________________________\n\nInstructions:\n\n- Extract using latest WinRarâ„¢ version.\n\n- Install using the installation file.\n\n- Install in your faviourate folder (Recommended: C:/Program Files)\n\n- Play and enjoy the game!\n___________________________________________________________________________________\n\nImportant Notes:\n\n- For best results, update your graphics card drivers and directXâ„¢ drivers before starting the game.\n\n- Please see to it that you might not get good download speed as i don't have very fast interent, sorry for that. Please don't post negative comments regarding this matter, download only if you love the game but might take you a day or two.\n___________________________________________________________________________________\n\n                                 Hope you enjoy the quality release by meghbaria\n___________________________________________________________________________________","torrent":{"xt":"urn:btih:3a628f52ae7b2217967bb27cdf388cc988ed6bff","amp;dn":"Painkiller+Redemption+2011+PC+Full+Rip+%5Bmeghbaria%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3a628f52ae7b2217967bb27cdf388cc988ed6bff","infoHashBuffer":{"type":"Buffer","data":[58,98,143,82,174,123,34,23,150,123,178,124,223,56,140,201,136,237,107,255]},"announce":[],"urlList":[]}}