{"title":"High School of the Dead Complete Collection disk 1","uid":7342762,"size":8130720422,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:3b16e3e12bbc63eabd4029476256697ddb77668a&amp;dn=High+School+of+the+Dead+Complete+Collection+disk+1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"mike80219","files":5,"time":1339302475,"description":"[img]http://ecx.images-amazon.com/images/I/813eVqzEkTL._AA1280_.jpg[/img]\n\n[img]http://ecx.images-amazon.com/images/I/81X%2BIBMhVTL._AA1280_.jpg[/img]\n\nActors: Junichi Suwabe, Leraldo Anzaldua, Marina Inoue, Jessica Boone \nDirectors: Tetsuro Araki \nFormat: Animated, Color, Subtitled, NTSC \nLanguage: English, Japanese \nSubtitles: English \n\nNumber of discs: 2 \nRated: Unrated \nStudio: Section 23 \nDVD Release Date: June 28, 2011 \nRun Time: 300 minutes \n\nThe broadcast series High School of the Dead (2010) opens on an ordinary day at Fujima Academy in Tokyo--until hordes of zombies begin attacking people. Anyone who's bitten by them is either devoured or turned into a zombie. Sophomore Takashi Komuro, four of his friends, and Ms. Shizuka, the overendowed school nurse, fight their way out of the school and struggle to survive in a world gone mad. Using swords, baseball bats, and an arsenal of high-tech weapons and vehicles, the teenagers beat, blast, and flatten their grisly foes. The cause of the zombie plague is just one of the many important plot points that's never explained, but director Tetsuro Araki isn't really interested in presenting a coherent story. He keeps the camera looking up the girls' skirts, down their blouses, or at blank walls that get splattered with blood. In one shot certain to go down in fan-service history, he follows a projectile over one girl's breasts and under another's skirt--in slow motion. Hormonal adolescent boys who enjoy the juxtaposition of jiggle shots and blood baths are the obvious audience for High School of the Dead; other viewers should approach it with caution. (Rated TV MA VSD: graphic violence, violence against women, grotesque imagery, cannibalism, nudity, sexual situations, profanity, tobacco use) --Charles Solomon \n(1. Spring of the Dead, 2. Escape from the Dead, 3. Democracy Under the Dead, 4. Running in the Dead, 5. Streets of the Dead, 6. In the Dead of Night, 7. Dead Night &amp; Dead Rock, 8. The Dead Way Home, 9. The Sword and the Dead, 10. The Dead's House Rules, 11. Dead Storm Rising, 12. All Dead's Attack) \n\n\nIt began without warning. It continues without mercy. Now a band of high schoolers join forces with guns, swords, baseball bats and anything else they can get their hands on to battle a bloodthirsty, flesh-hungry zombie apocalypse. Slashing action, stunning animation, and jawdropping excitement make High School Of The Dead the most hotly anticipated adventures of the year. For horror fans and animation addicts alike, nothing offers the high-energy adrenaline of High School Of The Dead! ","torrent":{"xt":"urn:btih:3b16e3e12bbc63eabd4029476256697ddb77668a","amp;dn":"High+School+of+the+Dead+Complete+Collection+disk+1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3b16e3e12bbc63eabd4029476256697ddb77668a","infoHashBuffer":{"type":"Buffer","data":[59,22,227,225,43,188,99,234,189,64,41,71,98,86,105,125,219,119,102,138]},"announce":[],"urlList":[]}}