{"title":"Devon Ke Dev Mahadev Life Ok 2011 Season 1 full","uid":7328479,"size":24395278985,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:3ca555fdc96fd43147fd6abf008a3c38949c2dc4&amp;dn=Devon+Ke+Dev+Mahadev+Life+Ok+2011+Season+1+full&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"greatmuks","files":131,"time":1338835127,"description":"This is the story of Lord Shiva and Goddess Shakti. It is an elaborated narration of Shiv and Shakti's separation and union, their journeys together, and how that affected and shaped the world. The story presently narrates how Goddess Shakti's human incarnation Sati, grand daughter of Lord Brahma and daughter of Prajapati Daksha (a staunch devotee of Lord Vishnu) and Queen Prasuti is reunited with Shiva after Shakti was separated from him for the benefit of the universe. The show is presumed to follow with Sati's reincarnation as Goddess Parvati, daughter of mountain-king Himalaya and Queen Maina and younger sibling of Prince Mainak and Goddess Ganga. The show will then portray her union with her chosen lord Mahadev and how they came together never to be separated again. One of the most enchanting and intriguing tales of love, this story is credited as the first love story of the universe.\n\n\nSource :\n\nThe first 99 episodes are in 720, the rest are in 360p - this is the best that is available at the moment. \n\nAudio - Hindi\nSubs - None\n\nEnjoy the series and seed as much as you can!  \n\n\nPlease expect some downtime due to unexpected powercuts","torrent":{"xt":"urn:btih:3ca555fdc96fd43147fd6abf008a3c38949c2dc4","amp;dn":"Devon+Ke+Dev+Mahadev+Life+Ok+2011+Season+1+full","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3ca555fdc96fd43147fd6abf008a3c38949c2dc4","infoHashBuffer":{"type":"Buffer","data":[60,165,85,253,201,111,212,49,71,253,106,191,0,138,60,56,148,156,45,196]},"announce":[],"urlList":[]}}