{"title":"Good Arrows","uid":7132963,"size":732232230,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:3db46b35e1814da6303c4491dd1fd83660773db2&amp;dn=Good+Arrows&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"DocJenkem","files":1,"time":1332768801,"description":"A two hour long mockumentary comedy directed and co-written by Trainspotting writer Irvine Welsh.\n\nGood Arrows follows former darts champion Andy 'The Arrows' Samson - a man who used to be something big in the darts world. From working men's clubs to Las Vegas, he had played them all. Now, as the subject of a fly-on-the-wall documentary, he and his wife - Big Sheila - are unintentionally revealing a wardrobe full of skeletons to the interviewer, Sebastian.\n\nThe documentary crew follow Andy's relationship with his ex-best friend and mentor Alwyn, now to be found helping get a local junkie off heroin - albeit by supplying him with a slightly more unique drug to take its place. Big Sheila attempts to keep the money coming in and Andy away from the unwanted, and largely imagined, public spotlight, utilising the help of their driver/minder Ruffy - perhaps slightly more than Andy might like.\n\nWhen Andy suffers a heart attack and loses his throwing stills he is faced with some stark home truths. Alwyn thinks he has the solution to Andy's dilemma. Big Sheila, however, is piling on the hurt, and it's going to take a miracle to get Andy back at the oche.","torrent":{"xt":"urn:btih:3db46b35e1814da6303c4491dd1fd83660773db2","amp;dn":"Good+Arrows","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3db46b35e1814da6303c4491dd1fd83660773db2","infoHashBuffer":{"type":"Buffer","data":[61,180,107,53,225,129,77,166,48,60,68,145,221,31,216,54,96,119,61,178]},"announce":[],"urlList":[]}}