{"title":"Star Wars - The Puggo Grande Edition | 16mm Telecine Conversion","uid":7120330,"size":4647833600,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:3ddb7b3c5a01a29848a27c1d71ec759eea04df1b&amp;dn=Star+Wars+-+The+Puggo+Grande+Edition+%7C+16mm+Telecine+Conversion&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"OnlyOneKenobi","files":-1,"time":1332347573,"description":"***STAR WARS - THE PUGGO GRANDE EDITION***\n\nDVD of the conversion by Puggo from two 16mm original prints of the film.\n\nFull details of the restoration project can be read on Puggo's website here -\n &lt;a href=&quot;\nhttp://www.hardbat.com/puggo/puggoGrande.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.hardbat.com/puggo/puggoGrande.html&lt;/a&gt;\n\nThis torrent is a DVD VOB folder containing everything you need to create Puggo's excellent DVD with a DVD authoring program.  Please note that this DVD is an archival project of Star Wars as released in 16mm over three decades ago - if you want a pristine digital copy of Star Wars, you should buy it on DVD.\n\nThe content is an invaluable archiving of one of the most important films in cinema history and is not intended as a substitute for buying the original film in any way - indeed, it is considered good practice to buy the film if you do not already own by the way it should you download this DVD (if you do not own a copy of Star Wars I congratulate you for getting an internet service in your cave in the Himalayas).\n\nThe DVD contains not only a widescreen conversion of the original Star Wars, but a short but very informative documentary by Puggo describing the restoration process and an amusing public health message from C3PO and R2D2. \n\nThose interested in the archiving of the original trilogy should visit these sites -\n &lt;a href=&quot;\nhttp://savestarwars.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://savestarwars.com/&lt;/a&gt;\n &lt;a href=&quot;\nhttp://originaltrilogy.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://originaltrilogy.com/&lt;/a&gt;\n\nI would ask that anyone downloading this DVD 'pay it forward' by signing the online e-petition at originaltrilogy.com asking George Lucas to allow the films to be released on Blu Ray in their original format, something there are currently no plans for.\n\nFinally a standing ovation to Puggo for his incredible effort in saving a part of our heritage in the digital domain FOREVER.  \n\n***THE FORCE WILL BE WITH YOU - ALWAYS***\n\n\nCopyright Disclaimer, Under Section 107 of the Copyright Act 1976, allowance is made for 'fair use' for purposes such as criticism, comment, news reporting, teaching, scholarship, and research. Fair use is a use permitted by copyright statute that might otherwise be infringing. Non-profit, educational or personal use tips the balance in favor of fair use. All films contained in this DVD are intended for the transformative purpose of discussion and commentary, not for any commercial gain on behalf of the uploader or compiler. The sole intent of this DVD is of an educational nature for the benefit of the enrichment of the public.\n\nFAIR USE NOTICE:copyrighted material as provided for in Title 17 U.S.C. section 107 of the US Copyright Law","torrent":{"xt":"urn:btih:3ddb7b3c5a01a29848a27c1d71ec759eea04df1b","amp;dn":"Star+Wars+-+The+Puggo+Grande+Edition+%7C+16mm+Telecine+Conversion","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3ddb7b3c5a01a29848a27c1d71ec759eea04df1b","infoHashBuffer":{"type":"Buffer","data":[61,219,123,60,90,1,162,152,72,162,124,29,113,236,117,158,234,4,223,27]},"announce":[],"urlList":[]}}