{"title":"Sve_o_dzennetu_raju_u epub_word_pdf_odt_formatu","uid":7115186,"size":4154489,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3de40472a4f779ba26842733a3985c0bfa501f60&amp;dn=Sve_o_dzennetu_raju_u+epub_word_pdf_odt_formatu&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"bjelost","files":-1,"time":1332195398,"description":"Knjiga &quot;Vodic ka Dzennetu&quot; od Ibn Kajjim El-Dzevzija je nesto najbolje sto sam procitao o dzennetu. Toplo je preporucujem svakom ko zeli saznati nesto vise o dzennetskim ljepotama i blagodatimas\n\nPS\n\nPosto se u knjizi u prvih 8 poglavlja vodi rasprava o polozaju dzenneta i sl., za one nestrpljive preporucujem da knjigu citaju od 9 glave gdje se pocinje govoriti konkretno o izgledu dzenneta.\n\n----------------\n\nPisac o knjizi:\n\nOnaj ko je bude citao uzivat ce u tome. Pozeljet ce da joj se cesto vraca, a njeno citanje nece mu donijeti dosadu. \n\tTo je knjiga koja sadrzi izuzetne koristi, cudesne i rijetke pojedinosti, do kojih je mudztehid dosao svojim istrazivanjem, ne oslanjajuci se samo na puko prenosenje informacija iz knjiga svojih prethodnika. Ona sadrzi, takoder, veliki broj merfu' -hadisa, mevkuf-predaja, tajne koje su skrivene u brojnim kur'anskim ajetima, zatim krasne duhovite primjedbe, te pojasnjenja za mnoge nejasnoce, Ona je i podstrek za temeljitije bavljenje disciplinom: Osnove spoznaje Bozijih imena i atributa (Usulun minel-esma ves-sifat). \n\tKada u nju pogleda, citatelj ce osjetiti kako mu se iman uvecava, kako mu predstava o Dzennetu postaje jasnija, kao da se Dzennet pred ocima njegovim ukazuje. \n\tOna pokrece uspavanu volju, koja ce covjeka odvesti u dzenetske basce. Ona budi najuzvisenije ljudske teznje, zelju da svoj pravi zivot provedu u dzenetskim odajama. \n\tKnjigu sam nazvao Vodic ka Dzennetu. To je naslov koji najbolje odrazava njen sadrzaj. \n\n----------------\n\nbjelost je obradio knjigu u:\n\nWordu (Microsoft  format)\nodt (oppen office format)\npdf (adobe reader format)\nepub (format za citanje na mobilu, ipadu, nekom bookreader-u i slicno)\n\nselam alejkum\nbjelost 2012\n\n ","torrent":{"xt":"urn:btih:3de40472a4f779ba26842733a3985c0bfa501f60","amp;dn":"Sve_o_dzennetu_raju_u+epub_word_pdf_odt_formatu","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3de40472a4f779ba26842733a3985c0bfa501f60","infoHashBuffer":{"type":"Buffer","data":[61,228,4,114,164,247,121,186,38,132,39,51,163,152,92,11,250,80,31,96]},"announce":[],"urlList":[]}}