{"title":"Project Intuitive Select (2011 v1-05)","uid":7156938,"size":2755584,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:3f2e2757a609c1b1a5f98e21381c7b4cd042ab99&amp;dn=Project+Intuitive+Select+%282011+v1-05%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"FreeMind2000","files":-1,"time":1333478931,"description":"The aim of the project - to help you make important decision of the correctness of which you doubt, using the hidden resources of your subconscious mind and natural intuition.\n\n\nThis program acts as a kind of psychic. It communicates with you and gets do not verbal, subconscious (not perceived by you) information. It tries (using developed by the author self-learning and adaptive algorithms) to understand the logic (regularities) of your subconscious and intuition. Of course, the program will not be able to understand all the subtleties of your thought processes, but the general direction of the thoughts catch it quite on forces. After the program installs a stable contact with you, that is, ratio exceeds 70% of the understanding, you can ask program (and in fact, your subconscious and intuition) your questions. \n\n  \n\nUsing the program consists of several stages. \n\n1. At the first stage, the program is in the mode analysis of intuitions. That is, it tries to establish contact with your subconscious. The program asks questions and receives from you some information, analyzing which tries to adapt to your way of thinking. At this stage it is important to respond correctly to the questions you asked and not be distracted. Optimal variant would be if you are able to gain enough coefficient of understanding (preferably more than 70%) in the interval between 20-50 questions, if not, it is best to relax and try to work with the program later. \n\n2. In the second stage - YOU ask the questions. It is very important to understand, that you ask questions not to the program, actually you ask questions to yourselves. The program, arranged under your subconscious, just helps your intuition to draw attention to the correct solution.","torrent":{"xt":"urn:btih:3f2e2757a609c1b1a5f98e21381c7b4cd042ab99","amp;dn":"Project+Intuitive+Select+%282011+v1-05%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3f2e2757a609c1b1a5f98e21381c7b4cd042ab99","infoHashBuffer":{"type":"Buffer","data":[63,46,39,87,166,9,193,177,165,249,142,33,56,28,123,76,208,66,171,153]},"announce":[],"urlList":[]}}