{"title":"Coast to Coast AM 2012.04.04 Remote Viewing Experiments","uid":7204841,"size":145976404,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:4111fffa462276fb76f6f18b95ec629f280d85ff&amp;dn=Coast+to+Coast+AM+2012.04.04+Remote+Viewing+Experiments&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"ViViDSOL","files":5,"time":1335058595,"description":"Coast to Coast AM 2012.03.04 Depression &amp; Men, Biblical Omens\n\nHost: \tGeorge Noory\nGuests: John Gray, Jonathan Cahn\n\nIn the first half, Dr. John Gray discussed the dangers of treating depression with pharmaceuticals, as well as his work dealing with the future of boys, in a society increasingly hostile to male energy. The natural mineral Lithium Orotate is helpful in treating depression and anxiety, he commented, and can be taken while a person slowly tapers off from prescription anti-depressants they may have become dependent on. Omega 3 (fish oil) and whey protein are also useful supplements to take when combating depression, he added. Interestingly, he's found that coffee is beneficial, particularly for men, in balancing blood sugar.\n\nMales are more likely than females to commit suicide by a large margin, and this reflects that &quot;the world is basically not supporting what we might call masculinity,&quot; said Gray. Women in the workplace have higher stress levels than men, and this makes them unhappier with their husbands when they go home, which sends a negative message to their sons, he argued. In his study of Scandinavian countries where they have &quot;gender blindness,&quot; i.e. women are expected to behave like men in the workplace, and men are expected to have more feminine qualities at home, the result has been fewer marriages in the younger generations, and shorter relationships, he reported. Gray also addressed the problem of ADD, which particularly affects boys. Instead of giving them prescribed drugs like Ritalin, he suggested that a combination of grape seed extract (300 mg.) and Vitamin C (600 mg.) is just as effective of a treatment.\n\n------------------------------\n\nIn the latter half, historian and expert in ancient mysteries, Jonathan Cahn, talked about how omens from the Bible's oracle of Isaiah are reappearing in the U.S. with startling similarities to the events which foretold the destruction and fall of ancient Israel. These prophetic signs are warnings that America is in danger, he said. The first omen has to do with a breach in a nation's protection that allows an enemy to make a strike on that land. Such an event occurred in Israel in 732 BC, and we saw it again with the 9-11 attacks on American soil, he explained.\n\nIn another parallel between ancient Israel and the U.S., both vowed to rebuild after their attacks with the construction of a tower, he continued. Cahn also spoke about omens having to do with Sycamore and Erez Trees, proclamations of judgment by people in power, and the &quot;second shaking&quot; of America-- its economic collapse.\n\nNews segment guests: Steve Kates (Dr. Sky), Jerome Corsi\n\nWebsite(s):\n &lt;a href=&quot;\nhttp://www.marsvenus.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.marsvenus.com&lt;/a&gt; &lt;a href=&quot;\nhttp://www.marsvenus.com/coast&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.marsvenus.com/coast&lt;/a&gt; &lt;a href=&quot;\nhttp://www.theharbinger-jonathancahn.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.theharbinger-jonathancahn.com/&lt;/a&gt; &lt;a href=&quot;\nhttp://www.hopeoftheworld.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.hopeoftheworld.org&lt;/a&gt;\n\nBook(s):\n\nVenus on Fire, Mars on Ice &lt;a href=&quot;\nhttp://amzn.to/x8FS15&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://amzn.to/x8FS15&lt;/a&gt;\n\nMen Are from Mars, Women Are from Venus &lt;a href=&quot;\nhttp://amzn.to/AxkL4m&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://amzn.to/AxkL4m&lt;/a&gt;\n\nWhy Mars and Venus Collide &lt;a href=&quot;\nhttp://amzn.to/zE8R78&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://amzn.to/zE8R78&lt;/a&gt;\n\nThe Harbinger &lt;a href=&quot;\nhttp://amzn.to/xoWBfo&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://amzn.to/xoWBfo&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:4111fffa462276fb76f6f18b95ec629f280d85ff","amp;dn":"Coast+to+Coast+AM+2012.04.04+Remote+Viewing+Experiments","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4111fffa462276fb76f6f18b95ec629f280d85ff","infoHashBuffer":{"type":"Buffer","data":[65,17,255,250,70,34,118,251,118,246,241,139,149,236,98,159,40,13,133,255]},"announce":[],"urlList":[]}}