{"title":"Snow White And The Huntsman XVID cam GLOBE","uid":7323357,"size":1294710214,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:4a934f832e642a046a346145ef2fe2b51a925bab&amp;dn=Snow+White+And+The+Huntsman+XVID+cam+GLOBE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"globeplus","files":-1,"time":1338682600,"description":"* XVID CAM  * 01H57M10S    * + 1300 Bitrate    * Worked with the Dub plugins\n\n\n* FILE INFO :\n\n\n- Black borders at the top and the bottom in full screen corrected\n\n- particles on the picture background reduced to the minimum\n\n- colours improved\n\n\n\n* Plot :\n \nSnow White (Kristen Stewart) is the daughter of King Magnus (Noah Huntley) and Queen Eleanor (Liberty Ross). After his wife's death, King Magnus falls in love with the beautiful Ravenna (Charlize Theron) after rescuing her from the Dark Army, a fleet of invincible glass soldiers who have enslaved several of the neighboring kingdoms. The two are married but Ravenna - who is in fact a powerful sorceress and the Dark Army's master - kills Magnus on their wedding night after claiming that men like the King exploit the beauty of women and discard them. As Ravenna seizes control of the kingdom, Magnus' most trusted knight Duke Hammond (Vincent Regan) attempts to help Snow White escape the Castle but fails when she is captured by Ravenna's brother and enforcer Finn (Sam Spruell). Snow White is then locked away in the dungeons while Ravenna uses her Magic Mirror (Christopher Obi Ogugua), who promises to help her become &quot;the fairest of them all&quot;. Over the next several years, Ravenna captures all the women whose beauty might surpass her own and drains their youth. The kingdom meanwhile is left in ruins under her rule and Ravenna's abuse of magic results in her stolen beauty fading.\n\n\n\n\n\n\n\n\n* enjoy ...\n\n\n\n\n\n\n\n* GLOBE FILES 2012","torrent":{"xt":"urn:btih:4a934f832e642a046a346145ef2fe2b51a925bab","amp;dn":"Snow+White+And+The+Huntsman+XVID+cam+GLOBE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4a934f832e642a046a346145ef2fe2b51a925bab","infoHashBuffer":{"type":"Buffer","data":[74,147,79,131,46,100,42,4,106,52,97,69,239,47,226,181,26,146,91,171]},"announce":[],"urlList":[]}}