{"title":"Femdom - Double Humble 720p - Lakeview Ent.","uid":7206875,"size":1199047572,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:4b37a06e342389fc0593a0965496610c154828df&amp;dn=Femdom+-+Double+Humble+720p+-+Lakeview+Ent.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"shallow2","files":-1,"time":1335124696,"description":"\nDouble Humble 720p - Lakeview Ent.\n\nStars: Maya Sinstress, Miss Lydia, Slave Jack, Slave Marco\n\nMistress Maya and Miss Lydia join together to humble two pantyhose slaves. Lots of humiliation, spitting and ass kissing as they break the boys in a bit before making the little one suck some cock as the big one puts on Miss Lydia's pantyhose. Mistress Maya straps on and pleasures Miss Lydia then allows the males to suck Her cum from the strap-on. Miss Lydia straps a big big dildo on and they both tear up some male ass. A humiliating ass to mouth cross suck finishes the film. \n\nSensuous pantyhose action in the sunroom as slave jack swallows Mistress Maya's spit and then She is joined by Miss Lydia. The two continue to use him as their personal spittoon. He is tantalized by their asses and allowed to kiss them before the beckon slave marco in and seat themselves in front of their two supplicants. High heel and foot domination ensues as the two males worship their feet. \n\nMistress Lydia has Her high heels deep throated and then orders him to slip off Her shoe to worship Her nylon covered feet. They both have their toes sucked and feet worshiped and then then Mistress Maya face sits marco and Mistress Lydia does a slow strip tease, removing Her pantyhose and revealing Her perfect ass. The lucky slave is handed Her warm, moist pantyhose and ordered to put them on while on his back. Mistress Mays sits on his face to make it as difficult as possible and they order the small slave to jerk his cock. He manages to finally get the pantyhose on as both women punish him. The other submissive begins to lick his taint through the pantyhose. \n\nMiss Lydia strips the pantyhose down and they order the smaller slave to suck cock. They hold his head and make him gag as the cock gets hard. Miss Lydia moves to put on another pair of pantyhose as Mistress Maya queens marco and keeps slave jack sucking his cock. Miss Lydia expertly slides into a pair of black, crotch less pantyhose and moves back to tease the sucking slave with Her feet on the back of his head as Mistress Maya slips on a strap-on. Miss Lydia stands on the big slave and bends to take Mistress Maya's strap-on. She is fucked to orgasm while atop the slave. \n\nCover front and back:\n &lt;a href=&quot;\nhttp://ct.vod.com/boxcover.php?img=http://imgcover-2.vodconcepts.com/image2/large/200/200546.large.0.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://ct.vod.com/boxcover.php?img=http://imgcover-2.vodconcepts.com/image2/large/200/200546.large.0.jpg&lt;/a&gt;\n\nEnjoy! And if you like what we upload, please leave some nice feedback for Merzedes and me :)\n","torrent":{"xt":"urn:btih:4b37a06e342389fc0593a0965496610c154828df","amp;dn":"Femdom+-+Double+Humble+720p+-+Lakeview+Ent.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4b37a06e342389fc0593a0965496610c154828df","infoHashBuffer":{"type":"Buffer","data":[75,55,160,110,52,35,137,252,5,147,160,150,84,150,97,12,21,72,40,223]},"announce":[],"urlList":[]}}