{"title":"alterMW3[SRB]by.nasi-torrenti","uid":7057363,"size":239032320,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:4e767cafbeba0509336f358f5d7cfef23dda0f2c&amp;dn=alterMW3%5BSRB%5Dby.nasi-torrenti&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"MaXLinE","files":1,"time":1330182668,"description":"****************************************************\n\nALTERMW3 by nasi-torrenti.net\n\n\nalterMW3 client za online multiplayer preko AlterIW mreze!\nOvaj patch/mod omogucava igracima da igraju online na crackovanim verzijama\nigre, RELOADED, SKIDROW, P2P. Instalacija je testirana, i radi bez problema.\n\nUputstva:\n\n*1 Skinete image, mountujete preko Daemon Tools\n*2 Patch/MOD instalirate tamo gde vam je folder Call Of Duty- Modern Warfare 3\n   ali pre toga pozeljno je da igra bude crackovana. U mom slucaju imao sam RELOADED\n   pa je radilo ko podmazano :D\n*3 Kada sve to uradite, u glavnom direktorijumu nadjite fajl &quot;alterMW3.exe&quot;\n   i taj fajl pokrecete, ali pre toga treba da imate C++ 2008 REDIST instaliran\n   i .NET framework 4, da bi se igra sama update s alter sajta! Kada kliknete\n   videcete da ce iskociti mali prozor na kome pise DOWNLOADING ili UPDATE,whatever!\n*4 Nakon zavrsetka toga idete nai kliknete na REGISTER, i napravite\n   sebi ACCOUNT tj. nalog izaberete svoj username i password i te podatke cete\n   koristiti da bi se ulogovali u igru, dakle vas USERNAME koji ste pri registraciji\n   izabrali, ON ce vam biti NICKNAME u igri, tj. tako ce vas drugi videti\n*5 TO JE SVE. i uzgred posetite nas novootvoreni sajt nasi-torrenti.net :)\n\nU SLUCAJU DA NE MOZETE DA SE POVEZETE, PRATITE STANJE SERVERA na altermw3.net, tu mozete videti da li je server online, ili NE. Posto je client u ALPHA BETA fazi.\n\nPOzz\n\nMAX. Srbija\n\n*****************************************************\n\nEnglish\n\n\nalterMW3 is client for the online multiplayer via network AlterIW!\nThis patch / mod allows players to play online on versions of cracked\ngame, RELOADED, SKIDROW, P2P. Installation has been tested and works fine.\n\nInstructions:\n\n* 1 Download this torrent, mount via Daemon Tools, Klick on INSTALL\n* 2 Patch / MOD install where is main folder Call Of Duty-Modern Warfare 3 (ex Prog. FIles)\n    but before that it is desirable that the game is cracked. In my case I had RELOADED version who worked so smoothly :D\n* 3 When all you do, in the main directory find file &quot;alterMW3.exe&quot;\n    and run this file, but before that you need a C + + 2008 installed REDIST\n    and. NET Framework 4, in order to update the game itself from alterIW site! when you click you will see a small window pops up that says DOWNLOADING or UPDATE, or, whatever!\n* 4 Upon completion of that go onand click on REGISTER and make\n    ACCOUNT yourself. choose your account username and password and that data will\n    be used to log into the game, your USERNAME that you registered with\n    selected, it will be your NICKNAME in the game.\n* 5 That's all.\n\nIn case you you cant connect to play online, checkout the server altermw3.net SERVER, there you can see is it server online or not. Since the client is in ALPHA BETA stage.\n\nCheers!\n\n\n******************************************************\n\nMAX. Srbija","torrent":{"xt":"urn:btih:4e767cafbeba0509336f358f5d7cfef23dda0f2c","amp;dn":"alterMW3%5BSRB%5Dby.nasi-torrenti","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4e767cafbeba0509336f358f5d7cfef23dda0f2c","infoHashBuffer":{"type":"Buffer","data":[78,118,124,175,190,186,5,9,51,111,53,143,93,124,254,242,61,218,15,44]},"announce":[],"urlList":[]}}