{"title":"DP Anime: Catgirls Theme Xbox 360","uid":7085795,"size":84762624,"categoryP":"games","categoryS":"xbox360","magnet":"?xt=urn:btih:4efbb0f9d5998f061c9acf386ed5a997ee55e1e6&amp;dn=DP+Anime%3A+Catgirls+Theme+Xbox+360+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"shikibane","files":-1,"time":1331179751,"description":"This is an offical xbox 360 theme you can buy it here &quot;http://marketplace.xbox.com/en-US/Product/DP-Anime-Catgirls-Theme/00000000-0000-4003-803f-000a444d07d1&quot; although you don't need to since im putting it up for download on tpb. All i did to this theme was mix it up a little i made one theme into several by changing the pictures around don't worry though the official one is still in this download and it's labeled accordingly. \n\nDescription: \nSpice up your dashboard with colorful catgirls Kity, Mika, Misha and Candy. Preview and interact at disruptivepublishers.com. Â© 2007 Mizuko (Emma Salamanca). There are no refunds for this item. For more information, see www.xbox.com/live/accounts.\n\nInstructions on how to get this theme on your 360: \n\nFirst format a flashdrive on your xbox how you do this is go to system settings storage then go to usb storage device and press A on configure.\n\nNext plug your flashdrive up to your pc then download this program here called Horizon &quot;http://download.cnet.com/Horizon/3000-2130_4-75452078.html?part=dl-&amp;subj=dl&amp;tag=button&quot; once your done downloading and installing this open it up drag one of my themes into it then click save to device.\n\nFinally plug your usb back up to your xbox go to system settings storage click on usb device then go down to themes and you should see my theme there next click copy or move then select your xbox hardrive.\n\nOnce youv'e done all this all you got to do is simply apply the theme which is easy if anyone doesn't know how to do that just ask me or google it.\n","torrent":{"xt":"urn:btih:4efbb0f9d5998f061c9acf386ed5a997ee55e1e6","amp;dn":"DP+Anime%3A+Catgirls+Theme+Xbox+360+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4efbb0f9d5998f061c9acf386ed5a997ee55e1e6","infoHashBuffer":{"type":"Buffer","data":[78,251,176,249,213,153,143,6,28,154,207,56,110,213,169,151,238,85,225,230]},"announce":[],"urlList":[]}}