{"title":"RuneScape Macros Updated [04/22/2012] [Coolcrazyfly]","uid":7206922,"size":8481413,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:4fe9a30b295a0d4da16f5ea5520607cb1db43686&amp;dn=RuneScape+Macros+Updated+%5B04%2F22%2F2012%5D+%5BCoolcrazyfly%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"coolcrazy","files":9,"time":1335125718,"description":"+++++++++++++++++++\n[04/22/2012] Update\n+++++++++++++++++++\n\nI have made this compilation So that hopefully all the rest of the community will have an easier time with downloading all the different Runescape bots that are available as of now. I have taken a lot of my own personal time to put this whole torrent together so I just hope that you will comment what you think about it and tell your freinds about it. I would also like it if you could take the time to seed this. If you have any suggestions on what I should add just comment below so I can make this even better for the rest of the community. Thanks for taking the time to read this.\n\n\nDISCLAIMER:\nThis is a compilation of all of the most functional RuneScape macros and bots as of April 22, 2012. I have included instructions on how each bot is to be set up for best performance &amp; results.\n\nI take no credibility for any development of the bots featured in my compilation. I did however, include every script that I have personally purchased up to this date. The scripts that I have purchased can be found in the RSBot folder, as RSBot is the client that the paid scripts will work for.\nUPDATE: I will re-include the scripts when they are functional. RSBot is currently in its beta stage of development, rendering all scripts nonfunctional.\n\nThe bots featured in my compilation are as follows:\n\nRSBot\nEpicBot\nSimba- Simba scripts can be found here: http://villavu.com/\n\nUpon the completion of your download, please make sure to seed, and leave feedback for how I can make future improvements to it's organization/addition of more paid scripts/etc.\n\nThank you &amp; stay tuned, as I will be making consistent releases to keep up with the flow of bot &amp; script updates. Please bookmark my profile to be notified of my releases!\n\n- Coolcrazyfly\t\t","torrent":{"xt":"urn:btih:4fe9a30b295a0d4da16f5ea5520607cb1db43686","amp;dn":"RuneScape+Macros+Updated+%5B04%2F22%2F2012%5D+%5BCoolcrazyfly%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4fe9a30b295a0d4da16f5ea5520607cb1db43686","infoHashBuffer":{"type":"Buffer","data":[79,233,163,11,41,90,13,77,161,111,94,165,82,6,7,203,29,180,54,134]},"announce":[],"urlList":[]}}