{"title":"Greenhaven Encyclopedia of The Vietnam War {BBS}","uid":7341930,"size":6770393,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:500845e32e21f64a50093d4d3772b6363ede7504&amp;dn=Greenhaven+Encyclopedia+of+The+Vietnam+War+%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"bigbluesea","files":-1,"time":1339266892,"description":"Alphabetical entries provide easy access to information on numerous topics including major battles and missions; significant persons such as generals, antiwar activists, leaders, and ambassadors; policies and initiatives; weapons; incidents; and more. Most articles range from a paragraph to a page but a number of topics are examined in longer entries (e.g., &quot;Ho Chi Minh,&quot; &quot;Battle of Hue,&quot; &quot;Richard Nixon,&quot; etc.). Cross-references guide readers to related topics, helping to place the war within its larger historical and global context. Headings for articles are in bold type and there are guide words at the top of each page. Type size is generous. Average-quality, captioned black-and-white photos and maps throughout the book add interest and enhance understanding. An appended chronology begins with the year 1887 when France formed the Indochinese Union and ends with 1993 when the U.S. resumed formal diplomatic relations with Vietnam. A four-page annotated list for further reading includes both print and Web resources. Finally, there is a comprehensive index to further ease access to information. Spencer Tucker's three-volume Encyclopedia of the Vietnam War (ABC-CLIO, 1998) includes more and longer entries with references at the end of each article. However, libraries will find the easy-to-use Greenhaven title a satisfactory alternative.-Dana McDougald, Cedar Shoals High School, Athens, GA\nCopyright Â© Reed Business Information, a division of Reed Elsevier Inc. All rights reserved. \n\n\nHardcover: 288 pages\nPublisher: Greenhaven; 1 edition (October 31, 2003)\nLanguage: English\nISBN-10: 0737711493\nISBN-13: 978-0737711493","torrent":{"xt":"urn:btih:500845e32e21f64a50093d4d3772b6363ede7504","amp;dn":"Greenhaven+Encyclopedia+of+The+Vietnam+War+%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"500845e32e21f64a50093d4d3772b6363ede7504","infoHashBuffer":{"type":"Buffer","data":[80,8,69,227,46,33,246,74,80,9,61,77,55,114,182,54,62,222,117,4]},"announce":[],"urlList":[]}}