{"title":"The Story of the Noughties   (BBC 2010 - Complete Series)","uid":7244312,"size":1469157423,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:5323ea62cd4e8005765523458aef2b3ef9a13941&amp;dn=The+Story+of+the+Noughties+++%28BBC+2010+-+Complete+Series%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Lucybabe","files":4,"time":1336226338,"description":"History of Now: The Story of the Noughties\n\nBBC2\n\n1/3 -Growing Young\n\nThe first of three films exploring what it was like to live through the last decade, and the surprising, often hidden connections which are shaping the 21st century.\n\nDuring the Noughties, an ageing Britain became obsessed with recapturing its youth. The result: trends and fads such as kidults, micro scooters and 'middle youth'. But at the same time, the generation gap emerged as the most significant split in society. While older people pursued a more youthful image, real young people were demonised as 'hoodies'.\n\nReflecting on the decade we spent 'growing young' are a host of leading commentators and experts including Andrew Marr, Tanya Byron and Will Self. Along the way we discover how rave culture led to binge-drinking, learn about Britain's 'baby gap', and find out why downloads saved the Millennium Dome.\n\nBBC2 - 7 January 2010\n\n2/3 - All Together Now?\n\nThe second of three films exploring what it was like to live through the last decade, and the surprising, often hidden connections which are shaping the 21st century.\n\nAs Britain entered the new century, society seemed to be shaken up. Fame and glamour appeared to be within reach of us all. Reality TV made it possible for ordinary people to become celebrities. Easy credit fuelled a shopping binge where everyone felt entitled to top fashions and luxury goods. Politicians felt obliged to speak the language of popular culture. Had we really created a more equal Britain?\n\nWe also learn how chavs and WAGs changed the way we look, why 'bagonomics' made handbags fashion essentials, what your postcode reveals about you and how Jade Goody paved the way for David Cameron.\n\nBBC2 - 8 January 2010\n\n3/3 - Hello World\n\nThe last of three films exploring what it was like to live through the last decade, and the surprising, often hidden connections which are shaping the 21st century.\n\nIn the 2000s, few developed nations embraced globalisation as enthusiastically as multi-cultural, multi-ethnic Britain. But the consequences weren't always what we expected. We saw the stars of African football burst into the Premiership and Icelanders take over the high street, while we rode the Dubai property boom; two million Poles arrived in the UK but more than five million of us ended up living overseas. We fought new kinds of war abroad and faced international terrorism at home.\n\nThe film also reveals how the rise of China put burglars out of business, why the old Cold War made the cheap city break possible, and how British TV conquered the planet.","torrent":{"xt":"urn:btih:5323ea62cd4e8005765523458aef2b3ef9a13941","amp;dn":"The+Story+of+the+Noughties+++%28BBC+2010+-+Complete+Series%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5323ea62cd4e8005765523458aef2b3ef9a13941","infoHashBuffer":{"type":"Buffer","data":[83,35,234,98,205,78,128,5,118,85,35,69,138,239,43,62,249,161,57,65]},"announce":[],"urlList":[]}}