{"title":"Operation Matriarchy","uid":7177403,"size":2317914912,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:56bc5a9e82387d5efc66f8a583b27a7b8f8c0a5c&amp;dn=Operation+Matriarchy&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"esharoth","files":-1,"time":1334157820,"description":"Title: Operation Matriarchy\nGenre: FPS / action / sci-fi\nReleased: 25th August 2005\nDeveloper: Madia Entertainment\nPublisher: Buka Entertainment\nDescription:\nIn the mid-24th century, a virus of unknown origin wiped through the Velian civilization. It affected only the women, twisting them into brutal killing machines. They modified their bodies, enhancing them with cybernetic and bio-engineered parts. The male population was enslaved, used for genetic experiments and food. The previously democratic society became a matriarchal hive mind focused on one thing only, domination. All out war erupted between the Velians and their former allies, the Federation of Earth. The game begins seven years into the conflict. The Federation have gained ground, managing to push the Velians back to their home system. But when a number of colony ships go missing, apparently attacked by the Velians, the Federation sends in a military operation with the aim of wiping the aggressors out for good. You play the part of a Federation soldier, Senior Sergeant Paul Armstrong, a regular grunt whose ship is attacked and who finds himself taking on the Velian mutations alone. Your mission is to destroy the enemy and save the missing colonists. You will blast your way through 19 levels in a wide variety of locations, from a starbase to a swarming alien hive. The game features an arsenal of 14 hand weapons and two mech suits that you can climb into. The story is developed through pre-mission briefing screens and in-game communications from Federation HQ.\n\nHow to play:\n1) Download the game;\n2) Mount or burn disc image;\n3) Run setup.exe to install (it will start automatically if you have autorun enabled);\n4) Play the game without the disc.\n\n! Notice\nI have included two unofficial patches for the game. To install them, simply extract the archives to where you installed the game (overwrite existing files).\n\n1) Unofficial Music, Sound &amp; Re-Localization Patch\nIntroduces an in-game soundtrack, rebalances existing sound effects and adds new ones, replaces existing scripts and briefing messages, replaces cutscene audio files and also fixes various issues.\n\n2) Operation Matriarchy Enhancement Addon Version 1.0\nFixes bugs, enhances music, ambient sounds and effects, adds improved skins and textures. \n\nIf you like the game, SUPPORT the developers!","torrent":{"xt":"urn:btih:56bc5a9e82387d5efc66f8a583b27a7b8f8c0a5c","amp;dn":"Operation+Matriarchy","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"56bc5a9e82387d5efc66f8a583b27a7b8f8c0a5c","infoHashBuffer":{"type":"Buffer","data":[86,188,90,158,130,56,125,94,252,102,248,165,131,178,122,123,143,140,10,92]},"announce":[],"urlList":[]}}