{"title":"Sage Francis, Joe Beats - Nonprophets - Hope - FLAC","uid":7075438,"size":324561867,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:5946125a2977b66b085c6e9e997bdc1ae8f4c488&amp;dn=Sage+Francis%2C+Joe+Beats+-+Nonprophets+-+Hope+-+FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"stormium","files":-1,"time":1330819276,"description":"Non-Prophets is a pairing of lyricist Sage Francis and beatmaker Joe Beats.\n\nThe duo came to peoples attention with their first effort, the Drop Bass Bounce 12&quot; single on Emerge Music in 1999. The follow-up release came in 2000 as the &quot;All Word, No Play&quot; vinyl single.\n\nShortly after the Non-Prophets singles caught a buzz, Sage verbally committed to the then up-and-coming label anticon. for the release of his first solo album. Until Personal Journals' official unveiling in 2002, Francis self-released his &quot;Sick Of&quot; series which included Non-Prophets material.\n\nAround the same time Beats created his first compilation of instrumentals, Reverse Discourse. Here Joey introduces his unpaused/uninterrupted style of producing. With Sage's help the album saw the light of day on his label, Strange Famous Records.\n\nTheir debut album, Hope was released on Lex Records in 2003, and was described by Pitchfork Media as &quot;one of the year's finest&quot;, also receiving a positive review from CMJ New Music Monthly. In early 2004, they toured the United States on Sage Francis' infamous &quot;Fuck Clear Channel&quot; tour.\n\nToday, the two are established as soloists. In 2004 Sage signed to punk label, Epitaph Records. In 2010 his Li(f)e was the third and final record to come out on one of Epitaph's sister labels ANTI-. In 2005, Joey released Indie Rock Blues on independent label, Arbeid and 24-7 Records.\n\nFLAC encode...\n\n-Non-Prophets \n--Hope (2003)\n---Intro\n---Any Port\n---Damage\n---That Ain't Right\n---Disasters\n---Fresh\n---Mainstream 307\n---A Mill\n---Spaceman\n---Zan's Heart\n---New World Order\n---Tolerance Level\n---The Cure\n---Outro/Bounce\n","torrent":{"xt":"urn:btih:5946125a2977b66b085c6e9e997bdc1ae8f4c488","amp;dn":"Sage+Francis%2C+Joe+Beats+-+Nonprophets+-+Hope+-+FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5946125a2977b66b085c6e9e997bdc1ae8f4c488","infoHashBuffer":{"type":"Buffer","data":[89,70,18,90,41,119,182,107,8,92,110,158,153,123,220,26,232,244,196,136]},"announce":[],"urlList":[]}}