{"title":"Ridge Racer Unbounded Full Game (1.4GB)","uid":7184528,"size":1513726400,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:5baf842cd727e65a159e40e13dd8c9c40654e860&amp;dn=Ridge+Racer+Unbounded+Full+Game+%281.4GB%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"BLOVES","files":3,"time":1334385752,"description":"RIDGE RACER UNBOUNDED\n(c) NAMCO\n\n\n\nRipped: Nothing\nRelease date: 30/03/2012\nType: ISO (1.4GB)\n\n\n\nDescription:\n\nThe popular racing franchise takes a hard swerve in a unique direction with Ridge Racer Unbounded, adding a punishing dose of destruction to the familiar arcade gameplay. Get ready to take the action off the circuits and into the streets for one of the most action-packed and destructive racing games ever seen. Players will careen through the competition using their four-wheeled street-racing thoroughbreds as high-octane wrecking machines with a new mantra - Drive, Destroy, Dominate.\n\n\n\nFeatures:\n-Crash through everything - Cutting edge physics and effects combine to bring direct destruction like you've never seen before. Unleash your rage to obliterate everything in your way and carve your own path.\n\n-Race in urban environments - Shatter Bay lives by its own rules and is ripe for being torn apart by the overpowered vehicles rampaging through its many areas, including the commercial zone, refi nery, port, and high-rise construction site.\n\n-New breed of racing machines - Traditional racing machines are out and dozens of badass street machines are in, including legendary RIDGE RACER Angel and Devil cars.\n\n-Design your own destruction - Use the simple but powerful tile-based City Creator to design incredible original tracks in minutes, each loaded with all the game's destructive features and varied environments.\n\n\n\nINSTALLATION NOTES\n\n1. Run &quot;Ridge Racer Unbounded Setup.exe&quot; as administrator\n2. Play Game.\n\n\nTo the people who steal my repacks, label them as their own and upload them on other websites, are you that pathetic that you have to try and make anonymous people on the internet proud of you for something that you're to stupid to actually achieve yourself? Grow up and if your going to post these repacks on other sites at least acknowledge my efforts on those sites","torrent":{"xt":"urn:btih:5baf842cd727e65a159e40e13dd8c9c40654e860","amp;dn":"Ridge+Racer+Unbounded+Full+Game+%281.4GB%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5baf842cd727e65a159e40e13dd8c9c40654e860","infoHashBuffer":{"type":"Buffer","data":[91,175,132,44,215,39,230,90,21,158,64,225,61,216,201,196,6,84,232,96]},"announce":[],"urlList":[]}}