{"title":"True Tears - Visual Novel (PC) Mirror Links","uid":7123536,"size":274,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:5be6b7bb0c7c206675a038af01de6375aebdde7b&amp;dn=True+Tears+-+Visual+Novel+%28PC%29+Mirror+Links&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Mulaman","files":1,"time":1332446197,"description":"Dreams, hopes, and aspirations ... are things that all people draw their visions of what the &quot;future&quot; may hold for them. Some are pastel-colored; others are darker in hue; still others shine radiant and unblemished like the hands of the rain.\n\nWhat are my dreams? What are my hopes? What do I aspire to become? These are questions that the characters of this story ask themselves. But must all of them turn at last to weeping? Must they all harbor such darkness under the shadow of the wings of their hearts? Some of them carry the wounds of the past with them still, the burden causing them to lose sight of their dreams. Others see insurmountable walls between them and the things they dream of, causing them to walk away and give up. And still others -- worst of all -- have forgotten what it is to dream altogether.\n\nAnd so they smile, smile warmly and widely, in order to hide away the darkness and pain in their hearts ... in order to shut out the future itself.\n\nBut the moment a girl should step forth and say &quot;no more&quot; -- that is the beginning and the end.\n\nThis is a season of true tears. Can you feel their hands as they rain down upon you? \n\n\n\n*\n\n! GAME ENTIRELY IN JAPANESE !\n! DOWNLOADS LINKS ONLY!\n\n*","torrent":{"xt":"urn:btih:5be6b7bb0c7c206675a038af01de6375aebdde7b","amp;dn":"True+Tears+-+Visual+Novel+%28PC%29+Mirror+Links","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5be6b7bb0c7c206675a038af01de6375aebdde7b","infoHashBuffer":{"type":"Buffer","data":[91,230,183,187,12,124,32,102,117,160,56,175,1,222,99,117,174,189,222,123]},"announce":[],"urlList":[]}}