{"title":"Mortimer Beckett - Time Paradox","uid":7130470,"size":256032768,"categoryP":"games","categoryS":"mac","magnet":"?xt=urn:btih:5ef42ac438ad7a037d2e2d81a335bd20b010f806&amp;dn=Mortimer+Beckett+-+Time+Paradox&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"WinterGale","files":1,"time":1332692199,"description":"Take a wild trip through history to recover a time bomb in Mortimer Beckett and the Time Paradox, the second installment of the acclaimed seek-and-find series. \n\nIn his first adventure, Mortimer succeeded in finding his uncle and ridding the mansion of ghosts. Unfortunately, doing so created a time portal that now poses an even greater threat. To close the portal, Uncle Jerome created a time bomb but it was sucked through the portal before it could be used. Now Mortimer is on a race through time to locate the unit before history is changed forever.\n\nContinue the adventure with Mortimer as he travels through eight different eras to recover the bomb and close the time portal for good. Visit the French Revolution, the grandeur of Egypt, ancient Greece, and much more. Search through interconnected scenes and find useful items as well as parts of the time bomb. Solve a whole new series of inventive puzzles, play fantastic mini-games, meet incredible people, and find a way home! \n\nFEATURES INCLUDE: \n- Stop history from being altered in this incredible Hidden Object adventure.\n- Join Mortimer as he travels through time in search of a time bomb.\n- Visit the French Revolution, the grandeur of Egypt, ancient Greece, and much more.\n- Search through interconnected scenes and find useful items. \n- Solve a whole new series of inventive puzzles and meet historical people.","torrent":{"xt":"urn:btih:5ef42ac438ad7a037d2e2d81a335bd20b010f806","amp;dn":"Mortimer+Beckett+-+Time+Paradox","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5ef42ac438ad7a037d2e2d81a335bd20b010f806","infoHashBuffer":{"type":"Buffer","data":[94,244,42,196,56,173,122,3,125,46,45,129,163,53,189,32,176,16,248,6]},"announce":[],"urlList":[]}}