{"title":"Rob Roy (1995) 720p H.264 (moviesbyrizzo) MKV AC3 optnl subs","uid":7081705,"size":4672597692,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:5f7ab7dbc575ee9e3f77ca0662cd1cfc337bec15&amp;dn=Rob+Roy+%281995%29+720p+H.264+%28moviesbyrizzo%29+MKV+AC3+optnl+subs&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"moviesbyrizzo","files":-1,"time":1331052259,"description":" &lt;a href=&quot;http://www.imdb.com/title/tt0114287/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.imdb.com/title/tt0114287/&lt;/a&gt;\n\n1280 x 544 resolution at 3950k video bitrate 448k 5.1 ac3 6 channel \nsurround sound effect audio\n\nsubtitles in SRT format for the following language offerings\nincluded here for you:\n\nCroatian Danish Dutch Finnish French Portuguese Romanian Serbian Spanish\nSwedish and an English template is included for any languages not already posted\n\n\nSet in the Scottish highlands it is an interesting movie about a code of conduct,\na code of honour that goes to regimentalize and civilize a mindset that seeks a \nsense of order and predictability amidst much evil and wickedness that such nice \nfolk (played by Liam Neeson and Jessica Lange in the plot of the movie)would have \nto confront and negotiate through as treacherous conditions would no doubt see \nthem devoured by circumstances. All societies have come though something similar \nin the way of a period of having to calm the waters so that a real sense of \ngoodness replaces the rules of engagement that are otherwise based on the morality \nof self interest and basic survival alone. nevertheless that is something and it \ncertainly beats being altogether at the vagaries of a completely uncivilized \nsetting where no sense of &quot;quid pro quo&quot; is recognized as intelligible by those on \nthe stage.\n\n\nIt was heartbreaking to see Liam Neeson's character suffer as much as he does in \nthis movie with what befalls his family in what is barbaric cruelty (He has a \nheavy burden that is cruelly and with obvious malice, inflicted upon him that is \nonly cathartically set right after great turmoil. Oh well, all is well that ends \nwell as they say. This is a movie for fans of Jessica Lange and for those that \nenjoy the banter of discourse of what is civil engagement in what Hobbes would \nrefer to a &quot;state of nature&quot; nonetheless.\n\n\n\nWhen asked to define what &quot;honour&quot; is (by his children in this tale)\nLiam's character says it is such a quality that requires as well that true\nmen who possess this quality are rightly protective of womenfolk as is deserved\naccording to their kind natures as a so created being. Are you folks all \nlistening out there today, huh! (equally???) This is certainly in contrast to\nthe sort of &quot;men&quot; who say they don't recognize men and women differently using\nanatomical comparisons even, perhaps (towards the beginning of the movie)\n\nMichael Rizzo Chessman\nmoviesbyrizzo\n\nquoting Liam Nesson in the movie plot:\n&quot;honour is a mans gift to himself\nWomen have the heart of honour\nand we cherish and protect it in them\nyou must never mistreat a woman or malign a man...\nor stand by and see another do so...&quot;\n\n\n\nnote: mature content","torrent":{"xt":"urn:btih:5f7ab7dbc575ee9e3f77ca0662cd1cfc337bec15","amp;dn":"Rob+Roy+%281995%29+720p+H.264+%28moviesbyrizzo%29+MKV+AC3+optnl+subs","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5f7ab7dbc575ee9e3f77ca0662cd1cfc337bec15","infoHashBuffer":{"type":"Buffer","data":[95,122,183,219,197,117,238,158,63,119,202,6,98,205,28,252,51,123,236,21]},"announce":[],"urlList":[]}}