{"title":"Cyber Update Apr.2012 - MP4 - DB-21137 Isis Love and Kristina Ro","uid":7161758,"size":1894185839,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:5fa799d0960ab42a596e50cdd4b42066425f7dd5&amp;dn=Cyber+Update+Apr.2012+-+MP4+-+DB-21137+Isis+Love+and+Kristina+Ro&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"shallow2","files":-1,"time":1333636593,"description":"Kristina Rose - Filthy Whore - Live Show Part 1\n\nApr 4, 2012 - Performers: Isis Love and Kristina Rose\n\n         \nThe first part of our Live Show starts with the amazing Kristina Rose on the floor with a wooden spreader bar with spiked ends bound to her knees, prying them uncomfortably open and one ankle drilled into the floor with a metal cuff. She chats with the members offering them friendly responses with a pretty girl smile.\n\nThe first challenge is the 5 minute challenge. The deal is the model has 5 minutes to escape from the bondage. If she can get free, she gets an orgasm. If she can't get free, then she does not get to cum and gets punished. JP binds Kristina in a ball gag, wrists and elbows strapped together, thighs strapped together, and ankles strapped together. She squirms and tries as much as she can to get free. Her breathing is labored and moans are rhythmic... she doesn't get free.\n\nKristina is released and gets her punishment for not being able to get out - cane strokes on the feet from JP and flip cat strokes from Isis. Tears roll down her face from fear of the cane, but she takes it like a champ and perseveres.\n\nAfter she has paid the price of not being able to get free, she is asked to crawl across the stage on her hands and knees to a new device. JP straps her ankles to her thighs in leather and places her neck and wrists in to metal stocks. She looks stunning. JP has Kristina try and recite the alphabet backwards as he adds nipple clamps and ties them to her toes. She is having a hard time reciting her alphabet. They asked her to also recite nursery rhymes. She fails there too. JP increases her predicament by adding nipple clamps underneath the top row and then weights onto the clamps. JP then adds weights to her toes pulling her nipples both up and down. Finishing it off, JP adds an enormous clothespin to her tongue, weighing it down and keeping her mouth open.\n\nJP makes Kristina beg to suck cock but she is is not very convincing. JP encourages her to talk about what a dirty whore she is, what a dirty fucking slut she is.... she begs and begs and finally gets to suck cock. Her mouth gets filled with cock. She services it and streams of drool seep from her mouth onto the floor. The giant clothespin that was on her tongue now gets clamped on her pussy. JP wants her to feel more pain and her nipples are flogged. She continues to beg to suck more cock and eventually more cock she gets. JP flogs her breasts again and into a frenzy. She becomes more overwhelmed and JP and Isis come in and remove the nipple clamps.\n\nIts time for pleasure. Isis vibrates Kristina to orgasm as JP pinches her breasts one more time. Kristina builds to an intense orgasm, cums, sucks on more dick, cums again, and cums again!\n\nThis torrent includes MP4 + Pics.\n &lt;a href=&quot;\nhttp://www.devicebondage.com/site/shoot.jsp?shootId=21137&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.devicebondage.com/site/shoot.jsp?shootId=21137&lt;/a&gt;\n\nMerzedes is away for a few days so Im handling the uploads. Enjoy :)\n\n","torrent":{"xt":"urn:btih:5fa799d0960ab42a596e50cdd4b42066425f7dd5","amp;dn":"Cyber+Update+Apr.2012+-+MP4+-+DB-21137+Isis+Love+and+Kristina+Ro","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5fa799d0960ab42a596e50cdd4b42066425f7dd5","infoHashBuffer":{"type":"Buffer","data":[95,167,153,208,150,10,180,42,89,110,80,205,212,180,32,102,66,95,125,213]},"announce":[],"urlList":[]}}