{"title":"&amp;Documentales 02","uid":7050057,"size":2184024210,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:5ff45d86ada8bcd24e76ed88f11da519f638f9c4&amp;dn=%26amp%3BDocumentales+02&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"hglbrt","files":3,"time":1329921056,"description":"Documentales sobre el fin de la era del petroleo\n\nTamaÃƒÂ±o del paquete completo: 2.03 GB\n\n1. PetrÃƒÂ³leo, humo y reflejos \nTamaÃƒÂ±o del archivo: 392 MB\nAÃƒÂ±o: 2006\nDirecciÃƒÂ³n: Ronan Doyle\nDuraciÃƒÂ³n: 50 minutos\nIdioma: Ingles - SubtÃƒÂ­tulos en espaÃƒÂ±ol\n[La calidad de la imagen de este documental no es la mejor, pero es lo que pude encontrar]\n\nSinopsis: Mediante entrevistas a ex funcionarios de gobierno, investigadores y especialistas en diferentes ÃƒÂ¡reas, el documental analiza el tema del cenit del petrÃƒÂ³leo (el periodo en que se alcanza el mÃƒÂ¡ximo en la extracciÃƒÂ³n y ÃƒÂ©sta comienza a descender) y sus implicaciones en el terreno polÃƒÂ­tico, econÃƒÂ³mico y militar. En particular se habla del vÃƒÂ­nculo entre el cenit del petrÃƒÂ³leo y los atentados del 11 de septiembre, de las guerras en Medio Oriente y de la llamada &quot;guerra contra el terror&quot;.\n\n\n2. Punto ciego\nTamaÃƒÂ±o del archivo: 564 MB\nAÃƒÂ±o: 2008\nDirecciÃƒÂ³n: Adolfo Doring\nDuraciÃƒÂ³n: 85 minutos\nIdioma: Ingles - SubtÃƒÂ­tulos en espaÃƒÂ±ol\n\nSinopsis: Comienza haciendo un breve recuento del grado de dependencia de la civilizaciÃƒÂ³n actual hacia el petrÃƒÂ³leo y luego, a travÃƒÂ©s de varias entrevistas y desde varias perspectivas, toca los temas de por quÃƒÂ© las sociedades no reaccionan ante los problemas que se avecinan, de la convergencia de otras crisis (como el calentamiento global) que se aÃƒÂ±aden a la del petrÃƒÂ³leo, y sobre las consecuencias que podrÃƒÂ­a tener en el futuro el agotamiento de los hidrocarburos.\nEl tÃƒÂ­tulo del documental deriva de la expresiÃƒÂ³n de una de las entrevistadas, segÃƒÂºn la cual, para la mayorÃƒÂ­a de las personas la conciencia y el compromiso de cambio quedan en un punto ciego dado que solo estÃƒÂ¡n acostumbrados a reaccionar automÃƒÂ¡ticamente.\n\n\n3. Un crudo despertar\nTamaÃƒÂ±o del archivo: 1.17 GB\nAÃƒÂ±o: 2006\nDirecciÃƒÂ³n: Basil Gelpke, Ray McCormack \nDuraciÃƒÂ³n: 82 minutos\nIdioma: InglÃƒÂ©s - subtÃƒÂ­tulos en espaÃƒÂ±ol\n\nSinopsis: El documental comienza con una revisiÃƒÂ³n sobre la dependencia creciente hacia el petrÃƒÂ³leo y el paso del descubrimientos de nuevos yacimientos hasta su agotamiento.  ContinÃƒÂºa con el tema de las luchas por el recurso, las guerras por el petrÃƒÂ³leo y finalmente concluye haciendo una rÃƒÂ¡pida revisiÃƒÂ³n sobre las posibilidades de las energÃƒÂ­as alternativas y las perspectivas de una civilizaciÃƒÂ³n sin petrÃƒÂ³leo.\n","torrent":{"xt":"urn:btih:5ff45d86ada8bcd24e76ed88f11da519f638f9c4","amp;dn":"%26amp%3BDocumentales+02","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5ff45d86ada8bcd24e76ed88f11da519f638f9c4","infoHashBuffer":{"type":"Buffer","data":[95,244,93,134,173,168,188,210,78,118,237,136,241,29,165,25,246,56,249,196]},"announce":[],"urlList":[]}}