{"title":"almost love 2006 [english softsubbed]","uid":7164839,"size":734891151,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:6086396ff6e80f42136e0ccb4863f567ef3d939c&amp;dn=almost+love+2006+%5Benglish+softsubbed%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"T3mp3r","files":4,"time":1333739803,"description":"This film starts out as a total slapstick and ends on a much more serious note. It seems the director was having a bet each way and trying to cater to everyone. It's a pity he didn't choose one or the other path to follow through, rather than trying to walk two paths simultaneously.\n\nSimple story outline: two childhood friends, Ji-hwan (Kwon Sang-woo) and Dal-rae (Kim Ha-neul) have grown up side by side. They know everything there is to know about the other, good and bad. Ji-hwan, complete with early JC-imitative hairstyle, wants to become the next Jackie Chan. He practices relentlessly, and he comes across as a bit of a dim-witted lech. Dal-rae wants to be an actress, but she's painfully shy. They tease each other mercilessly about their respective flaws, but underneath it is an understanding built over thirteen years.\n\nEnter The Boyfriend, played by Lee Sang-woo. He's handsome, athletic, charming, thoughtful etc. The problem is, Ji-hwan is jealous of him and can't admit it, and Dal-rae just can't relax with him. When she has a problem, or something on her mind, she goes first to Ji-hwan. They have a brief falling-out, and a reluctant reconciliation spearheaded by the Boyfriend and come to realise how they really feel blah blah blah. Though it's been done to death as a plot point, it's pretty well done here.\n\nAnd this should have been the story. Instead, there is a melodrama tacked on in the shape of a critical injury for Ji-hwan, which means he will never realise his dream. It seems oddly out of place and it makes the running time way too long (116mins).\n\nAlso, I was left wondering: Is there EVER going to be an end to the fixation with childhood sweethearts who are Meant For Each Other? Just once, I would love to see the childhood friend ditched for the Boyfriend. Now that would be groundbreaking - at least for Korean cinema.\n\nSee it if you're curious, or you find someone in the cast rather dishy. Otherwise, see FORBIDDEN QUEST and get your money's worth.","torrent":{"xt":"urn:btih:6086396ff6e80f42136e0ccb4863f567ef3d939c","amp;dn":"almost+love+2006+%5Benglish+softsubbed%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6086396ff6e80f42136e0ccb4863f567ef3d939c","infoHashBuffer":{"type":"Buffer","data":[96,134,57,111,246,232,15,66,19,110,12,203,72,99,245,103,239,61,147,156]},"announce":[],"urlList":[]}}