{"title":"BBC - In Search of Shakespare - Michael Wood - Complete series o","uid":7118331,"size":14961091101,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:627ae229408da9b209da1514626193c9586c4cdc&amp;dn=BBC+-+In+Search+of+Shakespare+-+Michael+Wood+-+Complete+series+o&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"anmids","files":5,"time":1332282630,"description":"I ripped the 2 dvd's set to mkv without recoding/resizing or anything. They are as they appear in the dvd, same quality and everything, but I just put them into individual .mkvs.\n\n\nInformation: \n\nHere you have a short clip I found on Youtube to have an idea what the documentary is like:\n\n\nFrom the Back Cover\nHosted by Michael Wood, this four-part history series explores the life of the world's greatest writer. Mixing travel, adventure, interviews and specially shot sequences with the Royal Shakespeare Company on the road, the series sets the life of Shakespeare in the turbulent times in which he lived--a time of surveillance, militarism and foreign wars. The Bard lived through the Spanish Armada, the Gunpowder Plot and the colonization of the New World, and saw firsthand England's Cultural Revolution, which led the English people into a new Protestant future.\n\nProduct Description\nWhat a piece of work was William Shakespeare! The world's greatest dramatist is known as never before in this illuminating, four-part historical series. The Bard's youth, the turbulent historical times in which he lived, his years of celebrity and success--all are explored in this riveting assemblage of interviews, stunning location photography, and sequences with the Royal Shakespeare Company. Michael Wood hosts. 4 hrs. total on two discs. Soundtrack: English; featurette. ","torrent":{"xt":"urn:btih:627ae229408da9b209da1514626193c9586c4cdc","amp;dn":"BBC+-+In+Search+of+Shakespare+-+Michael+Wood+-+Complete+series+o","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"627ae229408da9b209da1514626193c9586c4cdc","infoHashBuffer":{"type":"Buffer","data":[98,122,226,41,64,141,169,178,9,218,21,20,98,97,147,201,88,108,76,220]},"announce":[],"urlList":[]}}