{"title":"Andy - Siri for Android (Full)","uid":7158385,"size":743491,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:62dffe537867f719b586b2f9bc4a6f08643ca945&amp;dn=Andy+-+Siri+for+Android+%28Full%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"tejad","files":-1,"time":1333525893,"description":"Updated: April 2, 2012 Current Version:3.5 Requires Android: 2.2 and up\n\nAndy. The answer to all your questions!\nThis is a full and advertising free version of Andy (Siri for Android).\nThis version has no daily limit on number of questions you can ask and it comes with additional functionality, such as Bluetooth (A2DP), shake recording and access to question database. All this is missing in a free version of Andy.\n\nAbout Application: \nAndy is a voice controlled access to encyclopedic information on a vast array of topics. Ask anything. Andy covers culture and the arts, biographies and persons, geography and places, society and social sciences, history and events, natural and physical sciences, technology and applied science, religion and belief systems, health, mathematics and logic, philosophy and many other topics.\n\nYou can also ask about weather and time in any city, get answers to algebra questions, conversions, or simply ask any question just like you would do a search online.\nTo ask a question, tap the microphone button on the application home screen. Alternatively, you may give your device a little shake (this requires enabling the Shake Recording option) or simply type in your question manually to get the answer. \n\nOne of Andy's great features is its design to work with Bluetooth headsets (A2DP only, must pair with at least one device). Andy (using your Android phone or tablet) will recognize your voice and speech, search the Internet for the best answer, and read it back to you in a clear voice. The answer will also be displayed on your device screen.\nAdditionally, Andy can send text messages, initiate phone calls, give you directions and do distance measurements, time range measurements and a lot more. \n\nCheck out our manual for a list of all features at:  &lt;a href=&quot;\nhttp://www.AndyForAndroid.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.AndyForAndroid.com&lt;/a&gt;\n","torrent":{"xt":"urn:btih:62dffe537867f719b586b2f9bc4a6f08643ca945","amp;dn":"Andy+-+Siri+for+Android+%28Full%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"62dffe537867f719b586b2f9bc4a6f08643ca945","infoHashBuffer":{"type":"Buffer","data":[98,223,254,83,120,103,247,25,181,134,178,249,188,74,111,8,100,60,169,69]},"announce":[],"urlList":[]}}