{"title":"BATTLESHIP XVID CAM GLOBE","uid":7190582,"size":1326329334,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:63f6267abb8d9c66b3784dcbda866cf4c2b4f8fc&amp;dn=BATTLESHIP+XVID+CAM+GLOBE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"globeplus","files":-1,"time":1334604199,"description":"* XVID CAM  * 02H00M06S    * + 1300 Bitrate    * Worked with the Dub plugins\n\n\n* FILE INFO :\n\n\n- Black borders at the top and the bottom in full screen corrected\n\n- particles on the picture background reduced to the minimum\n\n- colours improved\n\n\n* Plot :\n\nIn 2005, NASA discovers an extrasolar planet with conditions similar to Earth. On the chance that it contains intelligent life, NASA transmits a powerful signal from a communications array based in Hawaii.\n\nIn the Hawaiian Islands, an international naval fleet at Pearl Harbor engages in a dynamic and intense battle against an alien species known as &quot;The Regents&quot;. The aliens come to planet Earth on a mission to build a power source in the ocean. Upon their visit, they come in contact with the naval fleet.\n\nAlex Hopper is a talented but undisciplined slacker. His brother Stone, a naval Commander, forces Hopper to join the Navy. Hopper becomes a lieutenant on the USS John Paul Jones DDG-53, sister-ship to his brother's command, the USS Sampson DDG-102. Hopper also falls in love with Admiral Shane's daughter, Samantha, and wants to marry her, but is afraid of asking her father's permission, as he doesn't like Hopper. During the RIMPAC opening ceremony, Hopper gets into a brawl with Captain Nagata of the Japanese Maritime Self Defense Force, In charge of JDS Myoko DDG-175. Hopper soon learns that he is to be kicked out of the Navy at the end of RIMPAC. Meanwhile, Samantha accompanies an Army veteran amputee Mick Canales on a hike on Oahu in order to help him adapt to his prosthetic legs.\n\n\n\n\n\n\n\n* enjoy ...\n\n\n\n\n\n\n\n\n\n* GLOBE FILES 2012\n","torrent":{"xt":"urn:btih:63f6267abb8d9c66b3784dcbda866cf4c2b4f8fc","amp;dn":"BATTLESHIP+XVID+CAM+GLOBE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"63f6267abb8d9c66b3784dcbda866cf4c2b4f8fc","infoHashBuffer":{"type":"Buffer","data":[99,246,38,122,187,141,156,102,179,120,77,203,218,134,108,244,194,180,248,252]},"announce":[],"urlList":[]}}