{"title":"Stacking-SKIDROW","uid":7087451,"size":1523504088,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:66508c12b5734ecb378e471f242ff66d7394a9b0&amp;dn=Stacking-SKIDROW&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":".Dude.","files":39,"time":1331238348,"description":"S  K  I  D  R  O  W\n.the leading force.\n\nproudly presents\nStacking(c) Double Fine Productions\n\n08-03-2012....Release Date - Protection...................Steam\nAdventure........Game Type - Disk(s)......................1 DVD\n\nRELEASE NOTES\n\nFrom Tim Schafer's Double Fine Productions, explore a vintage world\ninhabited by living Russian stacking dolls as you jump into more than\n100 unique dolls and use their special abilities to solve a wide\nvariety of puzzles &amp; challenges. Play as Charlie Blackmore, the world's\ntiniest Russian stacking doll, and embark on an adventure to rescue\nCharlie's family from the nefarious industrialist known only as the\n&quot;Baron.&quot; This imaginative 3rd person puzzle adventure game will take\nyou on a journey from a bustling Royal Train Station to a high-flying\nZeppelin as you collect unique dolls and matched stacking sets to\ndisplay in Charlie's secret hideout, where you chronicle your\nadventures.\n\nContinue the Stacking adventure with The Lost Hobo King DLC pack,\nincluded free in the PC version\n\nIn the Lost Hobo King, the first downloadable expansion for Double\nFine's Stacking, players once again assume the role of Charlie\nBlackmore, the world's smallest Russian stacking doll. Charlie travels\nwith his hobo friend Levi to the mysterious kingdom of Camelfoot, the\nmythical resting place of lost hobo king and his crown. Charlie must\nhelp Levi's uncle, Rufus Ryken, reclaim his rightful throne by solving\nthree tests of valor and reawakening the hobo blacksmiths of old. Only\nthen can the crown be reforged, enabling Rufus to become king and unite\nthe fractured hobo people under one sardine. The Lost Hobo King\nfeatures a complete adventure with several new challenges, each with\nmultiple solutions, an all new assortment of unique dolls with engaging\nabilities, and a new round of hi-jinks to discover and make trouble\nwith. Only the worthy can reclaim the crown of Camelfoot\n\nFeatures an all new concept art browser exclusive to the PC version\n\nINSTALL NOTES\n\n1. Unpack the release\n2. Mount or burn image\n3. Install\n4. Copy everything from the SKIDROW folder into the game installation\n5. Play the game\n6. Support the companies, which software you actually enjoy\n\n\n\nSystem Requirements\nOS:Windows 7\nProcessor:Intel Core 2 Duo at 2.2 GHz, or AMD Athlon 64 at 2.2 GHz\nMemory:2 GB RAM\nGraphics:1GB NVidia 200+, ATI 4500+\nDirectXÂ®:9.0c\nHard Drive:1500 MB HD space\nSoundirectX Compatible Sound Card","torrent":{"xt":"urn:btih:66508c12b5734ecb378e471f242ff66d7394a9b0","amp;dn":"Stacking-SKIDROW","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"66508c12b5734ecb378e471f242ff66d7394a9b0","infoHashBuffer":{"type":"Buffer","data":[102,80,140,18,181,115,78,203,55,142,71,31,36,47,246,109,115,148,169,176]},"announce":[],"urlList":[]}}