{"title":"TinyNT v1.1 - A lightweight Windows boot CD","uid":7157734,"size":115094410,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:669c51d5be62a252450b05ab604cc7b9a773c8bd&amp;dn=TinyNT+v1.1+-+A+lightweight+Windows+boot+CD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"LocalChum","files":2,"time":1333499612,"description":"TinyNT is a very compact general-purpose Windows environment that can be used to browse the web without a trace on the host machine or to repair your Windows installation in the event of system failure. TinyNT, derived from Windows PE 3.1, is not designed to be used as a full-powered operating system. Instead, it is designed to be used as a system restoration or repair utility, and optionally for other tasks that require a lightweight and portable Windows environment. Note that any changes made to the Windows environment or the X: drive do not persist after shutdown.\n\nNew to version 1.1: The base image was made smaller by removing or compressing unneeded DLLs. More utilities were also added to the CD image.\n\nApplications included on the CD in 7-Zip packages that you can extract to the RAM disk at runtime:\n\n- QtWeb: A simple lightweight web browser.\n- Sysinternals Autoruns: A startup program viewer/editor that can help to remove viruses that load on startup from your machine.\n- NirSoft BlueScreenView: A lightweight crash dump viewer that can help to diagnose the cause of BSODs on your machine.\n- Microsoft ImageX: The official Microsoft hard drive imaging utility that can be used to create and restore disk images from .WIM files.\n- NetUse.exe: My own utility that can be used to map network shares as a replacement for NET.EXE. Type &quot;NetUse.exe ?&quot; at a command prompt for details on how to use this utility.\n- NTPWEdit: A password editor for Windows NT that can easily change your user account's password in the event that you forget it.\n- Remote Desktop Connection: The standard remote desktop client found in Windows that can be used to connect to a remote server.\n- Sysinternals Process Explorer: An advanced process management utility for Windows.\n- UPX (Ultimate Packer for eXecutables): An executable packer for Windows that provides an excellect compression ratio.\n\nThird-party applications built into the TinyNT image that you can run from any command prompt:\n\n- 7-Zip: A file archiving utility that provides an excellent compression ratio. The GUI version of this program can be run from the command line with the command &quot;7zFM.exe&quot;, while the command-line version can be ran with the command &quot;7z.exe&quot;.\n- NirSoft NirCmd: A very compact and versatile shell scripting utility that essentially combines almost all of the functionality from normal Windows command line utilities into one.\n\nNote: Not all standard command line tools like SC.EXE are included in Windows PE. Except for NET.EXE, none of these command-line programs were removed from the image.\n\nMinimum system requirements to run TinyNT:\n\n- 256MB RAM\n- 600MHz processor\n- A monitor a resolution of at least 800x600 (TinyNT supports 640x480, 800x600, 1024x768, 1152x864, 1280x768, and 1600x1200)\n- A broadband internet connection to take advantage of networking support (not all network adapters are supported; also note that TinyNT cannot connect to wireless networks)\n\nSeeding would be appreciated. ;)","torrent":{"xt":"urn:btih:669c51d5be62a252450b05ab604cc7b9a773c8bd","amp;dn":"TinyNT+v1.1+-+A+lightweight+Windows+boot+CD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"669c51d5be62a252450b05ab604cc7b9a773c8bd","infoHashBuffer":{"type":"Buffer","data":[102,156,81,213,190,98,162,82,69,11,5,171,96,76,199,185,167,115,200,189]},"announce":[],"urlList":[]}}