{"title":"4Media Windows Mobile Ringtone Maker","uid":7162368,"size":15119679,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:67e6dc3759cbb57a47662abf4eadf442b8e6ea2a&amp;dn=4Media+Windows+Mobile+Ringtone+Maker&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"proffcom","files":-1,"time":1333657777,"description":"4Media Windows Mobile Ringtone Maker is your best choice to create your own ringtone and upload it to Windows Mobile device directly. This Windows Mobile ringtone maker helps you custom your own MP3 ringtone from various multimedia files like AVI, MPEG, WMV, DivX, MP4, H.264/AVC, AVCHD, MKV, RM, MOV, XviD, 3GP, WMA, WAV, RA, M4A, as well as upload it to your Windows Mobile device directly as you please. Supporting multiple audio formats like WMA, WAV, RA, M4A, AAC, AC3, OGG, etc., 4Media Windows Mobile Ringtone Maker makes it simple to convert any audio in your music library to MP3 ringtone.\n\nFeatures:\n1. Just want a music part as your ringtone? This Windows Mobile Ringtone editor provides a smart trim tool to help you get the wanted part and convert it to MP3 ringtone.\n2. With a built-in music player in this Windows Mobile ringtone maker, you can pre-listen the source music to make sure whether its what you want before creating MP3 ringtone.\n3. With simple operation, a wide range of supported formats and intuitive interface in 4Media Windows Mobile Ringtone Maker, creating your own ringtone becomes drop dead easy. All you have to do is just to add file and convert!\n4. 4Media Windows Mobile Ringtone Maker provides English, German, Japanese and Chinese interface languages for different mother-tongue use.","torrent":{"xt":"urn:btih:67e6dc3759cbb57a47662abf4eadf442b8e6ea2a","amp;dn":"4Media+Windows+Mobile+Ringtone+Maker","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"67e6dc3759cbb57a47662abf4eadf442b8e6ea2a","infoHashBuffer":{"type":"Buffer","data":[103,230,220,55,89,203,181,122,71,102,42,191,78,173,244,66,184,230,234,42]},"announce":[],"urlList":[]}}