{"title":"Fast Five","uid":7114124,"size":457020136,"categoryP":"games","categoryS":"mac","magnet":"?xt=urn:btih:68577c6e925f07010262f4e3b9835778f30da9c9&amp;dn=Fast+Five&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"WinterGale","files":1,"time":1332166113,"description":"The explosive franchise built on speed is back with Fast Five, and this model comes fully loaded! Play as Brian O'Conner on the wrong side of the law and assemble an elite team of top racers. Get behind the wheel of your dream car to battle opponents in the ultimate high-stakes racing game that follows the movie storyline.\n\nTHE OFFICIAL GAME OF THE MOVIE\n- Escape hard-nosed federal agent Luke Hobbs by tearing up the streets of Rio de Janeiro, the Dominican Republic, Hong Kong and more! \n- Get behind the wheel of famous cars from the film, including the latest Dodge Challenger 2011 and Dodge Charger 2011\n\nTHE MOST SPECTACULAR RACING EXPERIENCE\n- Discover the unbelievable Rewind Time feature and get a second chance at taking a nasty corner or avoiding a pile-up.\n- Devastating events during the races: elements of the environment will collapse or explode, changing the track and creating new obstacles!\n- Impressive realization with fluid animation - even during high-speed boosts - and real-time reflection of the roadside on your car.\n\nDOMINATE THE UNDERGROUND STREET RACING SCENE\n- Intense Multiplayer mode: share the action with your friends or go online in races for up to 10 players!\n- Tune and customize your vehicle with tons of options like decals, rims, boosts and much more! \n- Hours of high-speed driving entertainment with racing events ranging from Drift Contests to Survivor Mode\n\n-------------------------------------------------------------------------------------\n\nThis game is not supported by iMac and MacBook Pro devices equipped with the following video cards:\nRadeon X1600\nIntel GMA 950.","torrent":{"xt":"urn:btih:68577c6e925f07010262f4e3b9835778f30da9c9","amp;dn":"Fast+Five","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"68577c6e925f07010262f4e3b9835778f30da9c9","infoHashBuffer":{"type":"Buffer","data":[104,87,124,110,146,95,7,1,2,98,244,227,185,131,87,120,243,13,169,201]},"announce":[],"urlList":[]}}