{"title":"UrbanTerror v4.1","uid":7072063,"size":742991348,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:686a5c3e89211c59098e6150c5fb6f659b40e650&amp;dn=UrbanTerror+v4.1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"mdusanjay","files":1,"time":1330712144,"description":"on line komanndny shooter, such as counters strike. Two groups SWAT (SWAT) and Terrorists (Red Dragon) find out the relationship in the field. Features : Urban Terror has 7 game modes: Free For All (FFA) everyone plays for himself. The main goal is to accumulate frags. Team Deathmatch Team desmatch. The goal is to build a team total frags more than the opposing team before the expiration of the time. Team Survivor team survival. The purpose of the game the destruction of all the players of the opposing team at least one surviving player from his team. Capture the Flag (CTF) capture the flag. Capture and Hold (C &amp; H) the capture and retention. The team captures parts of the map and keeps them until they take over all areas. Follow the Leader (FTL) follow the leader.\nEach team on the ground spawn (or close to it) is the flag. The purpose of the team leader to touch the enemy flag. In the case of the death of the leader of a team must destroy all the other members of the team. Bomb mode (BM) laying a bomb in a certain place. One team has to plant the bomb, and not to let the other team defused it before its explosion. Completely identical to a similar mode in Counter Strike. All modes except Free For All, are commanding. Players are divided into two teams the blue and red. Their names are defined by configuring the server, but the default commands are called Red Dragons (red), and SWAT (blue). In the Bomb Mode red lay a bomb, and blue neutralize it. When connecting to the server a player chooses which team will play, or may be required to join the team automatically. In this case, he joins a team that has less players. If players of both teams the same number, a new player joins the losing of frags / team rounds. game ends after the limit of frags / wins round in the team / player, or at the end of playing time limit (depending on server settings).\n\nSystem requirements :\nPentium III 500 MHz / Duron 600MHz,\n256MB RAM,, , 32MB VRAM ,\n1GB free disk space on the zhetskom ","torrent":{"xt":"urn:btih:686a5c3e89211c59098e6150c5fb6f659b40e650","amp;dn":"UrbanTerror+v4.1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"686a5c3e89211c59098e6150c5fb6f659b40e650","infoHashBuffer":{"type":"Buffer","data":[104,106,92,62,137,33,28,89,9,142,97,80,197,251,111,101,155,64,230,80]},"announce":[],"urlList":[]}}