{"title":"bin_win32_ultimate professional vers 1.0.zip","uid":7147602,"size":179572621,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:68bd2769332f0289f5c1c31ddd3c20e694926e59&amp;dn=bin_win32_ultimate+professional+vers+1.0.zip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"finnbat","files":1,"time":1333190741,"description":"THIS MOD IS FOR HARD LINE VETERANS ONLY !\n\n*** ULTIMATE AIM-PROFESSIONALS *** (vers 1.0)\n\n\nWhat you get: From tthe best modmakers we have with their kind permissions addons in weapons, clothes and many more nice features.\nThanks go to R@S, Wilson, Confus and Bullet Six (Blue Dawn team) and for Glitch who made the &quot;Real Soldier&quot; looking like soldiers.\n\nFinnBat (thatÂ´s me...) have made most of gameplay adjustments and new textures for tanks, trucks and menus.\nThe idea is to put you is bad situations, very bad. I say again; VERY BAD !\nAI behaviour is totally different that it is in vanilla version. They crawl and seek for cover. They flank, rush, sneal and wait.\nI hate them ! But this is what I want from a WARGAME !\n\nWhat is the mod: Totally new music in game from professional orchestra, the music is under my license\nso you can use it when playing this mod.\n(attached in the music directory you find terms in .pdf file)\n\nNew opening screens, computer screen etc.\n\nAIM-Mercs are a professional team and the company has made very well money in the past years and fields.\nThey send the members well dressed to missions and there are snipers, assaulters, mech, demolition and medics.\n\nItems in the game (first-aid kits and weapon kits...etc.) all work much longer and more realistic.\n\nBobby Ray is more professional and supply you much better.\n\nThere are really much more enemy on the field now.\nAnd worst (or best...) is that they are really bad-ass professionals now. All caution have to taken care or... you die fast !\nEnemy soldier can/and must now be looted. You must learn to live from the earth.\nUse their weapons against themself and conquer. Ignore it and loose.\n\nYou will be helped much more by the merchants. They have now more to sell to you and they buy more from you.\n\nWhat else is new ? You have to find it by yourself... go and get them !\n\n\n\nInstallation: The zip file is to be zipped to SteamsteamappscommonJaBia main folder.\nIt will make there a folder called &quot;bin_win32&quot; that is the main mod directory.\n","torrent":{"xt":"urn:btih:68bd2769332f0289f5c1c31ddd3c20e694926e59","amp;dn":"bin_win32_ultimate+professional+vers+1.0.zip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"68bd2769332f0289f5c1c31ddd3c20e694926e59","infoHashBuffer":{"type":"Buffer","data":[104,189,39,105,51,47,2,137,245,193,195,29,221,60,32,230,148,146,110,89]},"announce":[],"urlList":[]}}