{"title":"Roseanne's Nuts (2011)","uid":7254011,"size":2844347078,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:699f4d2bcf4511089e7f14c6547c2829cea39b60&amp;dn=Roseanne%27s+Nuts+%282011%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"DScracka7","files":-1,"time":1336531289,"description":"Roseanne's Nuts is a Lifetime reality show/docudrama that aired from July 13, 2011, to September 16, 2011. It featured Roseanne Barr, her partner Johnny Argent and son Jake Pentland as they live on their macadamia nut and livestock farm in Hawaii. Celebrity guests included: Bonnie Bramlett, Michael Fishman, Phyllis Diller and Sandra Bernhard.\n\n01 War of the Pigs  - Feral pigs threaten the farm by eating Roseanne Barr's crops and nuts which prompts her to hire hunters to kill them. However, once a pig is captured Barr decides that she can not allow it to be killed and sets it free. \n02 The Curse - Barr feels she has a curse which is to blame for her 'out-of-control temper' and visits her friend Cathy Bilsky, a local spiritual healer. Even though it seems to help Barr's anger, she determines that being calm is boring for her. Tired of the constant cameras, she screams for the camera men to leave her house and to come back another day. \n03 Star Spangled Banner - With the help of Bonnie Bramlett, Barr sings 'The Star-Spangled Banner' at a local softball game. The last time she sang the national anthem in 1990 it was off-key and heavily criticized so she hopes this redemption will make amends to the people she offended. \n04 Life's a Snore - In order to stop snoring and being encouraged by boyfriend Johnny Argent and son Jake Pentland, Barr has a sleep study done. She is found to have sleep apnea and must wear a C-PAP to sleep. Meanwhile on the farm, the chickens are not laying eggs; Pentland and Archie add a new fence to protect them against mongooses but they find one chicken named Henrietta dead and bury it. \n05 The Museum Blessing - Barr calls a Shaman to bless her haunted historic museum. \n06 Mother's Day - While Barr is out taking surfing lessons with Cipes, Argent and Pentland clean the house for Mother's Day much to Barr's surprise. \n07 Passover - Barr cooks a Passover meal with the vegetables from her garden for her friends and family. Michael Fishman guest stars. \n08 Grannies Night Out - Phyllis Diller, Sandra Bernhard and Barr enjoy a girl's night out but Roseanne wakes up with a hangover. \n09 Food Truck - Barr donates a truck full with vegetables from her farm to the needy. \n10 Weed is Wack - Barr anxiously travels to Los Angeles where she visits a doctor who can potentially help her obtain a medical marijuana license in Hawaii. \n11 Grrrl Power - Barr visits a local high school to give a speech to young girls. \n12 Homecoming Parade - Barr attends the Utah Pride festival. \n13 Camping - Barr and her family go camping. \n14 Homeschooling  - Barr attempts to home school her grandchildren with disastrous results. \n15 Menopause for Dummies - Barr struggles to rekindle her and Johnny's sex life when she suffers from menopause pains. \n16 Lu'au Launch Party - Series finale. Barr finally breaks into the market with her macadamia nuts. Friends and family celebrate with a Luau. \n\nall credit to CRiMSON","torrent":{"xt":"urn:btih:699f4d2bcf4511089e7f14c6547c2829cea39b60","amp;dn":"Roseanne%27s+Nuts+%282011%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"699f4d2bcf4511089e7f14c6547c2829cea39b60","infoHashBuffer":{"type":"Buffer","data":[105,159,77,43,207,69,17,8,158,127,20,198,84,124,40,41,206,163,155,96]},"announce":[],"urlList":[]}}