{"title":"Jennifer's Body Unrated 2009","uid":7188087,"size":4681461760,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:6b731a7de9272b58153fa1b70c81094a196e5367&amp;dn=Jennifer%27s+Body+Unrated+2009&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"tom2211","files":-1,"time":1334517465,"description":"AC-3, Color, Dolby, Dubbed, NTSC 102 minutes  Theatrical Widescreen Feature Film\nExtended Widescreen Unrated Version\n\nForced Trailers: Gentlemen Broncos, All About Steve, Whip It, Fame\n\nAudio Commentary with Director Karyn Kusama and Writer Diablo Cody (Theatrical Version Only)\nAudio Commentary with Director Karyn Kusama (Extended Version Only)\n\nTrailer Farm: 500 Days of Summer, Family Guy: Something Something Something Dark Side, Feed You Fear, Wrong Turn 3  There's always a good girl and a bad girl in a movie like Jennifer's Body--but in this case the good girl is crazy and the bad girl is way, way evil. At least somebody thinks good girl Needy (Amanda Seyfried, from Mamma Mia!) is crazy: when the movie begins she's narrating from a psychiatric hospital, and the rest of the film is a flashback that explains her incarceration. It's all connected to longtime friend Jennifer (Megan Fox), a saucy high-school temptress, who mysteriously survives a horrific night out and transforms into a supernaturally powerful force with a taste for human blood. There's certainly some genre kick to this stuff, almost none of which is played straight--how could it be, with Oscar-winning screenwriter Diablo Cody penning the script? Yes, all those crackly, slang-peppered one-liners you loved (or hated) in Cody's Juno are back, with a vengeance. There's actually something more honest about the nastiness of the dialogue in Jennifer's Body, which at least doesn't try to corkscrew back into the heartwarming ambitions of Juno. Among the targets of Cody's satire are Needy's nice-guy beau (Johnny Simmons), a one-armed toupeed teacher (J.K. Simmons), and a satanic rock singer (Adam Brody). The raging hormones and bodily changes of teendom have always lent themselves to metaphorical usefulness in horror movies, but Cody doesn't ring many new changes on the device, beyond the brutal hilarity of her dialogue. That leaves us with showroom-ready Megan Fox, whose buffed sheen is just right for her soulless character","torrent":{"xt":"urn:btih:6b731a7de9272b58153fa1b70c81094a196e5367","amp;dn":"Jennifer%27s+Body+Unrated+2009","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6b731a7de9272b58153fa1b70c81094a196e5367","infoHashBuffer":{"type":"Buffer","data":[107,115,26,125,233,39,43,88,21,63,161,183,12,129,9,74,25,110,83,103]},"announce":[],"urlList":[]}}