{"title":"Command &amp; Conquer: Red Alert: A Path Beyond [Gamma] [2.1.1]","uid":7121426,"size":731538365,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:6c0da0afd489de4b3810d743a46b8c892f544ea6&amp;dn=Command+%26amp%3B+Conquer%3A+Red+Alert%3A+A+Path+Beyond+%5BGamma%5D+%5B2.1.1%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Sonarpulse","files":-1,"time":1332382414,"description":"Well, it's about darn time. Red Alert: A Path Beyond version 2.1.1 is ready to rock, the servers are being updated, and mirrors are being prepared! There are a lot of changes in this one, far more than originally planned, including support for Eyefinity and ultra-widescreen, the new Heavy and Light tanks, revised tech levels and balancing, and updates to maps. Oh, and tons of performance boosts across every facet of the game, a blessing for those with less powerful computers (those of you who have better systems can now enjoy native 16x anisotropic filtering and high-quality FXAA to rid yourselves of jaggies).\n\n---------------------------------\nRed Alert: A Path Beyond Readme\n[Excerpts, not everything would fit]\n---------------------------------\n\n---\n1.  IMPORTANT!\n---\nIn order to play Red Alert: A Path Beyond, you should run the &quot;Red Alert - A Path Beyond Launcher&quot; \n\ntool from the Start Menu (or, if you didn't install Start Menu shortcuts, you should run \n\napblauncher.exe in the main folder of the game).  There, you can adjust game options and browse for \n\nservers, as well as view the manual and latest news about the game.  The desktop icon, if you chose \n\nto install it, will also run the launcher.\n\n----\n4.  PERFORMANCE TWEAKS/GRAPHICAL ISSUES\n----\nIf you are having performance issues, you can turn off shader options individually\nor completely by using the &quot;options&quot; in the launcher utility.  Shader effects are present in the \n\nSpecial Effects\npane of the utility.  If you are having strange graphical issues, try checking the &quot;Force\nSM2 Shaders on SM3 cards&quot; option, which will switch to an older algorithm for shaders which\nmay be more compatible with your card.  If you notice that you have severe issues when looking at\ncloaked units, uncheck &quot;Enable Refraction Effects&quot;.  If you are having performance issues in\ngeneral, uncheck &quot;Shaders Enabled&quot; which will enable all shader and post-processing effects.\nThis typically boosts performance by a large amount, but at the cost of graphical quality.\nHigh-quality shadows shouldn't need to be disabled except on very old computers that barely\nmeet the minimum requirements.  If performance issues still persist, try adjusting the\ngeometry and texture detail.\n\nYou can find out more in the General Discussion portion of our forum at \n &lt;a href=&quot;\nhttp://www.apathbeyond.com/forum&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.apathbeyond.com/forum&lt;/a&gt;\n\n---\n5.  CONTACT INFO\n---\nQuestions?  Comments?  Log on to http://www.apathbeyond.com/forum and sign up for an account!  We \n\ncan always use new members, and are (generally) a pretty friendly bunch. Be sure to NOT ask us to \n\ndelete your account when you sign up.","torrent":{"xt":"urn:btih:6c0da0afd489de4b3810d743a46b8c892f544ea6","amp;dn":"Command+%26amp%3B+Conquer%3A+Red+Alert%3A+A+Path+Beyond+%5BGamma%5D+%5B2.1.1%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6c0da0afd489de4b3810d743a46b8c892f544ea6","infoHashBuffer":{"type":"Buffer","data":[108,13,160,175,212,137,222,75,56,16,215,67,164,107,140,137,47,84,78,166]},"announce":[],"urlList":[]}}