{"title":"Trailer 2012 Jasson Statham Movie","uid":7044009,"size":38420241,"categoryP":"video","categoryS":"movie_clips","magnet":"?xt=urn:btih:73235faf8955ceea4275d6239faef1296ac08123&amp;dn=Trailer+2012+Jasson+Statham+Movie&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"ogamirei","files":1,"time":1329661825,"description":"SAFE Trailer 2012 - Official movie trailer in HD - starring Jason Statham, Anson Mount and Chris Sarandon - directed by Boaz Yakin - a former and hardened elite agent (Jason Statham) takes on a mission: rescue a Chinese girl who's been abducted by the Triads...\n\nSAFE movie hits theaters on April 27, 2012.\n\nA second-rate cage fighter on the mixed martial arts circuit, Luke Wright blows a rigged fight and the Russian Mafia murders his family and banishes him from his life forever. When he witnesses a frightened twelve-year-old Chinese girl, Mei, being pursued by the same gangsters who killed his wife, Luke impulsively jumps to action...and straight into the heart of a deadly high-stakes war. Mei, he discovers, is no ordinary girl, but an orphaned math prodigy forced to work for the Triads as a &quot;counter.&quot; Luke tears a swath through the city's brutal underworld to save an innocent girl's life...and perhaps even redeem his own. Lionsgate and IM Global present in association with Automatik a Lawrence Bender production in association with Trigger Street Productions and 87Eleven, Inc. Safe movie trailer 2012 is presented in full HD 1080p high resolution. \n\nSAFE 2012 Movie\nWritten &amp; Directed By: Boaz Yakin\nStarring: Jason Statham, Robert John Burke, Chris Sarandon, Anson Mount, James Hong, Reggie Lee, SÃƒÂ¡ndor TÃƒÂ©csy, Joseph Sikora, Danny Hoch, Matt O'Toole, Catherine Chan\nProduced By: Lawrence Bender, Dana Brunetti\n\nSAFE official movie trailer courtesy Lionsgate.\n\nCieon Movies is your daily dose of &quot;everything movies&quot;, a mainstream channel with wider coverage from G-rated to R-rated movies and includes both theatrical and DVD releases, with an extended selection of officially licensed movie trailers and movie clips.\n\nTags: &quot;safe trailer&quot; safe trailer 2012 jason statham &quot;jason statham&quot; official hd movie 2011 &quot;safe trailer 2012&quot; &quot;safe trailer 2011&quot; &quot;safe trailer jason statham&quot; &quot;safe trailer jason&quot; &quot;safe trailer statham&quot; &quot;safe trailer official&quot; &quot;safe 2012&quot; &quot;robert john burke&quot; &quot;boaz yakin&quot; &quot;anson mount&quot; &quot;chris sarandon&quot; robert john burke boaz yakin anson mount chris sarandon movies trailers film films today this week month year new &quot;official trailer&quot; &quot;movie trailer&quot; &quot;film trailer&quot; &quot;trailer 2012&quot;","torrent":{"xt":"urn:btih:73235faf8955ceea4275d6239faef1296ac08123","amp;dn":"Trailer+2012+Jasson+Statham+Movie","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"73235faf8955ceea4275d6239faef1296ac08123","infoHashBuffer":{"type":"Buffer","data":[115,35,95,175,137,85,206,234,66,117,214,35,159,174,241,41,106,192,129,35]},"announce":[],"urlList":[]}}