{"title":"Botanicula Air Wrapper for Linux","uid":7205834,"size":37622404,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:7519cdd8c9452bbb65553ed3e48f9ecebf63e571&amp;dn=Botanicula+Air+Wrapper+for+Linux&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"etpirateb","files":1,"time":1335090083,"description":"I had some problems running the &quot;Humble Bundle&quot; Linux version of Botanicula, especially regarding the installation of &quot;Adobe Air&quot;, which no longer supports Linux. Managed to run it, and thought to share the way in which I made it work.\n\n&gt;&gt;&gt;This torrent DOES NOT contain Botanicula. You will need to add it yourself.&lt;&lt;&lt;\n\nWhat it does contain is the most recent Linux version of Adobe Air and a bash script to unpack and launch Botanicula. \n\n&gt;What to do:&lt;\n(You should have unzip installed, but most modern distributions do have it.)\nPaste in the zip found in the &quot;Humble Bundle&quot; Linux version of Botanicula (botanicula-linux-&lt;someNumbers&gt;.zip), or paste the Botanicula.air file found in that zip file, if you already extracted that.\nRun start.sh, either by double-clicking, or by launching it in a terminal (&quot;cd&quot; to where you extracted it and &quot;./start.sh&quot; or &quot;sh ./start.sh&quot;). Errors will only be visible in a terminal.\n\nAt no point in time will the script or Adobe Air require root privileges.\n\n\n&gt;How it works:&lt;\nThe script will try to run Botanicula from the &quot;Botanicula&quot; directory - if that fails, it will look for &quot;Botanicula.air&quot;, unpack that into the &quot;Botanicula&quot; directory, and run it. If *that* fails, it will look for a zip file starting with botanicula-linux (such as the zip file provided by Humble Bundle), extract it, then extract the (hopefully there) Botanicula.air, which it will delete after extraction. It will thus leave only the file you pasted in yourself and the Botanicula directory.","torrent":{"xt":"urn:btih:7519cdd8c9452bbb65553ed3e48f9ecebf63e571","amp;dn":"Botanicula+Air+Wrapper+for+Linux","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7519cdd8c9452bbb65553ed3e48f9ecebf63e571","infoHashBuffer":{"type":"Buffer","data":[117,25,205,216,201,69,43,187,101,85,62,211,228,143,158,206,191,99,229,113]},"announce":[],"urlList":[]}}