{"title":"Cannabis Collection - BBC Horizon - Is Alcohol Worse than Ecstas","uid":7325846,"size":2825357312,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:7785a5955f644a4a68b7beda78123de27bf0045a&amp;dn=Cannabis+Collection+-+BBC+Horizon+-+Is+Alcohol+Worse+than+Ecstas&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"GRNS3","files":-1,"time":1338750711,"description":"\n\nThe Cannabis Collection - a series of educative and entertaining info dvd's\n\nPlease enjoy, share with friends and seed :\n\n\nBBC Horizon - Is ALcohol worse than Ecstacy\n\n\nRecent research has analysed the link between the harmful effects of drugs relative to their current classification by law with some startling conclusions. Perhaps most startling of all is that alcohol, solvents and tobacco (all unclassified drugs) are rated more dangerous than ecstasy, 4-MTA and LSD (all class A drugs). If the current ABC system is retained, alcohol would be rated a class A drug and tobacco class B.\n\nThe scientists involved, including members of the government's top advisory committee on drug classification, have produced a rigorous assessment of the social and individual harm caused by 20 of the UK's most dangerous drugs and believe this should form the basis of future ranking. They think the current ABC system is arbitrary and not based on any scientific evidence.\n\nThe drug policies have remained unchanged over the last 40 years so should they be reformed in the light of new research? \n\n\nCheck this account for updates regularly :)\n","torrent":{"xt":"urn:btih:7785a5955f644a4a68b7beda78123de27bf0045a","amp;dn":"Cannabis+Collection+-+BBC+Horizon+-+Is+Alcohol+Worse+than+Ecstas","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7785a5955f644a4a68b7beda78123de27bf0045a","infoHashBuffer":{"type":"Buffer","data":[119,133,165,149,95,100,74,74,104,183,190,218,120,18,61,226,123,240,4,90]},"announce":[],"urlList":[]}}