{"title":"ftvgirls.com.2012-02.Mia.XXX.[GoldenPirates]","uid":7051350,"size":6871191226,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:7823995bad78a5547ab602808d1d5f61915307b2&amp;dn=ftvgirls.com.2012-02.Mia.XXX.%5BGoldenPirates%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"GoldenPirates","files":-1,"time":1329968118,"description":"Another torrent from goldenpirates.org\n\nno viruses, no shit, no Bullshit, just pure PORN!\n\nSite:                    &lt;a href=&quot;\nhttp://www.ftvgirls.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.ftvgirls.com&lt;/a&gt;\n\nTeam:                     &lt;a href=&quot;\nhttp://goldenpirates.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://goldenpirates.org&lt;/a&gt;\n\nUploader/Ripper: goldenPirates\n\n\nMore Golden releases here:                    &lt;a href=&quot;\nhttp://thepiratebay.se/user/Goldenpirates&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/Goldenpirates&lt;/a&gt;\nand here:                    &lt;a href=&quot;\nhttp://blog.goldenpirates.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://blog.goldenpirates.org/&lt;/a&gt;\n\nEnjoy! \n\nThis torrent contains two videos, (split into several files), and seven photosets.  \n\nPreviews and screenshots:\n &lt;a href=&quot;\nhttp://media.goldenpirates.org/go.php?8xj8b35lvmrmatzrq1c69l73b0y6&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://media.goldenpirates.org/go.php?8xj8b35lvmrmatzrq1c69l73b0y6&lt;/a&gt;  cover &lt;a href=&quot;\nhttp://media.goldenpirates.org/go.php?lmmvxdj2pugcrsf7mq5qmsdm2moz&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://media.goldenpirates.org/go.php?lmmvxdj2pugcrsf7mq5qmsdm2moz&lt;/a&gt;  face &lt;a href=&quot;\nhttp://media.goldenpirates.org/go.php?89g66m3rqyndi08yibowt3gzhu5&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://media.goldenpirates.org/go.php?89g66m3rqyndi08yibowt3gzhu5&lt;/a&gt;   face/breasts &lt;a href=&quot;\nhttp://media.goldenpirates.org/go.php?123c2ydvtlrx4bcp4lfh29t285uk&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://media.goldenpirates.org/go.php?123c2ydvtlrx4bcp4lfh29t285uk&lt;/a&gt;  vagina &lt;a href=&quot;\nhttp://media.goldenpirates.org/go.php?ekyash6ro2dhx3mg891vq3wv01&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://media.goldenpirates.org/go.php?ekyash6ro2dhx3mg891vq3wv01&lt;/a&gt;    standing &lt;a href=&quot;\nhttp://media.goldenpirates.org/go.php?rznu1w3byqmfjiffiofbkhrxy&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://media.goldenpirates.org/go.php?rznu1w3byqmfjiffiofbkhrxy&lt;/a&gt;     ass &lt;a href=&quot;\nhttp://media.goldenpirates.org/go.php?avi6i8nyjn009gye0j8t76wncjj&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://media.goldenpirates.org/go.php?avi6i8nyjn009gye0j8t76wncjj&lt;/a&gt;   vid 1 screens &lt;a href=&quot;\nhttp://media.goldenpirates.org/go.php?gygx176fonw26soydmicwops7cn&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://media.goldenpirates.org/go.php?gygx176fonw26soydmicwops7cn&lt;/a&gt;   vid 1 storyboard &lt;a href=&quot;\nhttp://media.goldenpirates.org/go.php?edp9ic97z2v6hxfbwawxv8esxm0&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://media.goldenpirates.org/go.php?edp9ic97z2v6hxfbwawxv8esxm0&lt;/a&gt;   vid 2 screens &lt;a href=&quot;\nhttp://media.goldenpirates.org/go.php?nxrnrun4gfql083mr24tqpayq5g1&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://media.goldenpirates.org/go.php?nxrnrun4gfql083mr24tqpayq5g1&lt;/a&gt;  vid 2 storyboard\n\nThe video screenshots and storyboards are for only one file of each video.  Screenshots and storyboards for all video files are in the torrent.\n\nVideo descriptions from website:\n\nModel Comments: I've had very strict parents all my life and very christian too.  I'm religious, but I don't see why I can't do porn.  My parents wouldn't even let me do regular modeling.  So when I turned 18 a few weeks ago I went out on my own from San Diego to my friends place and I've been staying there for now.  I'm not running away from home or anything I just need breathing room and to be away from my parents for a while.  Both my parents are norwegian but I was born here so I don't speak the language.  I just know english!  I didn't lose my virginity until much later because I intimidated guys with my height or maybe my breasts I don't know.  I wasn't the popular girl either and I wasn't in basketball or volleyball just because I'm tall.  I'm not all that coordinated!  I had to train myself to learn how to wear heels and walk properly and got most of my clothes from fashion modeling shoots.  I sent some to ftv when I emailed them to join the site.  I've always wanted to do nudes because it turns me on to be in naked photos.  So you might think I've had a lot of guys, but I've only been with one and that was my ex-boyfriend of 2 years.  I want to try new experiences now and I think I would love sex and masturbating.  The vibrators I've used before are not as strong as the one I used here and its a strange feeling having a vibrator orgasm.  Until today I've never experienced anything like it.  Its very pleasurable but its also almost too much for me.  Now looking back I guess the vibrators I used never really got me there and so this is really my first orgasm.  It made me very tingly all over and tired at the same time like my muscles were moving involuntarily the whole time.  I do like to dance and I would practice to music videos in my bedroom all the time.  I don't know if I'm good or not and I was very nervous about doing it in camera for all of you to see.  So I'm coming back next week for more shooting and I'll be bringing more clothes with me.\n\nVideographer/Photographer's Comments:  So Mia contacts me via email, with the following application photos:  #1 #2 #3 #4 #5 #6 #7.  Notice the various hair colors.  Not sure if I like the blonde or the brunette better, but both are supercute.  In many ways, I wish she had stayed to one of those colors, instead of this auburn style.   The blonde makes her innocent looking, and the brunette more sultry.  In the black &amp; white fashion photos she looks so much like a 50's actress but I can't remember her name...  Anyway, she arrives from the airport as you see her in clip one, and with no makeup at all.  She was very nervous about shooting without any makeup, but we like it naturally here, I told her not to worry.  Clip 4 onwards she did apply some light makeup to match the dressy.  She happened to travel here on Thanksgiving weekend, and with all the delays, ended up arriving 3 hours late!  So after seeing how cute and sweet she is, I made sure I bring her back next week.  Very new at masturbating, very innocent -- her experience with the Eroscillator toy brought her to a strong orgasm, but the way she uses it blocks the view of the orgasm.  However, on clip 3 you can see how her feet react to the orgasm and shudder at around 1:30.  We see her do a sexy dance -- man she has long legs!   Love those perfect breasts, more breast massage to come.  Clip 5 was a car video that didn't turn out, since I was rushed to finish that before the sun went down, with all the limited time I had that day.\n\nModel Comments: (written on previous page)\n\nVideographer/Photographer's Comments:  A week or so later, I brought her back to continue the shoot.  She's so cute, so sweet, such a nice figure, wanted to get as much shooting of her as possible before she ends up in the adult world.   Picking her up from the airport, the holidays caused a 2 hour delay of her plane but at least I had her stay over the night before so that it doesn't mess up our day the next day like it did the first one.  This time she brought makeup with her, and decided to change her hair to curly.  Totally gorgeous with makeup!  She claims that she wishes she had curly hair, I think straight is fine.   Girls always want what they don't have haha.  We do a little wakeup and dressup scene, then head out to a sassy mall.  Her short dress gets stares from people, but it also is great for upskirt views.  In no time the security was on to us, so we headed out (but not before I was able to gets some really cute stuff).  She then masturbates alone on the counter, using a different vibrator, that seems to get her off, but I cannot tell through the video where the contractions happened (some of you might be more discerning).  Then its all about extreme closeups and gaping of her very pretty vagina.  Breast massage, and views of her gorgeous eyes &amp; face (love her hair up) and her putting on her prom dress from high school.  Kinky for last, and she's never done anything like it before, but gets it in deeper over time.   So this update ends up being a lot larger than normal, but I simply couldn't have enough of this girl.  Hope you like her first time experiences here, before she moves on her way to more adult.  Oh, and this is a small lunch outtake video.  1/25/12 Update:  Looks like about a month after her first time shoots here, she entered hardcore adult under the name Molly Bennett.  Once she attended the AVN awards in January, she's exploded in popularity and should be appearing in hardcore porn by the time this update appears.","torrent":{"xt":"urn:btih:7823995bad78a5547ab602808d1d5f61915307b2","amp;dn":"ftvgirls.com.2012-02.Mia.XXX.%5BGoldenPirates%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7823995bad78a5547ab602808d1d5f61915307b2","infoHashBuffer":{"type":"Buffer","data":[120,35,153,91,173,120,165,84,122,182,2,128,141,29,95,97,145,83,7,178]},"announce":[],"urlList":[]}}