{"title":"Brute Force (1947) FULL DVD (ISO)","uid":7160733,"size":4509368366,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:78b601424d95b2f4c54d2f84af86affae6abbf58&amp;dn=Brute+Force+%281947%29+FULL+DVD+%28ISO%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Auge","files":-1,"time":1333603890,"description":"Brute Force (1947) FULL DVD (ISO)\n\nI am providing important films in ISO for the film buff or novice film historian. It is nearly impossible to find torrent files that include all the extras or even important commentaries. \n\nThis is a DVD rip to an ISO so you can watch it on your media player, mount it to a virtual drive or burn it to a DVD.\n\nThis file includes EVERYTHING the original DVD has:\n\n1947\n102 minutes \nBlack and white\n1.33:1\nSpoken Language: English\nSubtitles: English\n\n(DVD-5)\n\nDirector: \nJules Dassin\n\nCast: \nBurt Lancaster, Hume Cronyn, Yvonne De Carlo, Charles Bickford, Ann Blyth, Ella Raines, Anita Colby, Howard Duff\n\nAwards\nAFI\nTop 100 Thrills nominee \n\nDisc Features:\n*Audio commentary by film noir specialists Alain Silver and James Ursini\n*A new interview with Paul Mason, author of Capturing the Media: Prison Discourse in Popular Culture\n*Theatrical trailer\n*Stills gallery\n*Optional English subtitles for the deaf and hard of hearing\n\nSYNOPSIS:  \nAs hard-hitting as its title, Brute Force was the first of Jules Dassins forays into the crime genre, a prison melodrama that takes a critical look at American society as well. Burt Lancaster is the timeworn Joe Collins, who, along with his fellow inmates, lives under the heavy thumb of the sadistic, power-tripping guard Captain Munsey (a riveting Hume Cronyn). Only Collinss dreams of escape keep him going, but how can he possibly bust out of Munseys chains? Matter-of-fact and ferocious, Brute Force builds to an explosive climax that shows the lengths men will go to when fighting for their freedom.\n\n*** I upload my torrents to The Pirate Bay and Demonoid, if you would like to upload one of my torrent files to another tracker feel free, all I ask is that you upload the same torrent file you downloaded by clicking on one of my links so that more seeders/peers are in the swarm.  ***\n\n*** THE BEST WAY TO MESSAGE ME IS TO COMMENT ON MY LATEST UPLOAD, I AM GETTING TOO MANY UP THERE TO MONITOR ALL OF THEM. ***\n","torrent":{"xt":"urn:btih:78b601424d95b2f4c54d2f84af86affae6abbf58","amp;dn":"Brute+Force+%281947%29+FULL+DVD+%28ISO%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"78b601424d95b2f4c54d2f84af86affae6abbf58","infoHashBuffer":{"type":"Buffer","data":[120,182,1,66,77,149,178,244,197,77,47,132,175,134,175,250,230,171,191,88]},"announce":[],"urlList":[]}}