{"title":"The.LA.Complex.S01E02.Do.Something.720p.WEB-DL.DD5.1.H.264-ECI ","uid":7243386,"size":1493171001,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:78de3bebbc047566ff0189d92862917b2bf96f06&amp;dn=The.LA.Complex.S01E02.Do.Something.720p.WEB-DL.DD5.1.H.264-ECI+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"iamgreat","files":-1,"time":1336197923,"description":" MaxPayne-OV, you asked for the other episodes and here is one of them. \n\n\n\n                 The L.A. Complex | s01e02 | WEB-DL | Do Something\n\n\nThis episode was shown on Much Music on 17 January 2012 in Canada and 1 May 2012 on The CW in the USA. \n\n\nABOUT THE SERIES\nFrom the producers of Degrassi comes a new series full of new relationships, salacious temptations, and make-it-or-break it decisions. The L.A. Complex' coming-of-age dwellers grapple with life's defining moments as they deal with the unreality of the show-biz industry.\n\n\nIN THIS EPISODE\nA struggling Abby is given the chance to make some big cash as long as she's willing to &quot;play the part.&quot; Raquel decides she's not going to wait by the phone any longer and starts pushing to get a movie made where she can play the lead. Alicia's not having any luck with her dancing auditions so she takes a different approach by attending a party with a D-list actor (guest star Aaron Abrams &quot;Rookie Blue&quot;). Meanwhile, after presenting an impressive demo at the studio, Tariq is offered the chance to produce a track with the infamous rapper Kaldrick King. However, Tariq quickly realizes that this new role won't be easy.\n\n\nProduction is under-way on season 2, which might be branded as the back 13 of season 1 in the US. So there are 19 episodes committed to production, 6 of which have been broadcast in the north. No idea how many The CW will show given the spectacularly horrible ratings it has.","torrent":{"xt":"urn:btih:78de3bebbc047566ff0189d92862917b2bf96f06","amp;dn":"The.LA.Complex.S01E02.Do.Something.720p.WEB-DL.DD5.1.H.264-ECI+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"78de3bebbc047566ff0189d92862917b2bf96f06","infoHashBuffer":{"type":"Buffer","data":[120,222,59,235,188,4,117,102,255,1,137,217,40,98,145,123,43,249,111,6]},"announce":[],"urlList":[]}}