{"title":"Blue Pilots Project - Reboot","uid":7061586,"size":128889523,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:79d5f82bb2670ca89ce8fbc24d2f810e926dd2ac&amp;dn=Blue+Pilots+Project+-+Reboot&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":-1,"time":1330365646,"description":"Blue Pilots Project aka Thomas Kosidis is back with his second Album &quot;Reboot&quot;.\n\n\n 1. Million Clouds\n 2. Reboot\n 3. Mamouth\n 4. Hallelujah\n 5. Gods Gift\n 6. Main Crisis\n 7. Senta\n 8. Vivere il momento\n 9. Aired Fiction\n10. Refloat\n\t\nIt's almost two years since the day that Thomas Kosidis made his debut release as Blue Pilots Project.\nSuddenly he found himself carrying the prestige of the Greek electronica and carry it on the edges of the planet. 'Flight for everyone' has been extremely loved by the audience and the critics in Greece and internationally.\n\nTwo years after it's release, tracks like Take off, Guess, African Paths and Avandgarde still keep us company through the radio stations. An album of it's kind could only be followed with something equal. The moment has come and the second album for Blue Pilots Project titled 'Reboot' is here.\n\nThomas Kosidis chooses to step into the same musical paths with his previous project, combining electronica with music from all around the world and using into all these a psychedelic filter in order to make something unique, something labeled Blue Pilots Project.\n\n What makes a great impression from the very first moment is the feeling that you are somewhere among the instruments at the moment of the recording. \nThe mastering by the hands and equipment of George Nomikos (Nomik) gives an amazing liveliness to the project and manages to boost every sound. \nBlue Pilots Project 'Reboot', it will definitely earn our hearts once more. \n","torrent":{"xt":"urn:btih:79d5f82bb2670ca89ce8fbc24d2f810e926dd2ac","amp;dn":"Blue+Pilots+Project+-+Reboot","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"79d5f82bb2670ca89ce8fbc24d2f810e926dd2ac","infoHashBuffer":{"type":"Buffer","data":[121,213,248,43,178,103,12,168,156,232,251,194,77,47,129,14,146,109,210,172]},"announce":[],"urlList":[]}}