{"title":"G-Men (1935) FULL DVD (ISO)","uid":7042561,"size":4510220288,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:7b1bd9108435ed8f5d1ff59693648755bf7635b1&amp;dn=G-Men+%281935%29+FULL+DVD+%28ISO%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Auge","files":-1,"time":1329605406,"description":"I am providing important films in ISO for the film buff or novice film historian. It is nearly impossible to find torrent files that include all the extras or even important commentaries. \n\n*** PLEASE SEED FOR AT LEAST FIVE DAYS, THATS NOT ASKING TO MUCH AND IT WILL HELP TO INSURE THAT I CAN KEEP PROVIDING THESE DVDS. ***\n\nThis is a DVD rip to an ISO so you can watch it on your media player, mount it to a virtual drive or burn it to a DVD.\n\nThis file includes EVERYTHING the original DVD has:\n\n1935\n86 minutes\nBlack and White\n1.33:1\nSpoken Language: English  \nSubtitles: English, Spanish, French \n\nDirector: William Keighley\n\nCast: James Cagney, Ann Dvorak, Lloyd Nolan, Margaret Lindsay, Robert Armstrong, Barton MacLane, William Harrigan, Russell Hopton, Edward Pawley, Noel Madison, Monte Blue, Regis Toomey\n\nDisc Features:\n*Warner Night at the Movies (this is VERY cool, you select play-all and it takes you through a newsreel, a 20 minute comedy short film with Bob Hope, a trailer for Devil Dogs of the Air, and a 7 minute Looney Tunes cartoon called Buddy the Gee Man . . . just like watching it the cinema in 1935)\n*Audio commentary by Richard Jewal\n*Morality and the Code: A How-To Manual for Hollywood\n*How I Play Golf by Bobby Jones no.11: Practice Shots\n*Things You Never See On the Screen (an old blooper video.)\n*Original theatrical trailers\n\nSYNOPSIS:  \nPerennial film tough guy James Cagney finds himself on the right side of the law in this fast-paced crime drama about a young attorney who joins the FBI after his friend gets snuffed in a gangland killing. When the culprit and his two cohorts take it on the lam, newly minted G-man James Brick Davis (Cagney) pulls out all the stops to nab the trio. Adapted from the novel Public Enemy No. 1, G-Men also stars Ann Dvorak and Lloyd Nolan.\n","torrent":{"xt":"urn:btih:7b1bd9108435ed8f5d1ff59693648755bf7635b1","amp;dn":"G-Men+%281935%29+FULL+DVD+%28ISO%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7b1bd9108435ed8f5d1ff59693648755bf7635b1","infoHashBuffer":{"type":"Buffer","data":[123,27,217,16,132,53,237,143,93,31,245,150,147,100,135,85,191,118,53,177]},"announce":[],"urlList":[]}}