{"title":"Cyber Update Mar.2012-------DB-20174  Ariel X","uid":7111496,"size":800802873,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:7bfe8151cecf50544d58093cdd49cbb578805585&amp;dn=Cyber+Update+Mar.2012%5C-------DB-20174++Ariel+X&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"merzedes","files":-1,"time":1332084554,"description":"Cyber Update Mar.2012DB-20174  Ariel X  + Pics\n\n\nScene 1 \n\nArms strapped to a cold metal pipe with one leg up and one leg down, Ariel gets her ass kicked, punched and thumped while she screams in agony. Then she gets a spreader bar hammered through her high heel cork shoes making her legs immobile, panty gagged and mouth taped shut. The best thing? She can't do anything about it! Out comes the cattle prod which sends Ariel flailing and finally she gets vibed and fucked with a dick on a stick until she comes all sexy.\n \nScene 2\n\n With her hands taped into tight balls, Ariel is helpless on her hands and knees with her head trapped between two vertical pipes. Ms. Adams canes her strong, hot body, making her writhe in pain all over the ground. Then it's time for a make-over! Ariel looks so pretty with a clothespin beard and eyebrows while her mouth and nose are stretched and clamped wide open like a cute little piggy! She is flogged, pinched, punched and dildo fucked in the ass which makes her come HARD.\n \nScene 3 \n\nAss up, head down, Ariel looks like an expert jockey as she mounts a wooden beam with a hook up her ass. She gets choked and her ass slapped red while that hook punishes her with every move. \n\nHer toes and feet are tormented and tickled with the cane and rubber bands. Pussy lips are clamped and stretched open while Ms Adams fingers her until she comes hard. She laughs, she screams, she laughs, she screams. So much pleasure and so much pain. \n\n\nScreens &lt;a href=&quot; http://www.devicebondage.com/site/shoot.jsp?shootId=20174&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.devicebondage.com/site/shoot.jsp?shootId=20174&lt;/a&gt;\n\n\nCheers  :-)","torrent":{"xt":"urn:btih:7bfe8151cecf50544d58093cdd49cbb578805585","amp;dn":"Cyber+Update+Mar.2012%5C-------DB-20174++Ariel+X","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7bfe8151cecf50544d58093cdd49cbb578805585","infoHashBuffer":{"type":"Buffer","data":[123,254,129,81,206,207,80,84,77,88,9,60,221,73,203,181,120,128,85,133]},"announce":[],"urlList":[]}}