{"title":"Gone in 60 Seconds (1974) 'plus 8 hrs' of Motor Vehicle Histo","uid":7049229,"size":4191158272,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:7da08c24295302708dfcf4130ad5d88ac0d79d9e&amp;dn=+Gone+in+60+Seconds+%281974%29+%5C%27plus+8+hrs%5C%27+of+Motor+Vehicle+Histo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Odin1066","files":-1,"time":1329854392,"description":"This is another ISO file I made. It fits onto a standard DVDR blank disc and is NTSC 29fps standard. You can do other things with it including making PAL format, but as is it is ready to burn a DVD to be watched on TV. The picture looks better on a TV screen than on a PC monitor. It will play from beginning to end in well over '9 Hours' and it can also be watched starting at a choice of 3 parts by selection from the menu. So there's way to much for me to list since there are so many short video clips from many sources in the 1st and 3rd (Extras) sections, but I'll try to give it justice briefly...\n\nExtras...1896-1974\nWell this has clips of motor vehicles from those years from little known today pioneering examples to others which are famous. Norton, Mercedes, Indian, Porsche, Ducati, Auto Union, Avro Arrow, US 4cly bikes, Tiger (I &amp; II)tanks (as running today), rockets, A-bombs, the LeMans tragedy, 500cc V-8 Moto-Guzzi, Edsel, GM Corvair, Citroen, the Nurburgring, Ford GT-40, Honda GP 250-6, Amphicar, Honda GP 125-5, BSA, Volkswagen, 60s GP car racing, Brigitte Bardot, Gina Lollobrigida, Renault Alpine, NSU Ro8, Giacomo Agostini &amp; the 350 MV Agusta 6, Barbara Eden, Porsche 917, Steve McQueen, Dodge Coronet, the Beatles, Newport cigarettes and more. Most of the videos are pretty good to excellent, but some not so good but still watchable. Most of these are only 1-3 minutes long with the odd one being a fair bit longer. So this is a compressed overview of the late 1800s to 1974 more or less..mostly relating to vehicles but also a bit to life in general. If this sounds like the sort of stuff that you like..you should enjoy it.\nLength of 'Extras 1896-1974':  4:28:31\n\nGone in 60 Seconds (1974)....the original classic\nThe American action film written, directed, produced by, and starring H.B. 'Toby' Halicki. It centers on a group of car thieves and the 48 cars they must steal in a matter of days. The film is famous for having wrecked and destroyed 93 cars in a 34-minute car chase scene. \nDirected byBudget $150,000[1] Box office $40 million \nProduced by H. B. Halicki &amp; Richard L. Muse \nWritten by H. B. Halicki \nStarring: \nH. B. Halicki\nEleanor  (The yellow 1973 Ford Mustang Mach 1)\nMarion Busia\nJerry Daugirda\nJames McIntyre\nGeorge Cole\nRonald Halicki\nMarkos Kotsikos \nMusic by Ronald Halicki, Philip Kachaturian &amp; Eb Jensen \nCinematography by Scott Lloyd-Davies, Jack Vacek &amp; John Vacek, Sr. \nEditing by Warner E. Leighton &amp; P.J. Webb \nDistributed by HB. Halicki Junkyard and Mecantile Company \nBudget: $150,000\nBox office: $40 million \nLength: 1:37:38\n\nExtras...1970s-2010\nMV Agusta's, Ducati NCR racers, Lancia Stratos, various experimental motors, 4cyl Indians today, chariot race from Ben Hur, ladies on motor bikes, Gilles Villeneuve, Joey Dunlop and Concorde remembered, on board a Space Shuttle launch, rally racing, Chinese Red Army on parade, awesome Swiss Air Force music video, Pikes Peak, Russian Armed Forces on parade, the Island of Mann TT's, the eRockit, North Korean Hell March, a tour of Berlin by 3 different hosts, a video I made of Stratford ON Canada (much, but not all shot from inside my 2002 Ford Ranger Edge), and more.\n Length of Extras 1974-2010:  3:35:30\n\nVideo:  MPEG2 720x480 4:3 NTSC 29fps\nAudio:  AC3 48KHz 224Kbps Stereo\n\nTotal Play Time:  9:41:39 \n\nMany thanks again to DeVeDe which lets you adjust disc usage and can cram so much onto a disc. I made this back in 2010. It took quite a while to collect lots of video and then choose what made the final selection...and what didn't. It should provide enjoyable viewing for a long time into the future.\n","torrent":{"xt":"urn:btih:7da08c24295302708dfcf4130ad5d88ac0d79d9e","amp;dn":"+Gone+in+60+Seconds+%281974%29+%5C%27plus+8+hrs%5C%27+of+Motor+Vehicle+Histo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7da08c24295302708dfcf4130ad5d88ac0d79d9e","infoHashBuffer":{"type":"Buffer","data":[125,160,140,36,41,83,2,112,141,252,244,19,10,213,216,138,192,215,157,158]},"announce":[],"urlList":[]}}