{"title":"Star Wars - The Original Trilogy with Spanish Subs","uid":7190031,"size":6425662301,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:7e3bf9eba9d3eec68bfcbb001406e5d6994eb6d3&amp;dn=Star+Wars+-+The+Original+Trilogy+with+Spanish+Subs&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"percuta","files":6,"time":1334588520,"description":"The same torrent as Booster2 Thank you a lot, but with Spanish subs in txt.\n\nFans can look forward to a classic Star Wars nostalgia. The long-awaited DVD release of the original theatrical incarnations of the classic Star Wars trilogy.\nIn response to overwhelming demand, Lucasfilm Ltd. and Twentieth Century Fox Home Entertainment has released attractively priced individual two-disc releases of Star Wars, The Empire Strikes Back and Return of the Jedi. Each release includes the 2004 digitally remastered version of the movie and, as bonus material, the theatrical edition of the film. That means you'll be able to enjoy Star Wars as it first appeared in 1977, Empire in 1980, and Jedi in 1983. \n\nSee the title crawl to Star Wars before it was known as Episode IV; see the pioneering, if dated, motion control model work on the attack on the Death Star; groove to Lapti Nek or the Ewok Celebration song like you did when you were a kid; and yes, see Han Solo shoot first. \n\nThe release will only be available for a limited time: from September 12th to December 31st 2006. International release will follow on or about the same day. Each original theatrical version will feature Dolby 2.0 Surround sound, close-captioning, and subtitles in English, French and Spanish for their U.S. release. International sound and subtitling vary by territory. \n\n&quot;Over the years, a truly countless number of fans have told us that they would love to see and own the original version that they remember experiencing in theaters,&quot; said Jim Ward, President of LucasArts and Senior Vice President of Lucasfilm Ltd. &quot;We returned to the Lucasfilm Archives to search exhaustively for source material that could be presented on DVD. This is something that we're very excited to be able to give to fans in response to their continuing enthusiasm for Star Wars. Topping it off with a new interactive adventure makes September 12 (2006) a red-letter day for Star Wars fans.&quot;\n\nDirected By: George Lucas, Irvin Kershner, Richard Marquand.\n\nMPAA: Rated &quot; PG &quot; For Science Fiction Violence And Brief Mild Language.\n\nRuntime: Ep. IV: 2 Hours, 1 Minute, 8 Seconds.\n\nRuntime: Ep.  V: 2 Hours, 4 Minutes, 53 Seconds.\n\nRuntime: Ep. VI: 2 Hours, 11 Minutes, 42 Seconds.\n\nGenre: Action / Adventure / Family / Fantasy / Science Fiction\n\nCountry: USA\n\nLanguage: English\n\nSubtitle: English (Closed Captions) (Subtitles When Required)\n\nColor: Color (Technicolor)\n\nResolution: Episode IV: 720 x 304\n\nResolution: Episode  V: 720 x 320\n\nResolution: Episode VI: 720 x 304\n\nFormat: Original Widescreen Presentation ( Aspect Ratio: 2.35:1 )\n\nSound Mix: Dolby Digital 2.0 ( AC3, 192 Kbps )\n\nSystem Source: NTSC Version\n\nXviD Codec Version: 1.1.2\n\n\nThe &quot;Star Wars Trilogy (The Original Unaltered Trilogy)&quot; Has Been Presented In\n\nA &quot;Letterboxed&quot; Widescreen Format Preserving The 2.35:1 Aspect Ratio Of Its\n\nOriginal Theatrical Exhibition. This Is An Enhanced Version For 16x9 TV's.\n\nThat Means: It Is Now Available In Anamorphic Widescreen.","torrent":{"xt":"urn:btih:7e3bf9eba9d3eec68bfcbb001406e5d6994eb6d3","amp;dn":"Star+Wars+-+The+Original+Trilogy+with+Spanish+Subs","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7e3bf9eba9d3eec68bfcbb001406e5d6994eb6d3","infoHashBuffer":{"type":"Buffer","data":[126,59,249,235,169,211,238,198,139,252,187,0,20,6,229,214,153,78,182,211]},"announce":[],"urlList":[]}}