{"title":"Codebreaker","uid":7084628,"size":13364647,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:7e557ccfad5fcf20ba8ecb05b80b480fde963168&amp;dn=Codebreaker&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Ubuntu_OS","files":-1,"time":1331141365,"description":"All right,\nin this folder I have uploaded are four things.\n1. Code Breaker 10.rar\n2. CodeBreaker V.10 PS2.rar\n3.\n4. SetupImgBurn_2.5.6.0.exe\n\nPlease use Code Breaker 10.rar FIRST. If, after unpacking with winrar and burning with ImgBurn, you still are unable to get it to run on your modded PS2 then you should try the second one (which is CodeBreaker V.10 PS2.rar).\n\nI got both of these files fromI did try and locate who the original uploaders were but I failed to find them. I TAKE NO CREDIT WHATSOEVER FOR THESE.\n\nThey were compressed really well, which is why they are small.\nPlease only decompress them with WINRAR. You may try and use other software such as 7zip but I cannot guarantee success.\n\nPlease also burn with ImgBurn only. Its free software, but I decided to include the version I used here to best replicate my success.\n\nYou will need an empty DVD to burn to. \nYou will find that, the first one once decompressed is about 1.97 GB.\nThe second one should be around 1.6 GB.\n\nThe reason I am sharing these, are because the current CodeBreaker torrents on Piratebay have not worked for me.\n\nTo use these CodeBreaker's, please make sure your PlayStation 2 is MODDED. I have only used this software with copied games. I am unaware of problems with original games. These are full .ISO files in highly compressed .RARs.\n\nAlas, this is my first upload. I apologize for any problems, and I hope that I am able to seed long enough. Forgive me for any mistakes I make.","torrent":{"xt":"urn:btih:7e557ccfad5fcf20ba8ecb05b80b480fde963168","amp;dn":"Codebreaker","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7e557ccfad5fcf20ba8ecb05b80b480fde963168","infoHashBuffer":{"type":"Buffer","data":[126,85,124,207,173,95,207,32,186,142,203,5,184,11,72,15,222,150,49,104]},"announce":[],"urlList":[]}}