{"title":"Aleks Linux v1.1 (2012) [MULTi x86]","uid":7139996,"size":1097859072,"categoryP":"applications","categoryS":"unix","magnet":"?xt=urn:btih:7e6e5dfc5cf5827143eb961543a05f5279dc531a&amp;dn=Aleks+Linux+v1.1+%282012%29+%5BMULTi+x86%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"webchella","files":1,"time":1332969549,"description":"Aleks Linux v1.1 (2012) [MULTi x86]\n\nEnglish:\n--------\nInformation about the software:\nYear: 2012\nTitle: Aleks Linux v1.1\nVersion: v1.1 Build Debian based\nDigit: x86\nLanguage: Multilingual\nCrack: You do not need\nSize: 1,02 GB\n\nThe Linux operating system of collected from the debian standard with further filling of a fully functional system ready for use without the software, which is supplemented by user preference.\n\nReference system is based on:\nkernel 3.1.10-al.200059-v.2-pae\nkernel 3.2.0-bpo-pae\ngcc4.6.2\ngnome 2.30\nxorg -7.11.4\nxserver-core 1.7.6-12\nmesa 8.0.1-4\n\nFurther development of the system is based on an update of the branches of debian multimedia\nsqueeze-backports\nWhen possible training system in which you will not find problems on your equipment csistema Linux can fully satisfy your needs if you're not playing games Class AAA and are not tied to the software on its specificity, is available only under Windows\nThe system Linux has huge advantages in comparison with Windows but not perfect.\nRequires attention and brain drops if needed to solve possible problems on the production of software. setting up equipment, etc.\nFree system is expressed in the principle of finding information from other users ... perelopachivaniem Ineta in search of answers .... In a nutshell, it is possible to express the fact that the time that you have - this is money that does not appear from the creators of the free system.\nThe system is made from the heart and for themselves, and largely under the possible range of people who want to have and use a good system that has put ... added the necessary software and free puzzles and challenges are using.\nI hope you enjoy the system. Claims the author does not accept and provide assistance to users is not required.\n\nLogin name: user\nPassword: 123\nLaunching the default kernel 3.1.10 If you want to start another kernel space, and click the menu make a choice.\n\nWhat's changed:\nA. Correction of system faults on ACPI and sensing devices.\nTwo. The system replaced by guvcview cheese and a change in the level of support for webcams\nThree. For the convenience of working with sound added audacity\n4. Mesa version 8.0.1-5 and supplied extras for liaison devices hserverom\nFive. System management utilities added to laptops and software delivered and jupiter involved sensors monitor the temperature of processors and disks\n6. Completed the program gconf-cleaner in addition to the system chistilke bleachbit\n7. The kernels are removed from the system compiled and delivered the last stable kernel 3.2.12 with the function of PAE (coverage up to 64 GB of memory)\nEight. Cleaned up the desktop to the root\n\nSystem requirements:\nProcessor: Intel Pentium III 450 Mhz or AMD K6-3 450 MHz or equivalent, or a new\nMemory: 256 MB\nVideo Card: 3D-graphics adapter with 32 MB memory, compatible with DirectX 9.0c\nFree hard drive space: 2 GB\n\nImage Checksum:\nAleks-Linux-v1.1.iso\nMD5: E486D26658D8A0A3DCB05200E042780C","torrent":{"xt":"urn:btih:7e6e5dfc5cf5827143eb961543a05f5279dc531a","amp;dn":"Aleks+Linux+v1.1+%282012%29+%5BMULTi+x86%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7e6e5dfc5cf5827143eb961543a05f5279dc531a","infoHashBuffer":{"type":"Buffer","data":[126,110,93,252,92,245,130,113,67,235,150,21,67,160,95,82,121,220,83,26]},"announce":[],"urlList":[]}}