{"title":"Freemake Video Converter 3.0.1.13","uid":7034833,"size":24614888,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:7f8ee032e12fb3f9d29e1ce789f28e3be45074cf&amp;dn=Freemake+Video+Converter+3.0.1.13&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Dirty.R.L","files":1,"time":1329342870,"description":"\n\nDescription:\n\n\nFreemake Video Converter is a tool that can convert videos from different sources, photos, and music to AVI, MP4, WMV, MKV, FLV, SWF, MPEG, 3GP, DVD, Blu-ray, MP3, YouTube, Apple, Sony, &amp; Android devices.\n\nIt also allows to download online videos from YouTube, Facebook, or Vimeo and 50 more websites by a quick copypaste of video URL into the program. Due to the advanced preset editor, you can customize conversion parameters and create your own presets.\n\nRip DVD, burn Blu-ray/DVD video discs. Convert any video with embedded subtitles or add external SRT/ASS/SSA subtitles to a video. Convert videos to devices: iPod, iPhone, iPad, Sony PSP, PS2, PS3, BlackBerry, Xbox, Apple TV, Android mobile devices, smartphones.\n\nTurn photos &amp; MP3 to slideshows. Edit videos (cut, join, rotate, limit output file size, adjust to aspect ratio). Upload videos, photos, MP3 to YouTube directly without visiting the website. Freemake Video Converter supports CUDA And DXVA technologies and thus provides the fastest video conversion due to graphics card!\n\nDue to the ergonomic and friendly interface, the whole process takes a matter of a few clicks.  Freemake Video Converter is ideal for those who seek beauty, efficiency and simplicity in a single program!\n\nNow, you can use this handy application to convert all the media files you want in no time at all.\n\n\n\nRequirements:\n\n*.Net Framework 4.0 Client Profile\n  \n ( can be downloaded from here - http://thepiratebay.se/torrent/7034809 )\n","torrent":{"xt":"urn:btih:7f8ee032e12fb3f9d29e1ce789f28e3be45074cf","amp;dn":"Freemake+Video+Converter+3.0.1.13","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7f8ee032e12fb3f9d29e1ce789f28e3be45074cf","infoHashBuffer":{"type":"Buffer","data":[127,142,224,50,225,47,179,249,210,158,28,231,137,242,142,59,228,80,116,207]},"announce":[],"urlList":[]}}