{"title":"3 Ninjas with Riff Brothers Commentary","uid":7165634,"size":859749782,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:838558789a43048b7c297526391dd28a36d87483&amp;dn=3+Ninjas+with+Riff+Brothers+Commentary&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Vault_Master","files":1,"time":1333763364,"description":"After several Youtube excursions (check out the links below), the original Riff Brothers are back to take on a blast from our past: 3 Ninjas! Three middle school kids, who were trained in the mystical arts of ninjitsu by their grandpa (the late and great Victor Wong) become entangled in a kidnapping plot. Can they fight their way to freedom? Will their ninja-grampa come to their rescue? Well you just have to watch the movie to find out...\n\n... or watch the movie as Riff Brothers Chris and Jordan tear it a new a$$hole! Though we loved this movie growing up, it has admittedly not aged too well and was ripe for a good riffing. And, as an added bonus, besides the usual barrage of bad puns, off-color quips, and scathing remarks aimed towards the movie, you'll get to hear both of the commentators take jabs at each other.\n\nOn the technical side of things: The video is dual audio, so you can turn us off and enjoy some early 90's nostalgia. Video quality is OK; this isn't a movie that warranted any TLC from its parent company, but it is definitely watchable. The audio was a bit of a b*tch to pull together, but you should easily be able to hear our commentary and the film itself. All in all, this is the best I could do with what I had, and hopefully you enjoy it!\n\nNot sure if you want to risk downloading this? Well, have a look at our highlight reel on Youtube:\n\nAlso be sure to check out our Youtube riffs as well:\nUnderbelly: Mailing our Dicks -\nThe League of Science Episode I: Minecraft -\nThe League of Science Episode II: Zombies Ate My Neighbors -\nThe Life and Death of a Pumpkin -\n\nOther Riff Brother Links:\nSubscribe to us on Youtube -\nVisit our blog - http://riffbros.bmoviefilmvault.com/\nLike us on Facebook -\n\nThanks for checking out this page and thanks for downloading! We sincerely hope you enjoy! :-D","torrent":{"xt":"urn:btih:838558789a43048b7c297526391dd28a36d87483","amp;dn":"3+Ninjas+with+Riff+Brothers+Commentary","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"838558789a43048b7c297526391dd28a36d87483","infoHashBuffer":{"type":"Buffer","data":[131,133,88,120,154,67,4,139,124,41,117,38,57,29,210,138,54,216,116,131]},"announce":[],"urlList":[]}}