{"title":"Jake Bass and Jason Martin","uid":7331843,"size":282747808,"categoryP":"porn","categoryS":"other","magnet":"?xt=urn:btih:842da2ea3c72cd241e7983b0615d196288aba152&amp;dn=Jake+Bass+and+Jason+Martin&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"kettlingar","files":1,"time":1338930611,"description":" &lt;a href=&quot;http://tour.videoboys.com/videoboys.php?id=732&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://tour.videoboys.com/videoboys.php?id=732&lt;/a&gt;\n\n&quot;This is how Jake Bass operates. He sees a guy he likes and he gets what he wants. Jason Martin appeared on Jake's radar a week or so before this scene was shot. Rather than just up and ask us to arrange to shoot a scene with Jason, Jake went over our heads and contacted Jason himself to set up a &quot;let's get familiar&quot; meeting which ended up at Jake's house. . . two nights in a row!\n\nBut well, I shouldn't make it sound as if Jason had no part in all this. In fact Jason had been gently petitioning me for a shot at Jake ever since he first saw him in his solo scene on Videoboys. So all I needed to do was find a way for the text messages to start flowing between them and it was like letting water find its way to the sea.\n\nWhat you're about to see is the crescendo of two days of cuddling in Jake's bed without fucking. Today is the day Jake and Jason finally get to release all that tension that's been mounting.\n\nSomething about Jason Martin seems to bring out the tender playful side of Jake Bass. They laugh, they kiss, they cuddle and just seem to enjoy each other on many different levels. But when it comes to the fucking, Jake isn't about to show Jason any favours. In spite of the relentless pounding, we didn't hear any complaints from Jason, just moans.\n\nVideoboys would like to thank Cockyboys for the use of their newly signed exclusive model Jake Bass. This scene is part of a series of scenes in co-production with our good friends Cockyboys from New York City.&quot;","torrent":{"xt":"urn:btih:842da2ea3c72cd241e7983b0615d196288aba152","amp;dn":"Jake+Bass+and+Jason+Martin","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"842da2ea3c72cd241e7983b0615d196288aba152","infoHashBuffer":{"type":"Buffer","data":[132,45,162,234,60,114,205,36,30,121,131,176,97,93,25,98,136,171,161,82]},"announce":[],"urlList":[]}}