{"title":"PC Games Pack WindowsXP, Quake, Unreal Tournament, Starsky &amp;","uid":7123399,"size":1872585567,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:84b7cd6685483b02244ac98a593f4df38dee7909&amp;dn=PC+Games+Pack+WindowsXP%2C+Quake%2C+Unreal+Tournament%2C+Starsky+%26amp%3B&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"hacker09B73eDanny","files":1,"time":1332441897,"description":"Unzip using winrar or 7zip Run Setup.bat  \n\n\n Games and software list:\n\n  1. Quake\n  2. Bombermania\n  3. Super Mario Worlds\n  4. Star Defender 4\n  5. The Rage\n  6. Unreal Tournament \n  7. Command and Conquer Tiberian Sun plus expansion.\n  8. Age Of Empires II The Age Of Kings\n  9. Starsky &amp; Hutch\n 10. Duke Nukem Manhattan Project\n 11. Jurassic Park Dinosaur Battles\n 12. RegCure (to keep ur registry clean and windows fast)\n 13. Bat to EXE Converter.\n 14. Browzar1500 Black Edition (portable web browser)\n 15. SpeedTouchKEY.exe (key.exe to retrieve web keys with ms dos)\n\n\n All full versions! tested! clean! and working! under WindowsXP SP2 :)\n\n I wrote the file Setup.bat myself!\n Ripped some stuff from pc and Cd and made installers using Winrar :)\n im using WindowsXP SP2 english/dutch, im logged in as Administrator so you might -\n have to change the following paths in Setup.bat otherwise you might miss some  shortcuts -\n and files. The missing files can be located in the folder MSC.\n \n Copy MSC*.* &quot;C:Documents and SettingsAdministratorBureaublad&quot;\n\n IMPORTANT!!!\n\n I wrote this installation script for myself, ment to be used on Windows XP SP2.\n All games probly work under Windows Vista and 2000 as well.\n DO NOT install RegCure if ur using Windows Vista! RegCure is a fine program for -\n WindowsXP but do not use it on Vista or any other Windows installation.\n \n If a game don't work, that has probly to do with your RAM (random acces memory) or -\n you might not have the required video card specifications, the games i included in this -\n pack are classics and should run on most common computers.\n I did not temper, modify, or remove any files from the games they are all full versions -\n so support and help files are included with each of em as well.\n     \n Antivirus software. \n Im using AVG Antivirus and NOD32 (eset). \n Some antivirus programs might allert you about there might be a virus or suspicious file -\n in the package, Simple_File_Compressor.exe is a compiled batch file you might get a allert -\n on that one, but don't worry, the file only contains 3 compression task commands, no virus -\n whatsoever, also Setup.bat can be blocked by antivirus software and get labeled as a virus.\n Again its not, my Antivirus software don't blocks or delletes any of the files in the package -\n but many programs do nowadays. \n\n I made this package for own use on my computers, but hey why not share with the internet :)  \n\n INSTALLATION:\n \n After opening setup.bat you will see a ms dos screen pop up -\n It shows you some information and after 50 seconds it will start -\n installing Quake, Super Mario Worlds, and Age Of Empires II.\n All other Games and programs are optional.\n My perfect coded batch file will lead you through it :)\n All games and programs can be started from your desktop after setup.\n You dont need serials or keygens or cracks or anything &gt;.&lt;\n Just install and play :) \n After you completed all installations, Simple_File_Compressor will be -\n started, a little Ghost application i wrote. it compresses all new data -\n on your computer wich helps keeping it fast :)\n Also Quake will be started at the same time.\n \n Have Fun!\n \n And don't forget to help seeding torrents!\n\n   ","torrent":{"xt":"urn:btih:84b7cd6685483b02244ac98a593f4df38dee7909","amp;dn":"PC+Games+Pack+WindowsXP%2C+Quake%2C+Unreal+Tournament%2C+Starsky+%26amp%3B","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"84b7cd6685483b02244ac98a593f4df38dee7909","infoHashBuffer":{"type":"Buffer","data":[132,183,205,102,133,72,59,2,36,74,201,138,89,63,77,243,141,238,121,9]},"announce":[],"urlList":[]}}