{"title":"Ubuntu 11.10 Desktop 32-bit","uid":7056845,"size":729067520,"categoryP":"applications","categoryS":"unix","magnet":"?xt=urn:btih:8668b631a2a8652dcc26d91dce10b3894795b532&amp;dn=Ubuntu+11.10+Desktop+32-bit&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"ReapTermin","files":1,"time":1330158909,"description":"Ubuntu is a Debian-based Linux distribution.\n\nWelcome to Oneiric Ocelot a.k.a Ubuntu 11.10\n\nUbuntu is a community developed operating system that is perfect for laptops, desktops and servers. Whether you use it at home, at school or at work Ubuntu contains all the applications you'll ever need, from word processing and email applications, to web server software and programming tools.\n\nUbuntu is and always will be free of charge. You do not pay any licensing fees. You can download, use and share Ubuntu with your friends, family, school or business for absolutely nothing.\n\nWe issue a new desktop and server release every six months. That means you'll always have the the latest and greatest applications that the open source world has to offer.\n\nUbuntu is designed with security in mind. You get free security updates for at least 18 months on the desktop and server.\n\nEverything you need on one CD, which provides a complete working environment. Additional software is available online.\n\nThe graphical installer enables you to get up and running quickly and easily. A standard installation should take less than 25 minutes.\n\nOnce installed your system is immediately ready-to-use. On the desktop you have a full set of productivity, internet, drawing and graphics applications, and games.\n\nOn the server you get just what you need to get up and running and nothing you don't.\n\n\nHome Page: http://www.ubuntu.com","torrent":{"xt":"urn:btih:8668b631a2a8652dcc26d91dce10b3894795b532","amp;dn":"Ubuntu+11.10+Desktop+32-bit","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8668b631a2a8652dcc26d91dce10b3894795b532","infoHashBuffer":{"type":"Buffer","data":[134,104,182,49,162,168,101,45,204,38,217,29,206,16,179,137,71,149,181,50]},"announce":[],"urlList":[]}}