{"title":"Anal Overdose 2 (2DVD5 Disc Set)","uid":7041737,"size":9361682432,"categoryP":"porn","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:86721e10f214ae40bd44d6fdf31f5fe0007fbbf3&amp;dn=Anal+Overdose+2+%282DVD5+Disc+Set%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":null,"files":97,"time":1329572890,"description":"Anal Overdose 2 (2DVD5 Disc Set)\n\nStudio \tEvil Angel\nDVD Encoding \tAll Regions\nAll Time Product Rank \t104,493\nCD Universe Part number \t8674340\nDiscs \t2\nRelease Date \tJan 26, 2012\nCategory \tAnal, HD - Shot In High Def, Big Butts, P.O.V. - Point of View\nDirector \tMike Adriano\nStarring \tInari Vachs, Mike Adriano, Janet Mason, Maya Hills, Tiffany \n\nMynx, Veronica Avluv, Dani Jensen, Alana Evans, Khloe Kush\n\n\n\nPOV+! Too Much Anal Is Never Enough!\n\nGaping Contest! All The Way Up Her Fat Ass!\n\nTasting That Ass Through! Deep Anal Craving!\n\nTeenage Ass Gaped! Like A Dinner Plate! Sloppy Anal Love!\n\nDirector/performer Mike Adriano has developed a graphic style for sharing his \n\nhuge appetite for twisted butt play and nasty anal intercourse. Can there be \n\ntoo much of a good thing? Mike's double-disc 'Anal Overdose 2' packs more \n\nbackdoor fun and rump wrangling than anal lightweights can handle. With five \n\nepic, intense scenes of gaping, butt-plunging, ass-to-mouth perversity, this \n\nmovie might be addictive! Busty, seasoned porn sluts Alana Evans and Tiffany \n\nMynx strut their stuff on the director's treadmill, then oil up each other's \n\nplump boobs and giant ass before giving Mike a wet double blow job and \n\nreceiving his hot beef injection in their hungry assholes. All-natural redhead \n\nDani Jensen and stacked brunette Veronica Avluv team up for a sensuous session \n\nof ass reaming, ass eating and ass-to-mouth fun.\n\nThese luscious ladies take turns blowing Mike and rimming his butthole; \n\nVeronica gets her stretchable anus relentlessly stuffed with cock. Next, \n\nadorable blonde Maya Hills spreads her bubble buns for the director's tireless \n\npole. After he's fucked her sweet ass beyond the point of no return, Maya \n\nreceives a messy cum facial. Super-sexy MILF Inari Vachs sports an unshaved \n\npussy and perfect, all-natural body; she supplies Mike with slobbery \n\ndeep-throat service and an intoxicating anal experience. A final threesome \n\nwith gorgeous youngsters Khloe Kush and Alisa Ford features such nasty ass \n\ngaping that an intervention might be in order. There's even a bonus scene with \n\nmature titty queen Janet Mason. This prescription of hard-core anal action \n\nexceeds the recommended dosage!\n\n","torrent":{"xt":"urn:btih:86721e10f214ae40bd44d6fdf31f5fe0007fbbf3","amp;dn":"Anal+Overdose+2+%282DVD5+Disc+Set%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"86721e10f214ae40bd44d6fdf31f5fe0007fbbf3","infoHashBuffer":{"type":"Buffer","data":[134,114,30,16,242,20,174,64,189,68,214,253,243,31,95,224,0,127,187,243]},"announce":[],"urlList":[]}}