{"title":"ExploitedCollegeGirls - Kymber.wmv","uid":7110479,"size":945888972,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:88fa1e7515faa75b9d6dca5feaaa9280a2e94f61&amp;dn=ExploitedCollegeGirls+-+Kymber.wmv&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"SplashPt","files":-1,"time":1332016758,"description":"ExploitedCollegeGirls - Kymber.wmv\n\n\nDescription:\n\nYou know a chick is great at sucking cock when even Jay says &quot;That was the best blowjob I've had!&quot;. Kymber isn't even 19 yet, about as girl-next-door as it gets, and she's already a pro in the art of cock worship. Anal...not so much. But we'll get to that later.\nKymber does her hair in the bathroom while Jay asks her personal questions. You'll immediately like Kymber's candor and openness. She talks about the first time she gave a blowjob and how she hated it. Luckily she's changed her mind on that one as you will see later. Then we watch Kymber unpack an unholy amount of clothes from her little gym bag. It's like a clown car for clothing, stuff just keeps coming and coming. Pay attention to what she says the reason is that she's such a master packer. It's quite the revelation. Kymber is happy to be here, happy to get fucked every which way to Sunday, and pretty much the perfect candidate to appear on Exploited College Girls. There's nothing worse than a chick who only shows up for the money and fame, and thankfully Kymber isn't that kind of girl. You can tell she really enjoys sex and is excited about doing her first porn movie today. Despite having 3 cameras pointed at her at all times, Kymber gets pretty comfortable with the whole situation, but you can see there are some butterflies in her belly at times. But she lets loose enough to have a few bone shakin' orgasms when Jay fingers her while she uses the vibrator on her clit. The real surprise comes when Kymber is allowed to demonstrate her blowjob skills on Jay's cock. You already know the verdict: awesome! Jay can't believe Kymber is that good at giving head at her age. Time to find out if she's as good at fucking, too...\n\n\n\nTags: Hardcore, Handjob, Teen, XxX, Blowjob, Cumshot, Facial, Fuck\n\nResolution:   768x432\n\nDuration:     01:06:31\n\t\nSize:\t      902 MB\n\nScreens:\n &lt;a href=&quot;\nhttp://imgnix.com/show.php/1925_01.jpg.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgnix.com/show.php/1925_01.jpg.html&lt;/a&gt;\n\n\nor\n\n &lt;a href=&quot;\nhttp://p2pbay.me/torrents-details.php?id=1373&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://p2pbay.me/torrents-details.php?id=1373&lt;/a&gt;","torrent":{"xt":"urn:btih:88fa1e7515faa75b9d6dca5feaaa9280a2e94f61","amp;dn":"ExploitedCollegeGirls+-+Kymber.wmv","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"88fa1e7515faa75b9d6dca5feaaa9280a2e94f61","infoHashBuffer":{"type":"Buffer","data":[136,250,30,117,21,250,167,91,157,109,202,95,234,170,146,128,162,233,79,97]},"announce":[],"urlList":[]}}