{"title":"T.S. Bonniwell...Close(1969)[FLAC]","uid":7149728,"size":176210843,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:897b1195243d48ca3cd13a8e0beb459403c56982&amp;dn=T.S.+Bonniwell...Close%281969%29%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"dickspic","files":16,"time":1333271304,"description":"\n1\tWhere Am I To Go 2:55\n2\tLove is Such a Simple Word 3:17\n3\tWho Remembers 2:43\n4\tSomething to Me 3:10\n5\tBlack Snow 4:06\n6\tShe is 3:09\n7\tTemporary Knife 2:56\n8\tContinue 3:03\n9\tWhere It Belongs 2:13\n10\tBut Not With My Heart 2:59\n11\tSleep 4:18\n\nThe sole solo album by ex-Music Machine leader Sean Bonniwell, using the name T.S. Bonniwell for this release, must have come as a surprise to the few people who heard it. There was none of the angst or hard garage rock associated with many of the Music Machine's finest moments. In its place was quite subdued, orchestrated singer/songwriter pop, verging on easy listening at times in its arrangements. The gravel-growl that Bonniwell employed for the likes of &quot;Talk Talk&quot; was totally absent, as he concentrated solely on the sweet, delicate, crooning aspects of his voice. If nothing else, his ability to switch into that voice for an entire album is a tribute to pretty astonishing vocal versatility. It's a shock, though, to hear not only him focusing almost exclusively on that vocal timbre, but also to hear him as a troubadour of moody, romantic, melancholy, and introspective songs, with plenty of touches of flamenco, bossa nova, and sweeping horns and strings. Actually this material isn't so bad, though it treads close to the saccharine at times. The melodies drift nicely in a bittersweet way, Bonniwell sounding a little like someone who's lost in a raft at sea and singing his remaining days away as he slips into oblivion. Some tracks, like &quot;Something to Be,&quot; &quot;Black Snow,&quot; and &quot;Sleep&quot; (where he lets just a little bit of the Music Machine's vocal grit peek out during the most anguished sections), are quite haunting. Just be cautioned that there's little resemblance to what Bonniwell wrote and sang for the Music Machine.\n\ncd ripped by EAC\n\nplease seed\n &lt;a href=&quot;\nhttp://dickthespic.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://dickthespic.org/&lt;/a&gt;","torrent":{"xt":"urn:btih:897b1195243d48ca3cd13a8e0beb459403c56982","amp;dn":"T.S.+Bonniwell...Close%281969%29%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"897b1195243d48ca3cd13a8e0beb459403c56982","infoHashBuffer":{"type":"Buffer","data":[137,123,17,149,36,61,72,202,60,209,58,142,11,235,69,148,3,197,105,130]},"announce":[],"urlList":[]}}