{"title":"Intelligent Multimedia Databases and Information Retrieval: Adva","uid":7151937,"size":8186207,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8de1bd3a2b3a6f82aa39604b824a0ff48644d0d4&amp;dn=Intelligent+Multimedia+Databases+and+Information+Retrieval%3A+Adva&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"bookjuiced","files":1,"time":1333333244,"description":"Li Yan, Li Yan and Zongmin Ma, &quot;Intelligent Multimedia Databases and Information Retrieval: Advancing Applications and Technologies&quot;\n334 pages | English | 2011 | ISBN: 1613501269 | PDF | 8,7 MB\n\n\nAs consumer costs for multimedia devices such as digital cameras and Web phones have decreased and diversity in the market has skyrocketed, the amount of digital information has grown considerably.\n\n\nIntelligent Multimedia Databases and Information Retrieval: Advancing Applications and Technologies details the latest information retrieval technologies and applications, the research surrounding the field, and the methodologies and design related to multimedia databases. Together with academic researchers and developers from both information retrieval and artificial intelligence fields, this book details issues and semantics of data retrieval with contributions from around the globe. As the information and data from multimedia databases continues to expand, the research and documentation surrounding it should keep pace as best as possible, and this book provides an excellent resource for the latest developments.","torrent":{"xt":"urn:btih:8de1bd3a2b3a6f82aa39604b824a0ff48644d0d4","amp;dn":"Intelligent+Multimedia+Databases+and+Information+Retrieval%3A+Adva","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8de1bd3a2b3a6f82aa39604b824a0ff48644d0d4","infoHashBuffer":{"type":"Buffer","data":[141,225,189,58,43,58,111,130,170,57,96,75,130,74,15,244,134,68,208,212]},"announce":[],"urlList":[]}}