{"title":"[OCTGN] Doomtown CCG plugin (v3.0.2a)","uid":7180797,"size":175599476,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:8e47793a5f3cbead5356f80406c7abc9568b6f9d&amp;dn=%5BOCTGN%5D+Doomtown+CCG+plugin+%28v3.0.2a%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"dbzer0","files":32,"time":1334259098,"description":"Project's Homepage is here: https://github.com/db0/Doomtown-for-OCTGN\n\n\n    Doomtown (originally Deadlands:Doomtown) is a collectible card game, a companion to the Deadlands roleplaying setting.\n\n    The game sets itself apart from other CCGs by having each card also serve as a playing card and resolving certain in-game situations with a hand of poker, thus accentuating the Old West atmosphere of the game. The game involves complex deck construction and deep strategies, and was designed with multiplayer (three or more players) in mind. The sheer amount of card draw in the game makes luck much less of a factor, while the movement rules (in the style of board games such as chess) reward intelligent strategy.\n\n    Doomtown was heavily story-driven as well, with a detailed and intriguing storyline that affected cards and play styles. An example was the Fear Level that changed with each expansion and improved or disrupted play styles. Doomtown also held storyline tournaments in which players could directly influence the storyline. For instance, in the finals of a major storyline tournament, Sheriff Coleman was killed by a Sweetrock hired gunman; the sheriff was subsequently killed in the storyline, resulting in new events and action cards, and a later experienced version was Harrowed (revived as a living dead) to avenge his own death.\n\n    As of 2000, Doomtown is officially defunct.\n\n\n","torrent":{"xt":"urn:btih:8e47793a5f3cbead5356f80406c7abc9568b6f9d","amp;dn":"%5BOCTGN%5D+Doomtown+CCG+plugin+%28v3.0.2a%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8e47793a5f3cbead5356f80406c7abc9568b6f9d","infoHashBuffer":{"type":"Buffer","data":[142,71,121,58,95,60,190,173,83,86,248,4,6,199,171,201,86,139,111,157]},"announce":[],"urlList":[]}}