{"title":"Pamas Kidstime DVD 1 ned gespr NLT-Release","uid":7061992,"size":4680336827,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:8f124a9f5cda0dec5c74060c3cc7bbd1ea2a7375&amp;dn=Pamas+Kidstime+DVD+1+ned+gespr+NLT-Release&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"linday1","files":-1,"time":1330382087,"description":"Pamas Kidstime DVD 1 ned gespr NLT-Release\n\n\n\nOp deze dvd staan\n\nDe Klokkenluider van de Notre Dame (1996)\n\nParijs, 15e eeuw: de misvormde klokkenluider van de Notre Dame, Quasimodo, leeft verborgen voor de buitenwereld in de klokkentoren. Op een dag besluit hij om naar beneden te komen voor een festival. Hier ontmoet hij de zigeunerin Esmeralda.\n\n\n\nDe Klokkenluider van de Notre Dame II (2002)\n\nDe Franse hoofdstad bruist van het leven tijdens 'het festival der festivals'. \nHet circus is opgezet en de &quot;jour d'amour&quot;, de dag dat iedereen verliefd mag worden staat voor de deur. \nHoewel menig inwoner van de stad vrolijk de straat op gaat, zijn deze dagen ontzettend zwaar voor iemand als de niet al te goed ogende klokkenluider Quasimodo. Ook hij zou wel eens verliefd willen worden, maar wie zou er nou op zo\\'n \\'lelijkerd\\' kunnen vallen? Gelukkig heeft Quasimodo nog zijn drie vriendjes, de hilarische waterspuwers Hugo, Victor en Laverne die hem met moeite enige moed in weten te spreken. Ze adviseren hem zich mooi aan te kleden, zodat hij op straat een lief meisje zal aantrekken. Eenmaal buiten valt hij als een blok voor de mooie Madelein, die als assistente van circuseigenaar Sarousch werkt. \n\nSarousch is een meester der magie en kan van alles laten verdwijnen, maar hij is daarnaast een kwaadaardig persoon. Madelein heeft bijvoorbeeld ooit eens iets doms gedaan waarvoor hij haar dreigt aan te geven bij de politie als ze niet precies doet wat hij wil! Gelukkig voor Quasimodo vindt Madelein hem een erg aardig persoon, maar de gemene Sarousch zit hun liefde in de weg...\n\n\n\n\nKeizer Kuzco (2000)\n\n\nAls de verwaande keizer Kuzco zijn rechterhand Yzma ontslaat, \nverandert zij hem uit wraak in een lama, en neemt de macht van Kuzco over. \nSamen met de hulp van een dorpeling moet Kuzco zien terug te keren naar het paleis, \nz'n oude vorm weer terug te zien te krijgen, en de macht van Yzma zien af te pakken.\n\n\n\nKeizer Kuzco Kronks New Groove (2005)\n\n\nIn de opvolger van The Emperor's New Groove wordt het accent gelegd op de lomperik Kronk, \nYzma's (domme) rechterhand. Kronk is leider van een woudlopersclubje en als Kronk's vader \nvan plan is om op bezoek te komen doet Kronk er alles aan om diens goedkeuring te krijgen.\n\n\n\n===================================================================================\n\nInformatie:\nBron: Retail\nFormaat: DVD5\nGeluid: 5.1 DD\nTaal: Nederlands gesproken\nSubs: Nee\nMenu: Ja\nExtra's: Nee\nCover: Ja\n\n==================================================================================\n\n\nHashcode:\n8f124a9f5cda0dec5c74060c3cc7bbd1ea2a7375\n\n\nVOOR DE NIEUWSTE FILMS, MUZIEK EN BOEKEN GA JE NAAR NLT-RELEASE:\n &lt;a href=&quot;\nhttp://www.nlt-release.nl&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.nlt-release.nl&lt;/a&gt;\n\nBy Linday","torrent":{"xt":"urn:btih:8f124a9f5cda0dec5c74060c3cc7bbd1ea2a7375","amp;dn":"Pamas+Kidstime+DVD+1+ned+gespr+NLT-Release","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8f124a9f5cda0dec5c74060c3cc7bbd1ea2a7375","infoHashBuffer":{"type":"Buffer","data":[143,18,74,159,92,218,13,236,92,116,6,12,60,199,187,209,234,42,115,117]},"announce":[],"urlList":[]}}