{"title":"Tower.Heist.2011.DK.FR.HR.IN.PT.RO.Subtitles","uid":7043449,"size":2543148160,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:8f8c6da6179d45a2b89db4d0609b5967182aae8f&amp;dn=Tower.Heist.2011.DK.FR.HR.IN.PT.RO.Subtitles&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"svovl1234","files":3,"time":1329642629,"description":"Movie subtitles.Croatian.Danish.French.Indonesian.Portuguese.Romanian\n\nJosh Kovacs is the manager of a residential apartment in New York. He is close to all the tenants, especially Arthur Shaw, a financier. One day Shaw is arrested by the FBI for fraud. Josh thinks it's a misunderstanding that can be resolved. But later he learns that the employees' pension which he asked Shaw to handle is gone. When one of the employees tries to kill himself, Josh's views of Shaw change. He goes to see him and loses his temper. He loses his job. The FBI agent in charge of Shaw tells him that Shaw might walk and recovering the pension fund is unlikely. She tells him that it's been rumored that Shaw has 20 million laying around if he needs. Josh thinks he knows where it is. So with two other employees who also lost their jobs and an evicted tenant, they set out to get into Shaw's penthouse to get the money. But they realise they need the assistance of someone who knows what they are doing... \n\nJosh Kovacs er leder af en bolig lejlighed i New York. Han er tÃƒÂ¦t pÃƒÂ¥ alle de lejere, isÃƒÂ¦r Arthur Shaw, en finansmand. En dag Shaw bliver arresteret af FBI for svindel. Josh mener, det er en misforstÃƒÂ¥else, der kan lÃƒÂ¸ses. Men han senere lÃƒÂ¦rer, at de ansattes pension, som han bad Shaw til at hÃƒÂ¥ndtere er vÃƒÂ¦k. NÃƒÂ¥r en af ??de ansatte forsÃƒÂ¸ger at drÃƒÂ¦be sig selv, Josh syn pÃƒÂ¥ Shaw forandring. Han gÃƒÂ¥r for at se ham og mister sit temperament. Han mister sit job. FBI agent er ansvarlig for Shaw fortÃƒÂ¦ller ham, at Shaw kunne gÃƒÂ¥, og udvinding af pensionskassen er usandsynlig. Hun fortÃƒÂ¦ller ham, at det er blevet rygter om, at Shaw har 20 millioner om rundt, hvis han har brug for. Josh tror, ??han ved, hvor det er. SÃƒÂ¥ med to andre medarbejdere, der ogsÃƒÂ¥ har mistet deres job og en smed lejer, satte de ud for at komme ind Shaws penthouse at fÃƒÂ¥ penge. Men de indser, de har brug for hjÃƒÂ¦lp fra nogen, der ved, hvad de laver ...","torrent":{"xt":"urn:btih:8f8c6da6179d45a2b89db4d0609b5967182aae8f","amp;dn":"Tower.Heist.2011.DK.FR.HR.IN.PT.RO.Subtitles","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8f8c6da6179d45a2b89db4d0609b5967182aae8f","infoHashBuffer":{"type":"Buffer","data":[143,140,109,166,23,157,69,162,184,157,180,208,96,155,89,103,24,42,174,143]},"announce":[],"urlList":[]}}