{"title":"Sexy Movie Clips selected by X30001 - Part 8","uid":7068426,"size":434261309,"categoryP":"video","categoryS":"movie_clips","magnet":"?xt=urn:btih:92c8938f7c0cc2485a81c8a77f4ea7fd20301e7c&amp;dn=Sexy+Movie+Clips+selected+by+X30001+-+Part+8&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"x30001wtm","files":132,"time":1330591627,"description":"\n\nAll taken from mainstream movies, these are just clips that I\nfind sexy for various reasons.  Some show nudity and some don't,\nbut there is nothing hardcore.  They range from just a few\nseconds to about two minutes long.\n\nI did several edits this time but I won't bother listing them.\nIn general, if you see small gaps of black it means I cut out\nsomething like a fat sweaty guy watching a stripper... or\nsomething else distracting that we don't want to see in our\nsexy movie clips.\n\nThis round we're approaching 100 clips so I decided to start\nincluding screen captures in case you want to quickly find a\nclip but can't remember the lady's name.  I've gone back to the\nbeginning and taken one capture for every clip, so there are 96\nof them in this torrent.\n\nAnother new thing this round is a text file for each audio file\ntelling what clip it was used in.  Again, I've gone back to the\nstart and made one for each audio file.\n\nOne last thing worth mention is the image in the Misc directory\nthis round.  I took several screen caps of Donna Wilkes in Angel\nand used Photoshop to stitch them together, then glossed the\ncompleted image over a bit.\n\nIf you keep all of my torrent posts in a single directory, just\npoint this torrent at that same directory and everything should\nfall into place with the first seven batches.\n\nX30001wtm\n\n","torrent":{"xt":"urn:btih:92c8938f7c0cc2485a81c8a77f4ea7fd20301e7c","amp;dn":"Sexy+Movie+Clips+selected+by+X30001+-+Part+8","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"92c8938f7c0cc2485a81c8a77f4ea7fd20301e7c","infoHashBuffer":{"type":"Buffer","data":[146,200,147,143,124,12,194,72,90,129,200,167,127,78,167,253,32,48,30,124]},"announce":[],"urlList":[]}}