{"title":"The Martyrs Of The Alamo {silent} [1915] .avi","uid":7112628,"size":615256612,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:9376026c551228373feadc0d12933b51e31910cc&amp;dn=The+Martyrs+Of+The+Alamo+%7Bsilent%7D+%5B1915%5D+.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"alien99","files":-1,"time":1332113979,"description":"           AKA:   THE BIRTH OF NATION\nNot sure where i got this but i thank the up loader for this and just passing it on\nthese old silent movies are a treat to watch.\n\nStoryline\n\nThe story of the defense of the mission-turned-fortress by 185 Texans against an overwhelming Mexican army in 1836. \n\nuser review\n\n'The Birth of a Nation' was the most influential film in this medium's history, and its impact on subsequent pictures can be seen in those released shortly thereafter to those made many years later, but few other films so markedly demonstrate that influence than this one, 'Martyrs of the Alamo'. This is seen from the opening subtitle, 'The Birth of Texas', as well as in its structure, filming and editing of battle scenes, its racist depiction of Mexicans, and its glorification of white Americans and white women's virtue. Like the director of 'Martyrs of the Alamo', Christy Cabanne, most of the film's actors were Griffith veterans, too. Fred Burns, Sam De Grasse, Allan Sears, Tom Wilson, and Walter Long all worked on 'The Birth of a Nation', and Alfred Paget had also been a Griffith regular. Griffith himself probably didn't directly have much to do with this one, concentrating mostly on his own films, but it was one of the many Triangle pictures that he oversaw in a supervising capacity.","torrent":{"xt":"urn:btih:9376026c551228373feadc0d12933b51e31910cc","amp;dn":"The+Martyrs+Of+The+Alamo+%7Bsilent%7D+%5B1915%5D+.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9376026c551228373feadc0d12933b51e31910cc","infoHashBuffer":{"type":"Buffer","data":[147,118,2,108,85,18,40,55,63,234,220,13,18,147,59,81,227,25,16,204]},"announce":[],"urlList":[]}}