{"title":"Netrunner plugin for OCTGN3","uid":7180787,"size":58210976,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:93a2151a48a3967af05d9a93fe6107a1d0d7fc20&amp;dn=Netrunner+plugin+for+OCTGN3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"dbzer0","files":7,"time":1334258676,"description":"Netrunner is a cyberpunk-themed collectible card game. The two players are the Corp (who wins by completing Agendas) and the Runner (who wins by infiltrating the Corp and liberating Agendas).\n\nEach side has a limited number of both actions and bits (money) to spend per turn; bits are gone once used, and actions must be spent to gain more.\nAn important thing when evaluating the power of cards is to see the Bit per action ratio.\n\nOne unique feature of this game is that the Runner physically moves on the &quot;board&quot; created by facedown Corp cards. It has the feel of a &quot;capture the flag&quot; game, with the Runner moving in dataforts to steal Agendas from the Corp.\n\nAnother unique feature is that the Cards are NOT the primary strategy of the game; in fact, players can win by simply &quot;playing with the rules&quot; itself (a concept difficult to understand if you've never played Netrunner).\n\nBoth players play as both Corp and Runner in a game, one after the other, with each player's Runner going against the opponent's Corp. A winning match provides 10 points and the loser scores points equal to the number of agenda points scored/liberated. The winner of the game is the one who has the most points in the 2 submatches.\n\nThough Netrunner is traditionally a two-player duel, there are formats that allow for more players (called &quot;The Big Sell Out&quot;).\n\nRichard Garfield himself considered Netrunner as his best boardgame design instead of CCG design game, and he loves games that include bluffing mechanics; with Netrunner, bluffing is an integral part of the game.\n\nWhen it was released in 1996, many gaming magazines gave Netrunner critical acclaim as the best CCG ever designed. Even today, most of them still consider this to be true.\n\nNetrunner info: http://boardgamegeek.com/boardgame/1301/netrunner\n\nNetrunner plugin page: http://octgn.gamersjudgement.com/viewtopic.php?f=40&amp;t=212\n\n\n\n\n","torrent":{"xt":"urn:btih:93a2151a48a3967af05d9a93fe6107a1d0d7fc20","amp;dn":"Netrunner+plugin+for+OCTGN3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"93a2151a48a3967af05d9a93fe6107a1d0d7fc20","infoHashBuffer":{"type":"Buffer","data":[147,162,21,26,72,163,150,122,240,93,154,147,254,97,7,161,208,215,252,32]},"announce":[],"urlList":[]}}