{"title":"Overgrowth Alpha 170 (Mac)","uid":7061099,"size":2009084928,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:945384f0cbc5a75f4c1c2d59cb1d817ba3b6d465&amp;dn=Overgrowth+Alpha+170+%28Mac%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Dwarth","files":1,"time":1330347680,"description":"New features including live update for most config settings, live update for window resize, scripts can execute arbitrary code within each other (with Execute(&quot;$ARBITRARY_CODE&quot;)), testing fighting-game camera for two-player versus mode, main menu javascript can save and load files (for mod tools), and more!\n\n\nHere is the latest in our new weekly Overgrowth alpha format! David himself took some time to illustrate the traditional changelog in video form.\n\nDon't forget that you can help support us, try out our weekly alphas (such as the one in the video), and chat with other preorderers in the Secret Preorder Forum by preordering Overgrowth.\n\nThe features highlighted in the above video are as follows (among some extra ones thrown in for good measure):\n\n- Live update for most config settings\n- Live update for window resize (only on Windows for now because of Mac/Linux bugs in SDL)\n- Scripts can execute arbitrary code within each other (with Execute(&quot;$ARBITRARY_CODE&quot;))\n- Testing fighting-game camera for two-player versus mode\n- Main menu javascript can save and load files (for mod tools)\n- Fixed problem when live updating main menu\n- Levels can have manually defined weightmap paths in the level xml\n\nThanks as always for all the support! See you guys in IRC and the forums.\n\nAlso, feel free to support us by preordering Overgrowth!","torrent":{"xt":"urn:btih:945384f0cbc5a75f4c1c2d59cb1d817ba3b6d465","amp;dn":"Overgrowth+Alpha+170+%28Mac%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"945384f0cbc5a75f4c1c2d59cb1d817ba3b6d465","infoHashBuffer":{"type":"Buffer","data":[148,83,132,240,203,197,167,95,76,28,45,89,203,29,129,123,163,182,212,101]},"announce":[],"urlList":[]}}