{"title":"Ao No Exorcist [Ep 1 - Ep 24][720p HD][Eng Sub]","uid":7036913,"size":2408935182,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:95f850ca795df1f2318d9ad73a94efe3a5157ada&amp;dn=Ao+No+Exorcist+%5BEp+1+-+Ep+24%5D%5B720p+HD%5D%5BEng+Sub%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"ifariz","files":51,"time":1329416306,"description":"About Ao No Exorcist: \n----------------------\nThe story revolves around Rin Okumura, a teenager possessing abnormal strength and endurance who, along with his younger twin brother Yukio, was raised by Father Shiro Fujimoto. Soon after Yukio departs to study at the prestigious True Cross Academy, Rin learns that he is the son of Satan, the strongest of all demons. Witnessing Shiro dying to protect him, Rin ends up doing what his guardian asked him never to do: draw the demon-slaying blade Kurikara, which restrains his demonic powers, from its scabbard. From that moment on, Rin not only gains permanent demonic features like fangs, pointed ears and a tail, but also the power to ignite himself into blue flames that can destroy anything they touch.\nAt Shiro's funeral, Rin has an encounter with Mephisto Pheles, who agrees with Rin's wish to become an Exorcist like his guardian to become stronger and to defeat Satan (not to get confused with revenge for Rin has explained himself in one of the episodes and chapter). Rin enrolls at the True Cross Academy, which is actually the Japanese branch of an international organization dedicated to protect the human realm, Assiah, from demons and other creatures from the demon realm, Gehenna. Rin takes part in a special Exorcist course, the existence of which is known only by a few. Much to his surprise, he finds that his brother Yukio is already a veteran Exorcist and will be one of his teachers.\n\nSUB: English\nDUB: Japanese\n\nQuality: HD 720p (1280 x 768)\n\nULed by Fariz Luqman,\nEnjoy","torrent":{"xt":"urn:btih:95f850ca795df1f2318d9ad73a94efe3a5157ada","amp;dn":"Ao+No+Exorcist+%5BEp+1+-+Ep+24%5D%5B720p+HD%5D%5BEng+Sub%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"95f850ca795df1f2318d9ad73a94efe3a5157ada","infoHashBuffer":{"type":"Buffer","data":[149,248,80,202,121,93,241,242,49,141,154,215,58,148,239,227,165,21,122,218]},"announce":[],"urlList":[]}}