{"title":"Phoenix Nights + Max &amp; Paddys Road to Knowhere for Smartphon","uid":7239086,"size":2297754684,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:98bed153ad97463079dc70790809a4a9a2be4d81&amp;dn=Phoenix+Nights+%2B+Max+%26amp%3B+Paddys+Road+to+Knowhere+for+Smartphon&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"karl2802","files":-1,"time":1336086074,"description":"Phoenix Nights and Max and Paddy's Road to Nowhere for smartphones.\n\n\n\nPeter Kay's Phoenix Nights is a British sitcom about The Phoenix Club, a working men's club in the northern English town of Farnworth, Greater Manchester. The show was written by Neil Fitzmaurice, Peter Kay and Dave Spikey, produced by Goodnight Vienna Productions and Ovation Entertainments, and was broadcast on Channel 4 in the UK. All the music was written by Toni Baker and Peter Kay. Additional material was provided by Patrick McGuinness. Two series have been produced, which were first transmitted in 2001 and 2002.\n\nThe show is a spin-off from the spoof documentary series That Peter Kay Thing, and in turn gave rise to the spin-off Max and Paddy's Road to Nowhere. It won the People's Choice Award at the British Comedy Awards 2002, and was nominated for several others. Kay is also its star, in multiple roles, and directed the second series.\n\nIn a recent interview with Peter Kay he stated that he had written a third series of 'Phoenix Nights' and had even written a screenplay for it. However when asked if he would be going back there he said that he would prefer to do something new next.\n\nKay also claims he's been approached to make a Phoenix Nights movie following the success of The Inbetweeners Movie.\n\nBoth season of Phoenix Nights and the M&amp;P season are included.\n\nVideo: Codec: H.264\nFrame: 480 x 320\nFrame Rate: 25fps\nData Rate:608kbps\n\nAudio: Bit Rate: 96kbps\nChannels: 2 (stereo)\nSample Rate: 48 kHz\n\nAll are averages.\n\nPlease seed for others to enjoy. Many thanks.","torrent":{"xt":"urn:btih:98bed153ad97463079dc70790809a4a9a2be4d81","amp;dn":"Phoenix+Nights+%2B+Max+%26amp%3B+Paddys+Road+to+Knowhere+for+Smartphon","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"98bed153ad97463079dc70790809a4a9a2be4d81","infoHashBuffer":{"type":"Buffer","data":[152,190,209,83,173,151,70,48,121,220,112,121,8,9,164,169,162,190,77,129]},"announce":[],"urlList":[]}}