{"title":"Eve Curie - Land of My Mother","uid":7187220,"size":192382266,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:9a06eeabe526ec969ae2506db304770070cfe1be&amp;dn=Eve+Curie+-+Land+of+My+Mother&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"LECH7","files":-1,"time":1334485965,"description":"The Land of My Mother -- Polish-American documentary movie directed by Romuald Gantkowski with absolutely amazing pictures of Poland which no longer exists. The movie showing scenes in colour of pre-war Poland, and appealing for solidarity with its oppressed citizens. It is narrated by Eve Curie, daughter of the Polish scientist Marie SkÅ‚odowska-Curie and produced by The Polish Information Center in New York in 1941.\n\n&quot;Land of My Mother&quot; was produced in New York during World War II using footage from &quot;Malownicza Polska&quot;, the only colour film, so far as is known, ever produced in pre-war Poland.\n\nThere is a considerable mystery surrounding both the original Polish film and the later English language version. One story is that &quot;Malownicza Polska&quot; was filmed by Hollywood magnate Louis B. Mayer in the 1930s as a birthday present for his friend Marie Curie-SkÅ‚odowska. Another is that it was produced by Polish filmmakers for showing at the 1938 New York World's fair. And oddly enough, major Polish institutes and libraries in the United States and England were completely unaware of either film's existence.\n\nIt was the director of the film archives in Warsaw who finally identified the scenes from &quot;Malownicza Polska&quot;. It had long been assumed that all copies were lost during the war. The discovery of &quot;Land of My Mother&quot; restored to Poland the only colour cinematography of pre-war Warsaw, Wilno, Lwow, Gdynia, Zakopane, the Polish countryside and ancient works of art.\n\nMontreal writer Irene Tomaszewski (Irena Tomaszewska) was given a badly damaged original of &quot;Land of My Mother&quot; in 1993 by Mrs. Barbara Makuch, whom she had interviewed for an article in &quot;The Toronto Star&quot; about the Polish underground organization, Å»egota. Mrs. Makuch did not know of the film's provenance. Ms. Tomaszewski contacted the National Film Board of Canada which, in view of the film's significance, agreed to donate the time and expertise of its professionals to restore it and transfer the footage to a video cassette. \n\nThe Mickiewicz Foundation in Toronto donated the funds to cover the cost of the materials. In 1994, Ms. Tomaszewski delivered the original film to the Film Archives in Warsaw. The original footage is 37 minutes long.","torrent":{"xt":"urn:btih:9a06eeabe526ec969ae2506db304770070cfe1be","amp;dn":"Eve+Curie+-+Land+of+My+Mother","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9a06eeabe526ec969ae2506db304770070cfe1be","infoHashBuffer":{"type":"Buffer","data":[154,6,238,171,229,38,236,150,154,226,80,109,179,4,119,0,112,207,225,190]},"announce":[],"urlList":[]}}