{"title":"She Freak (1967)","uid":7042145,"size":3947362304,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:9bdca5c4ad46fe6427ce528c09cf4ae839a9c589&amp;dn=She+Freak+%281967%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"Odin1066","files":-1,"time":1329584974,"description":"Pretty, 30ish Jade Cochran dreams of a better life...one with a future and more than what little she has now working in a lousy diner. She leaves and ends up in a travelling carnival. She soon gets the lowdown on everyone there and manages to eventually become the owner. Since this is a 1960's version of the infamous MGM flop of 1932...Freaks...no need to give anymore away of the plot than that. Not that the story is exactly the same, but it is close. At least thanks to its' way lower budget and period of time, She Freak is nowhere near the shamelessly disturbing exploitation of people (who were born physically different) that Freaks was largely all about.\n\nProducer: David F. Friedman\nDirector: Byron Mabe\nScreenplay: David F. Friedman \nCinematography: William G. Troiano\nProduction Management: Dan Hallstrom\nMusic: William Allen Castleman (as Billy Allen)\nFilm Editor: Byron Mabe\nCast: Claire Brennen (Jade Cochran), Lee Raymond (Blackie Fleming), Lynn Courtney (Pat &quot;Moon&quot; Mullins), Bill McKinney (Steve St. John), Claude Smith (Greasy), Felix Silla (Shorty). \n\nSadly lovely Claire Brennen would die 10 years later from cancer..at the age of 43. There is a persistent rumour that Claire and Felix Silla (the cowboy dwarf , Shorty, in this film) had a nine year romance which even produced a baby. Whether or not there is truth to that, as long as She Freak exists, this sixties update to Freaks will keep both the spirit and beauty of Claire Brennen alive. And that be a reason to give She Freak a kinder review than you may have given it. It also nicely shows colourfully the sites and sounds of 'Carny' life circa 1967.\n\nVideo:  3.67GB, 720x480 mpeg2, NTSC 29fps\nAudio:  2 channel Stereo 48 kHz\nTime:  1:23:01","torrent":{"xt":"urn:btih:9bdca5c4ad46fe6427ce528c09cf4ae839a9c589","amp;dn":"She+Freak+%281967%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9bdca5c4ad46fe6427ce528c09cf4ae839a9c589","infoHashBuffer":{"type":"Buffer","data":[155,220,165,196,173,70,254,100,39,206,82,140,9,207,74,232,57,169,197,137]},"announce":[],"urlList":[]}}