{"title":"0 A.D. [Alpha 9 Ides of March]","uid":7106711,"size":312513396,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:9c1868b7e4151ab3c576b43e7bdbc7f4ca9ccd0c&amp;dn=+0+A.D.+%5BAlpha+9+Ides+of+March%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Sonarpulse","files":-1,"time":1331889559,"description":"0 A.D. (pronounced &quot;zero ey-dee&quot;) is a free, open-source, cross-platform real-time strategy (RTS) \n\ngame of ancient warfare. In short, it is a historically-based war/economy game that allows players \n\nto relive or rewrite the history of Western civilizations, focusing on the years between 500 B.C. \n\nand 500 A.D. The project is highly ambitious, involving state-of-the-art 3D graphics, detailed \n\nartwork, sound, and a flexible and powerful custom-built game engine.\n\nThe game has been in development by Wildfire Games (WFG), a group of volunteer, hobbyist game \n\ndevelopers, since 2001. The code and data are available under the GPL license, and the art, sound \n\nand documentation are available under CC-BY-SA. In short, we consider 0 A.D. an an educational \n\ncelebration of game development and ancient history.\n &lt;a href=&quot;\nhttp://wildfiregames.com/0ad/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://wildfiregames.com/0ad/&lt;/a&gt;\n*************************************************************************************\nTop new features in this release:\n* The Roman Republic faction, playable on custom scenarios and random map scripts--in single player \n\nand multiplayer, complete with a new art set, including new buildings, units, and ships.\n* A new combat system that adds bonuses and weaknesses to each unit, like rock-paper-scissors (e.g. \n\nspearmen defeat melee cavalry, but are countered by skirmishers and cavalry archers).\n* A brand new trading system, over land with traders trained from markets, and over sea with \n\nmerchant ships built at the dock. Establish a trade route between two markets or docks, and your \n\ntraders will gain resources for every trip made. You can choose which resource will be gained by a \n\ntrader.\n* Over a dozen new random map scripts by Spahbod, wraitii, and mmayfield45.\n* New animations: Rowing oars for ships, rams, some catapults, traders, some animals.\n* AI improvements: 0 A.D.'s default AI, qBot, has had a performance increase and had a serious bug \n\nfixed with the attack code.\n\nMusic and Sound: Four new tracks and one re-made track, all composed and directed by Omri Lahav, \n\nfeaturing Marta Mc'cave on the flute and Shir-Ran Yinon on the viola. Two of the tracks celebrate \n\nthe Roman faction with a very Italian mandolin.\n* An Old Warhorse Goes to Pasture - An Iberian early peace track\n* Juno Protect You - A Roman early peace track\n* Elysian Fields - A Roman peace track\n* Highland Mist - A Celtic early peace track\n* The Road Ahead - A remade, neutral (not faction-specific) peace track\n","torrent":{"xt":"urn:btih:9c1868b7e4151ab3c576b43e7bdbc7f4ca9ccd0c","amp;dn":"+0+A.D.+%5BAlpha+9+Ides+of+March%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9c1868b7e4151ab3c576b43e7bdbc7f4ca9ccd0c","infoHashBuffer":{"type":"Buffer","data":[156,24,104,183,228,21,26,179,197,118,180,62,123,219,199,244,202,156,205,12]},"announce":[],"urlList":[]}}