{"title":"Strap On Anal Lesbians (2 Disc Set)","uid":7038962,"size":15451994112,"categoryP":"porn","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:9e8da1683811a0eef9662b4f21bc5beac0a743df&amp;dn=Strap+On+Anal+Lesbians+%282+Disc+Set%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":5,"uploader":null,"files":121,"time":1329472469,"description":"Strap On Anal Lesbians (2 Disc Set) \n\nStrap On Anal Lesbians Special 2 Disc Set  \nStudio: Evil Angel Jay Sin\nCategory \tStrap-On Movies\n\nTo say that director Jay Sin is fascinated with female buttholes is an \n\nunderstatement. He's made a career of capturing rim jobs, rectal gapes and \n\nass-to-mouth action. Jay's new &quot;Strap-On Anal Lesbians&quot; is a double-DVD set of \n\ngorgeous sluts reaming each other with outrageously huge strap-on dildos; it \n\ndelivers all the eroticism of hard-core rectal sodomy, but with no dicks to \n\nspoil the girly vibe! Domineering ballet instructor Franceska Jaimes anally \n\ntrains soft-assed blonde Chastity Lynn with a riding crop and an enormous \n\nrubber cock. Young Chastity turns the tables on the statuesque Latina \n\nbombshell, pounding her ass and licking Franceska's cavernous colon. The \n\nundisputed queens of insane anal stunts and monster gaping - Hotkinkyjo, \n\nIsabella Clark and Alysa - stretch one another's winking bunghole, plowing \n\ntheir elastic backsides with impossibly thick, black phalluses and enjoying \n\nthe flavor of ass. Shorthaired Julie Night and exotic Annie Cruz share ass \n\ndomination involving milk and whipped-cream enemas plus lots of sensuous butt \n\nlicking. Latex-clad bitches Nicki Hunter and Dee Siren have a fetishistic \n\nbondage date; a perverse vacuum pump swells Dee's rosebud to a fleshy bulb. \n\nLocker room bad girls Roxy Raye and Jayda Diamonde initiate newby Amy Brooke \n\ninto a sorority-style lesbian hazing that results in a nasty anal prolapse. A \n\nbonus orgy starring lovelies Leilani Leeane, Adrianna Nicole, Gia DiMarco, \n\nLondon Keyes, Sammie Spades, Holly Michaels and Emma Haize is the frosting on \n\nthis pound cake. Jay's irrepressible sluts are strapped and ready for lesbian \n\naction!.\n\n Jay Sin's &quot;Strap-On Anal Lesbians&quot; is a double-disc DVD with bonus strap-on \n\npool party featuring seven girls; extensive outtakes and behind-the-scenes \n\nfootage; photo galleries, cast list, filmographies and trailers..","torrent":{"xt":"urn:btih:9e8da1683811a0eef9662b4f21bc5beac0a743df","amp;dn":"Strap+On+Anal+Lesbians+%282+Disc+Set%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9e8da1683811a0eef9662b4f21bc5beac0a743df","infoHashBuffer":{"type":"Buffer","data":[158,141,161,104,56,17,160,238,249,102,43,79,33,188,91,234,192,167,67,223]},"announce":[],"urlList":[]}}