{"title":"Deadly Dungeons RPG v2.0.4 Android","uid":7173880,"size":25169544,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:9f7ee2a79cfbf601f9db8f8d61aa810e9fa3f5b3&amp;dn=Deadly+Dungeons+RPG+v2.0.4+Android&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"damiantt1","files":1,"time":1334053891,"description":"Deadly Dungeons RPG v2.0.4\nRequirements: Android 1.5 and up\nOverview: Navigate dungeons and fight your way through hordes of creatures in this RPG Expansion had been released. Thanks to everyone who has helped!\n\nDeadly Dungeons is a first person RPG developed exclusively for the Android platform. This Android RPG is influenced by classic dungeon crawler games such as Dungeon Hack, Eye of the Beholder, and Nethack. Your purchase supports indie games development.\n\nAfter being separated from your adventuring party, you must navigate a deadly dungeon, and fight your way through hordes of creatures in a desperate attempt to escape alive. What first begins as a simple escape to the surface turns into a fight for survival, a confrontation with an ancient evil, and a descent to hell itself.\n\nDeadly Dungeons Android RPG features several difficulty levels. Casual, an easy mode that features a god-mode that allows you to play through the game quickly without fear of dying. Normal, a standard gameplay mode with death and saving and loading. Hardcore, a permadeath mode which deletes your save game upon death (not for the faint of heart). Nightmare, an extremely difficult mode with permadeath and creatures that move twice as fast as normal.\n\nOnce you beat the game, it doesn't end there. Start a new game and the dungeon scales to your current player level and features more difficult creatures with enhanced abilities. There are 80+ creature levels of variation featuring over 80 different types of attacks creatures can perform. Beware, the game starts off easy for casual players, but play beyond the initial starting level, and you will be met with challenges that are likely beyond your ability.\n\nOther features include:\n\n* Massive and deadly dungeon environments to adventurer through.\n* Randomly generated dungeon levels, creatures, and items.\n* Pages worth of dialog, journal entries, and environmental descriptions of the dungeon environment.\n* Continuous monthly updates that enhance and extend the RPG game.\n* First-person dungeon crawling rendered using OpenGL ES.\n* Touch-based interface.\n\n\nMarket Militia Release","torrent":{"xt":"urn:btih:9f7ee2a79cfbf601f9db8f8d61aa810e9fa3f5b3","amp;dn":"Deadly+Dungeons+RPG+v2.0.4+Android","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9f7ee2a79cfbf601f9db8f8d61aa810e9fa3f5b3","infoHashBuffer":{"type":"Buffer","data":[159,126,226,167,156,251,246,1,249,219,143,141,97,170,129,14,159,163,245,179]},"announce":[],"urlList":[]}}