{"title":"Xilisoft Blu-ray Creator 2.0.4.0707","uid":7154872,"size":34460813,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:a123f33a00102f8c4d8ff1643df7aa7af16e224a&amp;dn=Xilisoft+Blu-ray+Creator+2.0.4.0707&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"ManyAlias","files":-1,"time":1333424871,"description":"Category:\nSoftware - Windows\n\nTitle:\nXilisoft Blu-ray Creator 2.0.4.0707\n\nSize:\n32.8MB\n\nUploader:\nManyAlias\n\nDescription:\nXilisoft Blu-ray Creator 2 converts and burns various Blu-ray video discs and AVCHD DVDs with several resolutions to choose from, and even create BDMV ISO and AVCHD ISO from your videos.\n\nMoreover, the Blu-ray creator allows you to burn your shot videos from HD camcorders or DVs onto Blu-ray discs. So take your Panasonic, Sony, Hitachi, Canon or JVC camcorders on the way, capture high-definition memories, and record them onto Blu-ray discs to enjoy your movies on HDTV with your family.\n\nVirtually all popular video formats are supported such as AVI, MP4, MKV, DV, MPEG, QuickTime Video (MOV, QT), Real Video (RM, RMVB), WMV, DivX, XviD, H.264/AVC, ASF, DAT, FLV, VOB, and 3GP, especially HD camcorder videos (M2TS, MTS, TS), iPhone 4 videos (MOV).\n\nEngineered with advanced Blu-ray technology, this powerful Blu-ray Creator can burn videos to Blu-ray discs (BD-R, BD-RE, BD-25, BD-50) and AVCHD DVDs (DVD-5, DVD-9). Additional features include creating DVD menu from rich templates in different styles,attaching subtitle and watermarks, adding audio tracks and artistic effects, trimming videos and cropping video frames.\n\n- Burn videos to Blu-ray discs and AVCHD DVDs\n- Convert videos to BDMV ISO and AVCHD ISO images\n- Blu-ray video editing: clip; crop; add subtitles, audio, watermarks, and special effects\n- Create DVD movies from MOV videos shot by the newest iPhone 4\n\n___________________________________________________________________________________\nNOTE:\nPlease seed! After the torrent is done downloading, just leave it running in the background so others could have a chance to get the torrent as well.","torrent":{"xt":"urn:btih:a123f33a00102f8c4d8ff1643df7aa7af16e224a","amp;dn":"Xilisoft+Blu-ray+Creator+2.0.4.0707","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a123f33a00102f8c4d8ff1643df7aa7af16e224a","infoHashBuffer":{"type":"Buffer","data":[161,35,243,58,0,16,47,140,77,143,241,100,61,247,170,122,241,110,34,74]},"announce":[],"urlList":[]}}