{"title":"MYEgy.cOm.Batman.Arkham.City.EmmO","uid":7250744,"size":17149522551,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:a38d9e5bec525952b97636cf81f6eb4deba743af&amp;dn=MYEgy.cOm.Batman.Arkham.City.EmmO&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Slimshady572","files":-1,"time":1336446103,"description":"Batman: Arkham City is a 2011 action-adventure video game developed by Rocksteady Studios with a story written by veteran comic book author Paul Dini, Paul Crocker, and Sefton Hill. Based on the DC Comics superhero Batman, it is the sequel to the award winning 2009 video game Batman: Arkham Asylum\nIt features a main plot and side-missions that develop their own sub-plots. The main storyline revolves around Batman's imprisonment in Arkham City, a sprawling new super-prison five times bigger than the original asylum and enclosing a wide variety of industrial districts, iconic locations and landmarks of the fictional Gotham City. He must now stop mishaps occurring around this chaotic enclosure caused by Gotham's most notorious super criminals.\nThe game received widespread critical acclaim and is one of the highest-rated video games of 2011 according to review aggregator Metacritic.[9][10][11] It was the recipient of several awards including awards for Game of the Year, Action game, Action Adventure game, Adventure game and best original music score.\nThe game was released by Warner Bros. Interactive Entertainment for the PlayStation 3, Xbox 360 and Microsoft Windows. The game was officially announced during the 2009 Spike Video Game Awards and was released worldwide for consoles, beginning in North America on October 18, 2011, with the Microsoft Windows version following on November 22, 2011. A Game of the Year edition is scheduled for release on May 29, 2012 in North America and Canada on September 7, 2012 for the rest of the world. A Wii U version is set to be released in 2012. A spin-off iOS game, Batman: Arkham City Lockdown, was developed by NetherRealm Studios and released on December 7, 2011.[12]\n\nYou will need Daemon tools. Mount disk one. Don't run the setup. Open the disk and run &quot;game&quot;. When asked to insert disk 2, unmount disk one and mount disk two. After installation is complete, open the &quot;Binaries&quot; folder located in the downloaded folder. Copy everything in the folder and paste it in the game installation directory. When asked to replace. click yes.\nI'm Sorry i forgot to add the xlive.dll file and the other .dll file. When asked for them, just google them and download them. They are very tiny and will take seconds to download. Then place them in the win32 folder and the binaries folder in the game installation directory. Sorry for the inconvenience.  Enjoy!","torrent":{"xt":"urn:btih:a38d9e5bec525952b97636cf81f6eb4deba743af","amp;dn":"MYEgy.cOm.Batman.Arkham.City.EmmO","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a38d9e5bec525952b97636cf81f6eb4deba743af","infoHashBuffer":{"type":"Buffer","data":[163,141,158,91,236,82,89,82,185,118,54,207,129,246,235,77,235,167,67,175]},"announce":[],"urlList":[]}}