{"title":"Tower Heist [2011] 400MB BRRip x264-RippeR","uid":7033192,"size":436257917,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:a5ad5b9a4562ba2a935f433daf6237a110df2526&amp;dn=Tower+Heist+%5B2011%5D+400MB+BRRip+x264-RippeR&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"etlover","files":-1,"time":1329283531,"description":"When a group of hard working guys find out they've fallen victim to a wealthy business man's Ponzi scheme, they conspire to rob his high-rise residence.\nJosh Kovacs is the manager of a residential apartment in New York. He is close to all the tenants, especially Arthur Shaw, a financier. One day Shaw is arrested by the FBI for fraud. Josh thinks it's a misunderstanding that can be resolved. But later he learns that the employees' pension which he asked Shaw to handle is gone. When one of the employees tries to kill himself, Josh's views of Shaw change. He goes to see him and loses his temper. He loses his job. The FBI agent in charge of Shaw tells him that Shaw might walk and recovering the pension fund is unlikely. She tells him that it's been rumored that Shaw has 20 million laying around if he needs. Josh thinks he knows where it is. So with two other employees who also lost their jobs and an evicted tenant, they set out to get into Shaw's penthouse to get the money. But they realise they need the assistance of someone who knows what they are doing...\n\nNOTES : RippeR brings to you another high quality release in small size. English Subtitles added. Check sample before downloading :)\n\n","torrent":{"xt":"urn:btih:a5ad5b9a4562ba2a935f433daf6237a110df2526","amp;dn":"Tower+Heist+%5B2011%5D+400MB+BRRip+x264-RippeR","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a5ad5b9a4562ba2a935f433daf6237a110df2526","infoHashBuffer":{"type":"Buffer","data":[165,173,91,154,69,98,186,42,147,95,67,61,175,98,55,161,16,223,37,38]},"announce":[],"urlList":[]}}