{"title":"Cyber Update Apr.2012 - WMV - DB-19846 Bonnie Rotten","uid":7183943,"size":492678645,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:a7cb976548004a1cefd4215bd26c6b603d53546d&amp;dn=Cyber+Update+Apr.2012+-+WMV+-+DB-19846+Bonnie+Rotten&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"shallow2","files":-1,"time":1334362438,"description":"Bonnie Rotten - Tamed Whore By JP\n\nApr 13, 2012 - Performers: Bonnie Rotten \n\n\nIts difficult at first to tell whether she is excited or being bratty. She can't help but look into the camera. She knows who her target audience is. JP quickly strips her of her clothes and hopefully of her pride. Immediately the smiles stop. JP needs to know how much pain she likes... a lot or a little. We go back and forth between rough man handling and slapping to fingering her and getting her hot. Enough games, JP heads for getting her nice and pink with the flogger. The smile is definitely gone.\n\nNext, Bonnie is splayed out on the floor in a back arch position. Her arms are bolted to the floor in wooden stocks. Under her feet are spiked pieces of wood. Her knees are pried open with the spiky wooden spreader bar and JP begins picking her apart. Flogging her, using the flip cat, using the dragon tail while exposing all of her emotional vulnerabilities. He layers pain all over her body and coaxes intense orgasms from her. &quot;You said you wanted this.&quot;\n\nLast, Bonnie is standing on the spiky board with her legs strapped together and her neck and hands in stocks. JP right away goes after her with an extremely stingy flogger. She is overwhelmed. He pushes her further. Adding nipple clamps, he starts to mind fuck her with the cattle prod. Talking to her gently, he explains how challenging it is to endure a prod... it would give away too much to tell you what happens next but it does end with long beautiful orgasms!\n\nWMV + Pics. Slow download from source, MP4 tomorrow I hope.\n &lt;a href=&quot;\nhttp://www.devicebondage.com/site/shoot.jsp?shootId=19846&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.devicebondage.com/site/shoot.jsp?shootId=19846&lt;/a&gt;\n\nEnjoy :)","torrent":{"xt":"urn:btih:a7cb976548004a1cefd4215bd26c6b603d53546d","amp;dn":"Cyber+Update+Apr.2012+-+WMV+-+DB-19846+Bonnie+Rotten","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a7cb976548004a1cefd4215bd26c6b603d53546d","infoHashBuffer":{"type":"Buffer","data":[167,203,151,101,72,0,74,28,239,212,33,91,210,108,107,96,61,83,84,109]},"announce":[],"urlList":[]}}