{"title":"Remofly","uid":7084803,"size":1043001344,"categoryP":"applications","categoryS":"other_os","magnet":"?xt=urn:btih:ab07518ff39d7504c76e1fa6c3c940f4b70f5e61&amp;dn=Remofly&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Quacky2200","files":1,"time":1331147717,"description":"The current version is 12.5, crashes can be expected in this version however these problems problems should be fixed, new problems may occur but we will take the obstacle when it hits us (not literally).\n\nRemofly is designed so that it is safe, stable and easy to use so that normal everyday teenagers or even children can access the web without giving away too much information, google-chrome or open-source developed chromium should be installed on these iso's but a change may occur if necessary in the near future. Remofly also aims to be free to everyone, they can customize it any way they want, however if they are customizing illegal, action may need to be required such as DDOS and account hacking, this is a few of the hacking types in the hacking community that the world sadly lives with - that's why we have built this, this is why I have chosen this opportunity to make this, not because of just safe family housing computing but to make the world a better place without paying a license and the option to customize is important to all people in our community, this is not the place to sell or buy or even hack but a place to a live freely.\n\nRemofly aims to be high in the tops as Microsoft and Apple have always taken part in this competition, so do we, so we are taking this pathway to lead us to success, I believe in an open world where everything that we say or do doesn't need to be corrected, abandoned or even bullied but instead bring closer and connect with everyone and this is why we have a presented these operating systems, we think that by the year 2015 or 2020, every single living person will at least have a way of getting on the web, whether adult, child or teenager and will even have an even faster experience of connecting to the web with glorious optic broadband, of up to speeds that not possible before. We aim to impress you and also inspire you to use our product as well as develop your own or even make it better than ours to improve ours. This will help you connect to your lifetime buddies and relationships with Facebook, Twitter, Google+, Blogger and many more.\n\nThis software is aimed to be used on any type of device big or small - netbooks to very powerful desktop computers, you don't need a powerful computer to used this software, just a processor over 1.3ghz and 512-2gb Ram should be sufficient and a Internet connection when needed.","torrent":{"xt":"urn:btih:ab07518ff39d7504c76e1fa6c3c940f4b70f5e61","amp;dn":"Remofly","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ab07518ff39d7504c76e1fa6c3c940f4b70f5e61","infoHashBuffer":{"type":"Buffer","data":[171,7,81,143,243,157,117,4,199,110,31,166,195,201,64,244,183,15,94,97]},"announce":[],"urlList":[]}}