{"title":"High Sierra (1941) FULL DVD (ISO)","uid":7190560,"size":4488872755,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:abac4ef168ea989b622c5bb9ae875f27d77b2a79&amp;dn=High+Sierra+%281941%29+FULL+DVD+%28ISO%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Auge","files":-1,"time":1334603092,"description":"High Sierra (1941) FULL DVD (ISO)\n\nI am providing important films in ISO for the film buff or novice film historian. It is nearly impossible to find torrent files that include all the extras or even important commentaries. \n\nThis is a DVD rip to an ISO so you can watch it on your media player, mount it to a virtual drive or burn it to a DVD.\n\nThis file includes EVERYTHING the original DVD has:\n\n\n1941\n100 minutes\nBlack &amp; White \n1.37:1\nSpoken Language: French \nSubtitles: English, French, Spanish \n\n(DVD-5)\n\nDirector: \nRaoul Walsh\n\nCast: \nHumphrey Bogart, Ida Lupino, Alan Curtis, Arthur Kennedy, Joan Leslie, Henry Hull, Henry Travers, Jerome Cowan, Minna Gombell, Barton MacLane, Elisabeth Risdon, Cornel Wilde, Donald MacBride, Paul Harvey, Isabel Jewell\n\nDisc Features:\n* Curtains For Roy Earle: The Story of High Sierra\n* Theatrical trailer\n\n\nSYNOPSIS:  \nHumphrey Bogart stars as Roy Mad Dog Earle in this 1941 classic. Pardoned after a lengthy stint in prison, Roy looks forward to his newfound freedom, but it seems his release was brokered by a crime lord who wants to recruit him for a heist. Plus, Roy and his partners in the caper, who were all handpicked for him, are angling for one womans affections: a dancer played by the ravishing Ida Lupino.\n\n*** I upload my torrents to The Pirate Bay and Demonoid, if you would like to upload one of my torrent files to another tracker feel free, all I ask is that you upload the same torrent file you downloaded by clicking on one of my links so that more seeders/peers are in the swarm.  ***\n\n*** THE BEST WAY TO MESSAGE ME IS TO COMMENT ON MY LATEST UPLOAD, I AM GETTING TOO MANY UP THERE TO MONITOR ALL OF THEM. ***\n","torrent":{"xt":"urn:btih:abac4ef168ea989b622c5bb9ae875f27d77b2a79","amp;dn":"High+Sierra+%281941%29+FULL+DVD+%28ISO%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"abac4ef168ea989b622c5bb9ae875f27d77b2a79","infoHashBuffer":{"type":"Buffer","data":[171,172,78,241,104,234,152,155,98,44,91,185,174,135,95,39,215,123,42,121]},"announce":[],"urlList":[]}}