{"title":"The Boys from Pictou (2005)","uid":7047735,"size":2316242944,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:ac25f6e33466b97efb0623616f06f12278ca05a6&amp;dn=The+Boys+from+Pictou+%282005%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Odin1066","files":-1,"time":1329804082,"description":"This is an excellent short documentary....made to commemorate both the 60th anniversary of the end of the Second World War and even more so the continuing trauma of the losses incurred still, so many years later. Pictou, Nova Scotia is a town which was founded in the 1767 and yet had a population of  only 3,813 in 2006. Of the many young men who left to fight in the Canadian Armed Forces...28 died. Here are siblings and friends of some of those lost recounting those times and their memories of before and after they found out. Of course the tragic loss felt in Pictou was happening in every community across all of Canada. The dead, wounded, maimed, psychologically changed, etc being in much larger numbers in much larger communities. And the same thing happened in many countries which were involved in that war. This is a CBC production and unfortunately when I recorded it (cable TV&gt;PC) the reception was acting up. Cable wasn't digital then and the picture is a little snowy. The program is quite moving and is watchable. I added several Oldsmobile screen ads from 1942-43 where I removed the commercial breaks. One is at the very start too. You'll see the picture looks better then. Still this makes for a good demonstration of how anybody thinking WW2 is ancient history and doesn't affect them is wrong. Even if it doesn't directly it still does because the trauma of the 50 million dead at that time changed the world forever. Certainly this is another fine anti-war documentary.\n\nVideo:   720x480  NTSC  29fps\nAudio:  2 channel stereo 48kHz\nLength:  0:48:57","torrent":{"xt":"urn:btih:ac25f6e33466b97efb0623616f06f12278ca05a6","amp;dn":"The+Boys+from+Pictou+%282005%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ac25f6e33466b97efb0623616f06f12278ca05a6","infoHashBuffer":{"type":"Buffer","data":[172,37,246,227,52,102,185,126,251,6,35,97,111,6,241,34,120,202,5,166]},"announce":[],"urlList":[]}}