{"title":"Cyber Update May.2012------HT-19674 Chastity Lynn","uid":7240739,"size":2749240334,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:ac6d80e1d7f07a3544ee310dc4f0957091720bb9&amp;dn=Cyber+Update+May.2012%5C------HT-19674+Chastity+Lynn&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"merzedes","files":-1,"time":1336125534,"description":"Cyber Update May.2012HT-19674 Chastity Lynn  Wmv and Mp4 + Pics\n\n\n\nWelcome Chastity Lynn gorgeous and young to hogtied. \n\n\nScene 1\n We start with Chastity tied in a strict elbows together strappado with her neck tied to her knees and her hair tied back and up to the point. Chastity gets exposed and violated with the cane. Her toes get bound, stretching her feet, and her tender soles are taken advantage of. She then gets hoisted into a standing predicament bondage and tested for her response to pleasure.\n\n\nScene 2\n Chastity is bound with one knee up to the ceiling and arms again bound and pulled strictly behind her. We want to see her cum and get to watch as orgasms are repeatedly coaxed out of her willing cunt hole. She is hoisted into the air hanging only by one knee with her torso and ankles pulled in opposite directions, like being drawn and quartered. The harder the bondage, the harder the orgasm...\n\n\nScene 3\n Bound bent over a post with her knees spread, she gets tormented in the face with panty hose pulling her face back and a flip cat to her back side. We get to watch as her muscles flex and pull, straining to escape the discomfort Finally, she is pulled into an open legged hogtie, left to suffer and cum in discomfort.\n\n\nScene 4\n Perched on the post, we get to examine her bondage. Her knees are bound to her chest and her neck is bound to her hands. If she chooses to pull down on her neck, she can play with asphyxiating herself. The perch is removed and we get to see her fully suspended. Claire adds to the predicament by having her toes pulled wide open by the pinkies and the big toe attached to nipple clamps. Claire does what she can to encourage Chastity to pull on those clamps and try and escape the pain that she never quite can...\n\n\n\nScreens &lt;a href=&quot; http://www.hogtied.com/site/shoot.jsp?shootId=19674&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.hogtied.com/site/shoot.jsp?shootId=19674&lt;/a&gt;\n\n\nCheers  :-)","torrent":{"xt":"urn:btih:ac6d80e1d7f07a3544ee310dc4f0957091720bb9","amp;dn":"Cyber+Update+May.2012%5C------HT-19674+Chastity+Lynn","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ac6d80e1d7f07a3544ee310dc4f0957091720bb9","infoHashBuffer":{"type":"Buffer","data":[172,109,128,225,215,240,122,53,68,238,49,13,196,240,149,112,145,114,11,185]},"announce":[],"urlList":[]}}