{"title":"Risen 2 Dark Waters [Xtract and Play] GLOBE.arc","uid":7252089,"size":1757890373,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:ae6f5c6eca66735a3c8e5abac0c758d777f0dfe6&amp;dn=Risen+2+Dark+Waters+%5BXtract+and+Play%5D+GLOBE.arc&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"globeplus","files":-1,"time":1336437096,"description":"GAME : RISEN 2 DARK WATERS\n\n\n\nGENRE(s) : \tAction role-playing, semi-open world\n\n\n\nFILE INFO :  ARC FILE (freeware FREEARC needed to extraction)\n\n\n\n* Plot :\n\nThe story begins in the Fortress of Crystal at the port of Caldera, last fortress of the Inquisition (a military/religious group last seen in Risen) and of the Old Empire. The mountains surrounding Caldera are aflame, as ancient gods called Titans (also last seen in Risen) assail the land to the north. Two of the Titans, Ursegor and Ismael, have fallen to fighting each other. This has relieved the pressure on Caldera, although parts of the city are on fire and have been abandoned. But one of the two Titans must soon fall, and the winner will then try to find a way to crush Caldera. Only the power of the mysterious crystal cave, located under the Fortress, gives the small depleted garrison some hope that they might keep the victorious Titan at bay. A more immediately pressing problem is a sea monster called the Kraken, which attack ships at sea and is under the command of the Titan goddess Mara. The Kraken attacks thus prevent Inquisition equipment, soldiers and supplies from reaching the last remaining haven of Caldera. The monster also prevents the Inquisition from fleeing from the Titans and the Old World, over the ocean to the New World. To add to the garrison's troubles, what little supplies Caldera has left are threatened by pirates who try to rob the storehouses.\n\nOne stormy night, Commandante Carlos (head of the Harbour Town garrison in the first Risen) spies a pirate ship on a course into Caldera harbor. Before it can reach safety, it is sunk by the Kraken. Carlos asks the hero to help any survivors. Among the survivors who are found washed up on the beach, there is a key character from Risen, the pirate Patty. Patty is always in search of her father, the famous pirate Gregorius Emanuel Steelbeard, and his treasure. Rumor says Steelbeard has found a way to sail the seas safely, using what may be a possible weapon that could kill the Kraken. Commandante Carlos decides that the Hero should infiltrate Steelbeard's pirates and try to learn any secrets they have. Patty and the Hero decide to team up, for the journey to the pirate's island of Tacarigua. The Hero is officially stripped of his position in the Inquisition, and sent on his mission.\n\nThe hero and Patty find Steelbeard on the far side of the island, and discover that he has discovered the location of the Titan Harpoon, which could potetially kill even the Titan Lords themselves. The trio set sail and head to the Sword Coast to confront the Harpoon's current owner, Captain Crow. However, Crow is safely protected from attacks, leading the hero to side with either the Inquisition or the native Moluccas for assistance. When confronted, Crow summons an Earth Titan to kill the hero, only for him to steal the Harpoon and impale Crow with it.\n\n\n\n\n\n\n* enjoy ...\n\n\n\n\n\n\n\n\n\n* GLOBE FILES 2012","torrent":{"xt":"urn:btih:ae6f5c6eca66735a3c8e5abac0c758d777f0dfe6","amp;dn":"Risen+2+Dark+Waters+%5BXtract+and+Play%5D+GLOBE.arc","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ae6f5c6eca66735a3c8e5abac0c758d777f0dfe6","infoHashBuffer":{"type":"Buffer","data":[174,111,92,110,202,102,115,90,60,142,90,186,192,199,88,215,119,240,223,230]},"announce":[],"urlList":[]}}