{"title":"AVG_Internet_Security_2012_Business_Edition_12.0.1831_Final - Ma","uid":7162659,"size":360443461,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:b00ebd70b1f6abdcf3e67616ccafb9cf820f15bf&amp;dn=AVG_Internet_Security_2012_Business_Edition_12.0.1831_Final+-+Ma&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Magik_420","files":-1,"time":1333666581,"description":"AVG Internet Security 2012 Business Edition - is a program for protecting your PC from dangerous objects and network threats. Program blocks viruses, trojans, worms, spyware, and firewall to protect against network attacks. If you are using AVG Internet Security Business Edition 2012 you will not have to worry about identity theft, spam or viruses.\n\nThe program contains a built-in anti-virus module, firewall, detection system, and unsolicited e-mail applications to steal confidential data. AVG Internet Security Business Edition 2012 provides an opportunity to forestall the introduction of all types of threats to computer equipment from the Internet, protects against viruses, Trojans, spyware applications, veiled threats and hacker attacks.\n\nThe software solution combines the technology to scan LinkScanner and system behavioral analysis. Provides the function block dangerous web-resources at work on the Internet. AVG Internet Security Business Edition evaluates web-sites to view the current time and warns the user about the extent of their security checks downloaded files for viruses and provides a scan instant messages. Includes remote system administration. ","torrent":{"xt":"urn:btih:b00ebd70b1f6abdcf3e67616ccafb9cf820f15bf","amp;dn":"AVG_Internet_Security_2012_Business_Edition_12.0.1831_Final+-+Ma","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b00ebd70b1f6abdcf3e67616ccafb9cf820f15bf","infoHashBuffer":{"type":"Buffer","data":[176,14,189,112,177,246,171,220,243,230,118,22,204,175,185,207,130,15,21,191]},"announce":[],"urlList":[]}}