{"title":"HISTORY OF POP AND ROCK MUSIC - part 366","uid":7085106,"size":805571621,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:b0dcaa809c0eacb3d432b4e7009a9f6961418d9b&amp;dn=HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+366&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"pupovaczlatko","files":-1,"time":1331156749,"description":"                  PART  366\n\n\n\n         R.E.M. - The One I Love  (1987)\n         WORLD PARTY - Is It Like Today  (1993)\n         COUNTING CROWS  - Mr. Jones  (1993)  \n         GARBAGE   - I'm Only Happy When It Rains  (1995)\n         HOLE  - Malibu  (1998)\n\n\n\n    &quot; The One I Love&quot; is a song by American rock band R.E.M. It was released on the band's fifth full-length studio album, Document, and also as a 7&quot; vinyl single in 1987. The song was their first hit single, reaching #9 in the US Billboard Hot 100, #14 in Canada, and later reached #16 in the UK singles chart on its UK release (1991). In March 2005, Q magazine placed &quot;The One I Love&quot; at number 57 in its list of the 100 Greatest Guitar Tracks.\n     Karl Wallinger  is a Welsh musician, songwriter and record producer. He is best known for leading a British pop/alternative rock band World Party and for his mid-1980s stint in The Waterboys. \n    &quot;Mr. Jones&quot; is a song by American alternative rock band Counting Crows. It is the lead single and third track from their debut album, &quot;August and Everything After&quot; (1993). It was the band's first radio hit and remains their most popular single.&quot;Mr. Jones&quot; entered the American Top 40 on February 19, 1994, and entered the Top 10 five weeks later. On April 23, &quot;Mr. Jones&quot; passed R. Kelly's &quot;Bump n' Grind&quot;, taking the number-one position (which it surrendered, the following week, to Prince's &quot;The Most Beautiful Girl in the World&quot;).\n    &quot;Only Happy When It Rains&quot; is a song written and produced by alternative rock group Garbage for the band's self-titled debut studio album. The song was recorded at the band's own recording studio, Smart Studios, in Madison, Wisconsin, being mixed twice before its release. The bleak content of the lyrics was intended as a parody of the angsty themes in the mid-1990s alternative scene, as well as a sarcastic reference to Garbage's own preference for darker themes.The song received positive reviews, praising the production and Shirley Manson's singing, and became the band's breakthrough single, charting strongly on both the UK Singles Chart and Billboard Hot 100. It also crossover to pop radio formats, propelling their debut album into the Top 100 of the Billboard 200 for the first time, and the song's music video, directed by Samuel Bayer, received much airplay on MTV. \n     &quot;Malibu&quot; is the eleventh single by alternative rock band Hole, and the second from their third studio album &quot;Celebrity Skin&quot;, released in November 1998. The song was written by vocalist and rhythm guitarist Courtney Love, guitarist Eric Erlandson, and The Smashing Pumpkins' Billy Corgan, who contributed to several songs on the album.&quot;Malibu&quot; was one of the band's most commercially and critically successful songs, peaking at number three on the US Modern Rock Tracks chart, and garnering a Grammy nomination in 1999. The single was certified Gold in Australia in 1999, with sales in excess of 40,000.\n","torrent":{"xt":"urn:btih:b0dcaa809c0eacb3d432b4e7009a9f6961418d9b","amp;dn":"HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+366","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b0dcaa809c0eacb3d432b4e7009a9f6961418d9b","infoHashBuffer":{"type":"Buffer","data":[176,220,170,128,156,14,172,179,212,50,180,231,0,154,159,105,97,65,141,155]},"announce":[],"urlList":[]}}