{"title":"THE RAID REDEMPTION XVID CAM GLOBE","uid":7168698,"size":1104103824,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:b3b65754b3f6dedc1d1e678936722c4e5a0f9120&amp;dn=THE+RAID+REDEMPTION+XVID+CAM+GLOBE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"globeplus","files":-1,"time":1333878921,"description":"* XVID CAM  * 01H29M49S    * + 1200 Bitrate    * Worked with the Dub plugins\n\n\n* FILE INFO :\n\n\n- Black borders at the top and the bottom in full screen corrected\n\n- particles on the picture background reduced to the minimum\n\n- colours improved\n\n- Indonesian audio with english subtitles\n\n\n\n\n* Plot :\n\n\nDeep in the heart of Jakarta's slums lies an impenetrable derelict apartment building which became a safe house for the city's most dangerous murderers, killers and gangsters. The rundown apartment block has been considered untouchable to even the police. It all changes when an elite team is tasked with raiding the building in order to take down the notorious crime lord Tama Riyandi who runs it.\n\nCloaked under the cover of pre-dawn darkness and silence, rookie officer Rama and a 20 man SWAT team, led by Sergeant Jaka, arrive at the apartment block under the guidance of Lieutenant Wahyu. Starting from the ground floor and moving up, they slowly and tactfully infiltrate the apartment block until they reach the sixth floor. The team is spotted by a child and runs off to warn Tama.\n\nTama hears of the presence and announces to the whole block that he will grant sanctuary to those who kill the SWAT team. Sergeant Jaka soon learns that the mission was not sanctioned by the department but only by Lieutenant Wahyu, thus no reinforcements or rescue. After a lengthy battle the team is stranded on the 6th floor in which they are; outnumbered, out of ammunition and being hunted down. The members that survived the ambush are: Sergeant Jaka, Lieutenant Wahyu, Bowo, Dagu and Rama. After narrowly escaping an explosion, the team split into two groups: Jaka with Wahyu and Dagu on the 5th floor and Rama with Bowo finding safety on the 7th floor.\n\n\n\n\n\n* enjoy ...\n\n\n\n\n\n\n\n* GLOBE FILES 2012","torrent":{"xt":"urn:btih:b3b65754b3f6dedc1d1e678936722c4e5a0f9120","amp;dn":"THE+RAID+REDEMPTION+XVID+CAM+GLOBE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b3b65754b3f6dedc1d1e678936722c4e5a0f9120","infoHashBuffer":{"type":"Buffer","data":[179,182,87,84,179,246,222,220,29,30,103,137,54,114,44,78,90,15,145,32]},"announce":[],"urlList":[]}}