{"title":"The Invaders Season 02  E14-26","uid":7208220,"size":4768817152,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:b88802bacc6d3c5813f8554e43602a24420b3047&amp;dn=The+Invaders+Season+02++E14-26&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"alien99","files":-1,"time":1335155552,"description":"I thank the original source for this file:\n\nI have broken season 02 into 2 parts for me to seed easier for size do to speed and the volume of ques i got on season 01, as normal on older files lots of takers few seeders on the overhaul about of volume.\n\nStoryline\n\nDavid Vincent, an architect returning home after a hard, hard, day parks his car in an old ghost town in order to rest for a while before continuing on home. Suddenly, in the middle of the night, something wakes him: a strange object, nonhuman, that is landing in front of his eyes. From this moment he will be trying to persuade a skeptical world that the invasion of our planet is going on, that the nightmare has begun... \n\n\nUser Review\n\nFor me this show ranks as one of the 10 best TV shows ever made. It resonates with me even today, and I think Roy Thinnes' performances, especially in the first season, are brilliant in their subtlety. I guess what really hits me about this show is how you have a man, David Vincent, who was living in a very conventional 60's worldview--until the night he makes one wrong turn and ends up having his safe, comfortable little existence turned upside down. Somehow I see a parallel between David Vincent and the title character of another top ten TV show - THE PRISONER. Both Number Six and David Vincent have been dragged into worlds of great excitement and adventure - but both are also modern equivalents of Sisyphus, forever doomed to struggle against overwhelming opposition. Both Number Six and David Vincent are actually tragic characters. The trap of most TV shows - that the status quo must be maintained from episode to episode to keep the series going - proves in this case to be a great asset to the nightmarish quality of the premise. Also, you never truly see who the aliens &quot;are&quot;, any more than you find out who's running the Village.\n\t","torrent":{"xt":"urn:btih:b88802bacc6d3c5813f8554e43602a24420b3047","amp;dn":"The+Invaders+Season+02++E14-26","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b88802bacc6d3c5813f8554e43602a24420b3047","infoHashBuffer":{"type":"Buffer","data":[184,136,2,186,204,109,60,88,19,248,85,78,67,96,42,36,66,11,48,71]},"announce":[],"urlList":[]}}