{"title":"Tarz &amp; Jane, Cheeta &amp; Boy  (1975)  PG-18","uid":7044446,"size":3152234496,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:b9f59d8b3c7d70a0895efbf5107793c0d8dbcfed&amp;dn=Tarz+%26amp%3B+Jane%2C+Cheeta+%26amp%3B+Boy++%281975%29++PG-18&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Odin1066","files":-1,"time":1329694381,"description":"This isn't a Tarzan movie for children to watch. This is not a 'Porno'. It is for Adults due to nudity, sexual situations &amp; depictions,etc. Think of it as 'Carry On...up the Jungle' done by Americans with much more explicit naughty humour including the use of props like dildo's and some purposefully wrong sounds like a bolt action rifle sounding like a machine gun burst with each single shot.\n\nTarz and Jane are living happily together and Boy is now grown up. Cheeta is a big ape (the cheap quality of the costume really should be as it is, due to the 'plot') who is doing lewd physical gestures all the time and early on forces himself on Jane. Meanwhile Tarz gets into a fight with a croc/gator/'prop' and not only loses the fight..but he loses his 'male organ' when it is bitten off!!! Now what? Jane always 'wants it' and he can't 'do it' anymore. With the help of a white explorer/hunter, Miss Wanda, they all head for Wango Wango Land where Tarz can hopefully be res-'erected' by the magic of their Witch Doctor. Many unusual things are experienced throughout including a novel way to make\n\nThe credits show names which are mostly all not real person's names. Eg: Director: Itza Fine. Miss Wanda is played by the 70's porn star Georgina Spelvin. Tarz and Jane are Patrick and Tally Cochrane Wright. They got divorced around 1983 and curiously recently died at almost the same ages...65 for Patrick and 66 for Tally. They both were bit players from commercials, sexploitation films...to even The Dukes of Hazard. The IMDB entry doesn't say much about this short movie..but it's enough I suppose.\n\nVideo:  2.93GB, 720x480 mpeg2\nAudio:  2 channel stereo, 48 kHz\nLength:  1:06:35","torrent":{"xt":"urn:btih:b9f59d8b3c7d70a0895efbf5107793c0d8dbcfed","amp;dn":"Tarz+%26amp%3B+Jane%2C+Cheeta+%26amp%3B+Boy++%281975%29++PG-18","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b9f59d8b3c7d70a0895efbf5107793c0d8dbcfed","infoHashBuffer":{"type":"Buffer","data":[185,245,157,139,60,125,112,160,137,94,251,245,16,119,147,192,216,219,207,237]},"announce":[],"urlList":[]}}