{"title":"Last's Blood Mod / no death mod for Overgrowth a180","uid":7327256,"size":109143,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:ba7a5bc7c427421adcb5f86dc2873ebb3a8c6d6d&amp;dn=Last%27s+Blood+Mod+%2F+no+death+mod+for+Overgrowth+a180&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Dwarth","files":1,"time":1338803627,"description":"Thread's first message :\n\n&quot;For now on my Blood Mod's will go into this thread.\nEdit: 12.02.2012\nAlways look for latest blood mod / no death mod for your OG- This means that when the new alpha comes out and i haven't had time to confirm that older version of my mod still works don't install old version of my mod.\n\nI try to remember to edit this post to when i update my mod. But here is a download link to the latest version.\nThis means for a180 http://forums.wolfire.com/download/file.php?id=3467\n\nSo here is what this mod is currently doing:\n1. It adds new buttons into the editor menu (press esc key in the editor mode)\nThose buttons are Open settings menu and Open Slow motion settings.\nNow in the Open settings menu there are different settings for turning on and off blood effects, no death, jump from ledge grab, footprints, minimap and a button that leads you to Open Slow motion settings.\nThis is the same button that was in the same menu when you first pressed esc key.\nNow in the Open Slow motion settings you turn on and off 4 different slow motion options.\nThose are falling to death, successful counter block/judo throw, slow motion when you make dodge move and every successful block activates slow motion.\nEdit: 19.10.2011\nInside this zip file is a folder named bloodmod+no death mod and original a1xx file. Original a1xx file folder is for uninstalling my mod. (x is replaced with number)\nfor instalation u need to go into bloodmod+no death mod folder in that zip file and coppy data folder into OG main folder. (folder where you installed OG)\nfor uninstalation open in my zip file original a1xx file folder and copy data folder into OG main folder. (folder where you installed OG)\n\nEdit: 19.10.2011 I added 2 new keyes to toggle blood effects and no death on and off\n&quot;o&quot; key is for blood effects on and off (like on and off)\n&quot;u&quot; key for no death (like unstoppable)\n\nI changed some keys: &quot;x&quot; is'nt reseting blood decals on the grond now.\ni moved old &quot;x&quot; functions under new key &quot;.&quot;(point)\nAlso added blood driping functions all ower your and AI bodeys. just press &quot;y&quot;\n\nEdit: 12.02.2012 This mod is grown alot snits last edit of this post and i just can't add all the code that i use because it's to big and i think it's to hard to keep track if it.\n\n\n\nI think i add here my blood mod code also so everybodey can see how this mod works and maybe create their own mods.\n[color=#4040FF]EDIT: 19.10.2011 since this mod changed into blood mod / no death mod\nthere is new code for it.&quot;","torrent":{"xt":"urn:btih:ba7a5bc7c427421adcb5f86dc2873ebb3a8c6d6d","amp;dn":"Last%27s+Blood+Mod+%2F+no+death+mod+for+Overgrowth+a180","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ba7a5bc7c427421adcb5f86dc2873ebb3a8c6d6d","infoHashBuffer":{"type":"Buffer","data":[186,122,91,199,196,39,66,26,220,181,248,109,194,135,62,187,58,140,109,109]},"announce":[],"urlList":[]}}