{"title":"MUD TV from Kalypso media","uid":7053344,"size":819559251,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:bc41dab14c0f48af0fec03bbc9afec050f2e752b&amp;dn=MUD+TV+from+Kalypso+media&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"aggnalre","files":3,"time":1330021677,"description":"Fed up of the same TV shows repeated week in week out? Think you can do a\n  better job? Well it's time to put your money where your mouth is and head\n  over to M.U.D. TV (Mad, Ugly, Dirty Television) where you call the shots as\n  a top TV Exec striving to raise the ratings of your station.\n\n  Create your own TV studio, build offices, hire actors, staff and directors\n  and create TV shows which will propel you up the ratings chart. But watch\n  your back as rival studios will try to sabotage your plans by stealing your\n  viewers, and those all important advertising dollars so don't be afraid to\n  bite back and do whatever it takes to be top dog!\n\n  Features:\n  ~~~~~~~~~\n  * Create your own crazy TV station and take it all the way to the top of\n    the rankings\n  * Fight for 8 different viewer groups and show your competitors whos boss\n  * Build offices, studios, newsrooms, writing rooms and many other important\n    facilities to help secure your success\n  * Create your own character and guide them through your hand built TV\n    Empire doing whatever it takes to be top dog\n  * Complete your advertising contracts by setting program schedules to\n    secure the best ad slots for companies\n  * Produce new programs to target your viewer groups including movies, game\n    shows, sit coms and even cooking shows\n  * Go up against cunning computer opponents or face off against up to 7\n    players\n  * Team up with a friend and run your studio together in co-op mode\n  * Fantastic soundtrack recorded live in the studio by the composers on real\n    instruments\n\n  URL: http://www.mud-tv.com\n\n  NOTE: We left the bin errors in intentionally, so you get a 1:1 copy of\n        the original image. These errors do not affect game data and are part\n        of the copy protection.\n\nINSTALLATION NOTES:\n\n  1. UnRAR\n  2. Burn the ISO with your favorite software.\n  3. Install game\n\nENJOY at last.. :)","torrent":{"xt":"urn:btih:bc41dab14c0f48af0fec03bbc9afec050f2e752b","amp;dn":"MUD+TV+from+Kalypso+media","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bc41dab14c0f48af0fec03bbc9afec050f2e752b","infoHashBuffer":{"type":"Buffer","data":[188,65,218,177,76,15,72,175,15,236,3,187,201,175,236,5,15,46,117,43]},"announce":[],"urlList":[]}}