{"title":"Native Instruments Komplete 5 INSTRUCTIONS","uid":7136401,"size":3088,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:bca89fae1ad0740be5e613164630cf05a61f7f97&amp;dn=Native+Instruments+Komplete+5+INSTRUCTIONS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"XzibiL3","files":1,"time":1332867333,"description":"You can either download the torrent or just read the instructions here:\n\n\n\nThese instructions are for installing Komplete from this website: &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/4248183/Native.Instruments.Komplete.5.VSTi.DXi.RTAS.AU.HYBRiD-DYNAMiCS&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/4248183/Native.Instruments.Komplete.5.VSTi.DXi.RTAS.AU.HYBRiD-DYNAMiCS&lt;/a&gt;\n\n\nHere are the instrucions......\n@Robjton (or anyone else having trouble installing the torrent)......To install program, first you need an ISO mounting program such as PowerISO or MagicISO. Then download the torrent. After torrent is downloaded follow these steps....(For Winows xp)\n1.Go to place where torrents are downloaded (usually in documents) and click on the file for komplete.\n2.Click on folder for disk1, it will be called Native.Instruments.Komplete.5.VSTi.DXI.RTAS.AU.Hybrid.DVDR.D01-Dynamics, it will open a folder containing several RAR files, click on the first one and it will open another window that contains the ISO file and the Updates folder. Click on the ISO file and it will extract it and open your ISO program.\n3)When the ISO program is opened, locate mount on the program, and click mount image to drive(whatever letter it says, ex:[F:] or [H:] or [I:]) \n4)Then, this is the tricky part,(At least for me it was), you need to locate the ISO file within your computer, i found mine in C:Documents and SettingsCodyLocal SettingsTemp(Cody being my user name)NOTE:to be able to view your local settings you need to enable Show hidden files... to do this go to My Computer then click Tools in the menu bar then click Folder Options then go to the View tab then locate Show hidden files and folders and enable showing them...The folder your looking for in Temp is called something like Rar$DIa0.075( the number varies for each RAR file) to locate hover mouse over the folder and look for file called dyn-nik5di.iso\n5) Once the file is located, click on the file and it will mount the ISO. a window should open that contains the files within the ISO(If not, then go to my computer and look for the drive under the  Devices with Removable Storage area) the drive should be called something like Komplete5(H:)click on it and it will open the drives contents.\n6) I recommend clicking on the Komplete5.exe and not the Kompletesetup.exe, because the kompletesetup.exe will basically just extract the komplete.exe file so its alot easier to just click on the Komplete.exe file\n7)Once the setup starts, configure it how you want it and then it will install komplete on your computer. BUT it will not install the Libraries...\n8) To install the Libraries, you need to follow steps 1-5 except find the files for the current folder you clicked on such as disk2 or whatever.\nIMPORTANT: Just installing this program will not activate ANY of the programs.....to activate the programs you need to update them... to update them go back to the first file called:Native.Instruments.Komplete.5.VSTi.DXI.RTAS.AU.Hybrid.DVDR.D01-Dynamics, and open the updates folder then run all the updates for the programs.....Then your programs will be updated.\nFor the latest version on massive (Massive v:1.1.5) click this link...http://thepiratebay.se/torrent/6237375\nFor the latest version of Reaktor (Reaktor v:5.6.1) go\nFor a program for Reaktor called Razor(A very awesome program!!!) go to.......http://thepiratebay.se/torrent/6851102","torrent":{"xt":"urn:btih:bca89fae1ad0740be5e613164630cf05a61f7f97","amp;dn":"Native+Instruments+Komplete+5+INSTRUCTIONS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bca89fae1ad0740be5e613164630cf05a61f7f97","infoHashBuffer":{"type":"Buffer","data":[188,168,159,174,26,208,116,11,229,230,19,22,70,48,207,5,166,31,127,151]},"announce":[],"urlList":[]}}