{"title":"Byzantium Linux v0.1a","uid":7074687,"size":331594705,"categoryP":"applications","categoryS":"unix","magnet":"?xt=urn:btih:bd63a89532941f4213cb01645f8688d9e5e765f9&amp;dn=Byzantium+Linux+v0.1a&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"warehouse23","files":5,"time":1330794458,"description":"ANNOUNCING BYZANTIUM LINUX V0.1a (Scarab)\nApproved for: GENERAL RELEASE, DISTRIBUTION UNLIMITED\n\nProject Byzantium, a working group of HacDC (http://hacdc.org/) is proud to announce the release of v0.1 alpha of Byzantium Linux, a live distribution of Linux designed to fulfill a crucial role in the evolution of the Internet.  That role is a rapidly deployable ad-hoc wireless mesh network which can augment or replace the current telecommunications infrastructure in the event that it is knocked offline (for example, due to a natural disaster) or rendered untrustworthy (widespread surveillance or disconnection by hostile entities).  Unlike other mesh networking projects Byzantium was designed to be run on any x86 computer with at least one 802.11 a/b/g/n wireless interface.  Byzantium can be burned to a CD- or DVD-ROM (the .iso image is just over 300 megabytes in size), booted from an external hard drive, or can even be installed in parallel with an existing operating system without risk to the user's data and software.  Byzantium Linux will then act as a node within the mesh and will automatically connect to other mesh nodes and act as an access point for WiFi-enabled mobile devices.\n\nTHIS IS AN ALPHA RELEASE!  Do NOT expect Byzantium to be perfect.  Some features are not ready yet, others need work.  Things are going to break in weird ways and we need to know what those ways are so we can fix them.  Please, for the love of LOLcats, do not deploy Byzantium in situations where lives are at stake.\n\nFEATURES:\n- Binary compatible with Slackware v13.37, so existing packages can be converted with a single command.\n- Able to act as a gateway to the Internet if a link is available.\n- Linux kernel v2.6.38.8\n- Drivers for dozens of wireless chipsets\n- KDE v3.5\n- LXDE (2010 release of all components)\n- Mplayer\n- GCC v4.5.2\n- Perl v5.12.3\n- Python v2.6.6\n- Firefox v4.0.1\n- X.org v7.4 (? - hard to tell because each module has its own release code)\n- Custom web-based control panel\n\nSYSTEM REQUIREMENTS (to use)\n- Minimum of 512MB of RAM\n- i586 CPU or better\n- CD- or DVD-ROM drive\n- BIOS must boot removable media\n- At least one (1) 802.11 a/b/g/n interface\n\nSYSTEM REQUIREMENTS (for persistent changes)\n- The above requirements to use Byzantium\n- 2+GB of free space on thumbdrive or harddrive\n\nWHAT WE NEED:\n- Developers.\n- Developers!\n- DEVELOPERS!\n- No more Bill Ballmer impersonations.\n- People downloading and running Byzantium to find bugs and tell us where the problems are so we can fix them.\n- People filing bug reports on our Github page (https://github.com/Byzantium/Byzantium/issues).  We can't fix what we don't know about!\n- People submitting patches.\n- People booting Byzantium and setting up small meshes (2-5 clients) to tell us how well it works for you with your hardware.  We have a hardware compatibility list on our wiki that needs to be expanded.\n- People who can help us translate the user interface.  We especially need people fluent in dialects of Chinese, Arabic, Farsi, and Urdu.\n- People to help us write and translate documentation.\n\nHomepage: http://wiki.hacdc.org/index.php/Byzantium (website coming soon)\nDownload sites: http://wiki.hacdc.org/index.php/Downloading_Byzantium\n\nThis announcement is published under a Creative Commons By Attribution / Noncommercial / Share Alike v3.0 License. (http://creativecommons.org/licenses/by-nc-sa/3.0/)\n","torrent":{"xt":"urn:btih:bd63a89532941f4213cb01645f8688d9e5e765f9","amp;dn":"Byzantium+Linux+v0.1a","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bd63a89532941f4213cb01645f8688d9e5e765f9","infoHashBuffer":{"type":"Buffer","data":[189,99,168,149,50,148,31,66,19,203,1,100,95,134,136,217,229,231,101,249]},"announce":[],"urlList":[]}}