{"title":"Kink.com The upperfloor-------tUF-17889 Dylan, Derrick Pierce, ","uid":7167558,"size":2502927002,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:be3803a1c866282e4210305d5af1741fd95f99f7&amp;dn=Kink.com+The+upperfloor%5C-------tUF-17889+Dylan%2C+Derrick+Pierce%2C+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"merzedes","files":1,"time":1333831844,"description":"Kink.com The upperfloortUF-17889 Dylan, Derrick Pierce, Lily LaBeau, Krysta Kaos and Skin Diamond MP4 only\n\n\nThe Wmv and pics is here &lt;a href=&quot; http://thepiratebay.se/torrent/7167054/Kink.com_The_upperfloor-----tUF-17889_Dylan__Derrick_Pierce__Li&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://thepiratebay.se/torrent/7167054/Kink.com_The_upperfloor-----tUF-17889_Dylan__Derrick_Pierce__Li&lt;/a&gt;\n\n\n\nHouse slave ash was just getting comfortable in her new house slave collar when trainee lily labeau comes to serve the house, entering into contest for ashs collar. Lily has the advantage of having been through 7 days of slave training under The Pope and a natural submissive demeanor. \n\nBoth slaves are wheeled into the dining room to delighted guests. They are presented, literally on a platter, to Derrick Pierce to determine who gives the best blow job between the two. While both gorgeous girls are well trained and cock hungry, lily pulls to the front of the race and sets ash on edge. The rest of the night is a battle for the attentions of Derrick Pierce, The Pope, and Tommy. Simone and her Master get dirty on the fuck table, squirting everywhere and being made to lick it all up. Sahara Rain and Natalya StarLite passionately kiss while Natalyas Master tortures both their sensitive pussies with hitachis. Mistress UV and Torque string up a beautiful woman and give her the corporal session worthy of her screams while Coral Aorta pleasures herself watching the slaves in action. \n\nThe surprise of the night is a mysterious and beautiful house guest who decides to challenge both slaves at their own game and jumps on Derricks cock while they are both busy eating each others pussies. Derrick has his pick, and works his way through all the slaves, eventually creating a tidal wave in tramp that leaves the party in temporary silence. The matter of ashs collar is settled with a tense drilling on positions, but the matter of whom Derrick decides to leave his load becomes a battle between all The Upper Floors beautiful ladies and slaves. \n\n\nScreens &lt;a href=&quot; http://www.theupperfloor.com/site/shoot.jsp?shootId=17889&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.theupperfloor.com/site/shoot.jsp?shootId=17889&lt;/a&gt;\n\n\nCheers  :-)\t","torrent":{"xt":"urn:btih:be3803a1c866282e4210305d5af1741fd95f99f7","amp;dn":"Kink.com+The+upperfloor%5C-------tUF-17889+Dylan%2C+Derrick+Pierce%2C+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"be3803a1c866282e4210305d5af1741fd95f99f7","infoHashBuffer":{"type":"Buffer","data":[190,56,3,161,200,102,40,46,66,16,48,93,90,241,116,31,217,95,153,247]},"announce":[],"urlList":[]}}