{"title":"ef a tale of memories (dual audio)","uid":7179586,"size":6337023587,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:be8a873bc239fc80741d024775a30b9bd2de3765&amp;dn=ef+a+tale+of+memories+%28dual+audio%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":12,"time":1334222352,"description":"On Christmas Eve, Hiro Hirono's bike is stolen by a girl chasing a thief who stole her purse. He gives chase and finds her unconscious and his bike ruined. The girl, Miyako Miyamura, soon awakes and the two begin to talk. After making sure she is okay, they end up spending Christmas Eve together. Later, Hiro finds out Miyako attends the same school as him and they begin to spend more and more time together, Miyako developing affections for Hiro. Kei Shindou -- Hiro's childhood friend who has long held a crush on him -- begins to become jealous and a love triangle follows. \n\nThe series also tells the story of Renji Asou. One day, he meets Chihiro Shindou, the twin sister of Kei Shindou, at an abandoned train station. Even though she's very shy, they get along pretty well and begin meeting at the same spot everyday. However, Renji finds out that Chihiro was in a car accident years ago and as a consequence she suffers from a disability: her memory lasts only 13 hours. Nevertheless, after learning that Chihiro's dream is to write a novel, Renji finally decides to help her fulfill her dream while also trying to make her overcome the difficulties imposed by her condition.\n","torrent":{"xt":"urn:btih:be8a873bc239fc80741d024775a30b9bd2de3765","amp;dn":"ef+a+tale+of+memories+%28dual+audio%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"be8a873bc239fc80741d024775a30b9bd2de3765","infoHashBuffer":{"type":"Buffer","data":[190,138,135,59,194,57,252,128,116,29,2,71,117,163,11,155,210,222,55,101]},"announce":[],"urlList":[]}}