{"title":"NoteAbility Pro v. 2.509 with [K]rack","uid":7074648,"size":49932119,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:c12f1c943d9e29dd72f93bb0aa5c015308ee67fe&amp;dn=NoteAbility+Pro+v.+2.509+with+%5BK%5Drack&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"polisdavid","files":-1,"time":1330793339,"description":"Official Web Site: &lt;a href=&quot; http://www.macupdate.com/app/mac/15546/noteabilitypro&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.macupdate.com/app/mac/15546/noteabilitypro&lt;/a&gt;\n\nNoteAbilityPro is a professional music notation package for the Macintosh OS X operating system. Developed by Dr. Keith Hamel at the University of British Columbia, it is easily the most sophisticated music notation software available on any platform. NoteAbility combines both musical intelligence and graphical flexibility in a direct and intuitive graphical user interface. Notate anything from simple melodies to complex avant garde orchestral music, play the score on your MIDI synthesizer or using Quicktime Musical Instruments and print a publishable copy of your score on any Mac OS X compatible printer.\n\nIf you have been frustrated by the awkwardness and inflexibility of other notation programs, or by the time it takes to learn them, then you definitely should have a look at NoteAbility Pro.\n\nThe demo version of NoteAbilityPro is a complete working copy of the program with some functions disabled. You are not allowed to save files, copy or export in certain formats, and printing is restricted to the first page only. Just follow the simple installation notes, and the OS X Installer application will ensure that all required files are installed into the correct locations.\n\nWhat's New:\n\n* Some minor bug fixes to beam redrawing were made\n\n* Some buttons were added to the Entry Cursor to facilitate adding \n  accidentals, inserting rests or undoing during note entry. The buttons\n  appear on the right side of the Entry Cursor. The sharp button raises the \n  note by a semitone (i.e. if it is natural it becomes sharp, if it is flat, it\n  becomes natural) and the flat button lowers the note by a semitone (if it\n  is flat it becomes double-flat, if it is sharp it becomes natural). The\n  insert rest button inserts a rest with the same duration value as the note\n  specified in the current command, and the undo button reverses the last\n  change to the score.\n\nSystem Requirements:\n\nPPC / Intel, Mac OS X 10.4 or later\n\n--- PLEASE SEED ---\n\n\n\n\n","torrent":{"xt":"urn:btih:c12f1c943d9e29dd72f93bb0aa5c015308ee67fe","amp;dn":"NoteAbility+Pro+v.+2.509+with+%5BK%5Drack","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c12f1c943d9e29dd72f93bb0aa5c015308ee67fe","infoHashBuffer":{"type":"Buffer","data":[193,47,28,148,61,158,41,221,114,249,59,176,170,92,1,83,8,238,103,254]},"announce":[],"urlList":[]}}