{"title":"Asfur.S01E01.XviD-GeneralM","uid":7337415,"size":309755766,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:c2b0bca5487436b818d5fec268dac8d63bc6a4de&amp;dn=Asfur.S01E01.XviD-GeneralM&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"nerya40","files":1,"time":1339107869,"description":"Motti Amoyal lives on a bus farm in Jerusalem with his three best friends, Itzik, Newton and Katzar. Their lives are about to change drastically as they discover that the land, on which Motti built the farm, holds an enormous debt to city hall because of his late grandfather's past disputes over garbage dumping. The city threatens to repossess the land because of the future profit from zoning plans. Amit Peled, an insurance agent who works for his overly demanding father, accidentally discovers the zoning plans and visits the farm in order to buy it. He arrives there with his girlfriend Shir, who sees Motti and they both recall that they were romantically involved during a trip to India.\n\nUpon learning of the zoning plans, the four friends realize that keeping the farm is their chance of redeeming their lives. From that moment on, it becomes a race against time for them. They try every possible scheme, be it working on a taxicab they &quot;borrow&quot; from the repair shop where Itzik works, laundering the lottery Grand Prize through the black market, stealing from houses, gambling online, selling drugs or even committing armed robbery for a criminal lord. The season's plot mainly revolves around their adventures, as well as the intricately woven relationship between Shir and Motti, along with other romantic complications.","torrent":{"xt":"urn:btih:c2b0bca5487436b818d5fec268dac8d63bc6a4de","amp;dn":"Asfur.S01E01.XviD-GeneralM","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c2b0bca5487436b818d5fec268dac8d63bc6a4de","infoHashBuffer":{"type":"Buffer","data":[194,176,188,165,72,116,54,184,24,213,254,194,104,218,200,214,59,198,164,222]},"announce":[],"urlList":[]}}