{"title":"Social Pro 2.0.4 RE  BlackAngelDooms","uid":7117036,"size":9921722,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:c2b624e09fd6a95ff6eb95a99d3dafe8d10af218&amp;dn=Social+Pro+2.0.4+RE++BlackAngelDooms&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"BlackAngelDoom","files":1,"time":1332243801,"description":"\nBlackAngelDooms RE! Mean to be simple, clean and easy!\nBuy software, support developer\n\nSocial Pro 2.0.4\n\nSocial accounts management app!\n\nSocial Pro is a handy and reliable social media manager designed for multiple social accounts. Social Pro is a collection of social management tools that is ideal for people who use multiple social network accounts. It saves you time by following statuses on Facebook, Twitter and Gmail at one single application.\n\nNo more jumping from site to site to monitor, update and engage your social services at the speed of real time. No need to open it up in a web browser, or have it clutter your workspace. With the advanced instant notification, Social Pro is the most comprehensive solution on the market.\n\nIf you have multiple email and social networking accounts and you're looking to manage all your favorite services at one single application - Social Pro is the solution for you. Social Pro is designed to bring back the fun and simplicity of online social networking. While it is important to keep track of those special to us through our social networks and services, having to constantly log and re-log onto separate sites on different windows can become a painful and tedious task.\n\nSocial Pro makes it easier than ever to stay updated with your family and friends by alerting you of all recent posts from your social services. With a quick glance and you can see all your messages and updates from Facebook, Google+, Twitter and emails from Gmail instead of having to log onto separate sites for their services.\n\nSocial Pro is also compatible with your instant messengers on Facebook and gTalk buddies. You can receive notifications of new messages and incoming chat requests from the menu bar. Previews of messages are available in multicolored notification bubbles designed to differentiate the services for better readability.\n\nRequirements:\n\nÂ· Internet Connection\nÂ· Facebook / Twitter / Gmail account\n\n\nNote:\n1. Continue seed coz my net so slow\n2. Run exe file\n3. Enjoy and ready to work\n4. Support dev, buy software if used often\n5. :thumbsup: Seed more :thumbsup:\n\n\nVirus Issue\nCreated, Tested, scanned in Windows XP SP3 with KIS 2012, NETFX 2.0 and DeepFreeze\n\ndon't forget give comment, let we know work or not.\nPlease spare more time for seed, my upload very low.\n\nBlack Angel Doom\nJust call me ÂµBaDÂµ","torrent":{"xt":"urn:btih:c2b624e09fd6a95ff6eb95a99d3dafe8d10af218","amp;dn":"Social+Pro+2.0.4+RE++BlackAngelDooms","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c2b624e09fd6a95ff6eb95a99d3dafe8d10af218","infoHashBuffer":{"type":"Buffer","data":[194,182,36,224,159,214,169,95,246,235,149,169,157,61,175,232,209,10,242,24]},"announce":[],"urlList":[]}}