{"title":"Lost Girl Complete Season 1 ","uid":7036001,"size":4765498566,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:c3450c4f84ebd4e8c8a099e633672606bf9ca58e&amp;dn=Lost+Girl+Complete+Season+1+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":6,"uploader":"stu181","files":13,"time":1329386328,"description":"\n    Ep 13 Blood Lines\n   \n    Bo learns who her mother is and that those closest to her have been keeping secrets. Feeling betrayed, Bo decides to track down her mother on her own. To protect the woman he loves Dyson visits an ancient Norn, amore\n    \n    Ep 12 Members Only\n    \n    To help an old friend of Kenzi's, Bo and Dyson pose as a married couple at a country club. The pressure of the charade pushes Dyson to tell Bo the truth about who she is, so he gives Trick an ultimatum.\n        \n    Ep 11 Faetal Justice\n    \n    Dyson wakes covered in blood and can't remember the last eight hours, he is accused of murdering Ba'al, a close associate of Vex, and takes refuge in Trick's bar, invoking sanctuary.\n        \n    Ep 10 The Mourning After\n    \n    While investigating a murder Bo meets Saskia, another Succubus. Bo believes she can learn a lot from Saskia, but she begins to reveal her true Dark Fae colours, testing the limits of their new friendship. Kenzi helps Trick as hemore\n        \n    Ep 9 Fae Day\n    \n    A Banshee wail predicts that someone in Trick's bar will die in the next 12 hours. On the Banshee's trail Bo and Dyson learn the name of the Light Fae who's marked for death and his last wish is formore\n        \n    Ep 8 Vexed\n\n    Bo's gets a lead on information about her mother. The trail goes cold with Lou Ann, a death row inmate claiming not to know anything at all. Desperate to prove otherwise, and convinced Lou Ann is innocent, Bo uses allmore\n       \n    Ep 7 ArachnoFaebia\n   \n    After a bloody murder-suicide in a human house, Kenzi decides to run a &quot;Shaman&quot; scam to spiritually cleanse the home. Afterwards, she fails to realise that she has brought back a venomous Fae spider whose bite makes people psychotic.\n        \n    Ep 6 Food for Thought\n \n    Kenzi becomes deathly ill when she inadvertently eats some toxic &quot;human soup&quot; at the home of an Aswang. Bo and Lauren embark on a daring undercover mission together in search of a cure at a powerful pharmaceutical company, while Dyson and Trick help Kenzi fight for her life.\n       \n    Ep 5  Dead Lucky\n  \n    Bo investigates how Mayer, a Dark Fae bookie, was scammed by a human gambler, in exchange for time with his niece, an oracle who can give her information about her parents. Things get creepy when Bo and Kenzi discover themore\n       \n    Ep 4 Faetal Attraction\n   \n    Bo places a woman under her protection after a Fury with an unfaithful mate tries to hire Bo to kill her. When the case takes a turn for the worse Bo is left scrambling to contain a mess of jealousymore\n      \n    Ep 3  Oh Kappa, My Kappa\n   \n    Bo and Kenzi open a private investigation office, and on their first job they go undercover on the local college campus to find a missing coed, digging into the mysterious underbelly of the school's sorority system and discovering a surprising Fae connection putting both their lives in jeopardy.\n       \n    Ep 2 Where There's A Will, There's A Fae\n    \n    Bo agrees to help Will, a real will-o'-the-wisp, find the person who stole his treasure in exchange for information on her birth-parents. As Bo begins to find the truth about the thief, she delves further into the world of the Fae.\n       \n    Ep 1  It's A Fae, Fae, Fae, Fae World\n   \n    Bo has been living on the run for years, killing people when she kisses them. After leaving someone she kills out in the open, she is swept into the secret world of the Fae. She discovers who and what she","torrent":{"xt":"urn:btih:c3450c4f84ebd4e8c8a099e633672606bf9ca58e","amp;dn":"Lost+Girl+Complete+Season+1+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c3450c4f84ebd4e8c8a099e633672606bf9ca58e","infoHashBuffer":{"type":"Buffer","data":[195,69,12,79,132,235,212,232,200,160,153,230,51,103,38,6,191,156,165,142]},"announce":[],"urlList":[]}}