{"title":"Spaceporn Wallpaper Collection (1920x1080)","uid":7181282,"size":138353284,"categoryP":"other","categoryS":"pictures","magnet":"?xt=urn:btih:c543f27d4ad33f4227c47743cb4254bd7a7b2f93&amp;dn=Spaceporn+Wallpaper+Collection+%281920x1080%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Cylinc69","files":1,"time":1334275961,"description":"Thank you for downloading these wallpapers. There are about 180 of them, and they are custom fit for 1920x1080 screens. I have collected them over quite some time, and I want to share them with everyone. They are from various sources including Hubble, other NASA projects, and ESO. Some of them might be copyrighted so I implore you to refrain from using them for commercial purposes. I find it best if you are using windows 7, or some other software background switcher. That way, you can shuffle between the entire folder.\n\nShare these images however you like. Just keep in mind the scientists and astronomers who helped to bring us these stunning images.\n\n&quot;We on Earth have just awakened to the great oceans of space and time from which we have emerged. We are the legacy of 15 billion years of cosmic evolution. We have a choice: We can enhance life and come to know the universe that made us, or we can squander our 15 billion-year heritage in meaningless self-destruction. What happens in the first second of the next cosmic year depends on what we do, here and now, with our intelligence and our knowledge of the cosmos.&quot;\n\n-Carl Sagan\n\nI'm glad that you, too, appreciate the beauty of our Universe.\n\n-Mesthione\n","torrent":{"xt":"urn:btih:c543f27d4ad33f4227c47743cb4254bd7a7b2f93","amp;dn":"Spaceporn+Wallpaper+Collection+%281920x1080%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c543f27d4ad33f4227c47743cb4254bd7a7b2f93","infoHashBuffer":{"type":"Buffer","data":[197,67,242,125,74,211,63,66,39,196,119,67,203,66,84,189,122,123,47,147]},"announce":[],"urlList":[]}}