{"title":"Petty.Romance.DVDRip.Xvid-aKKoe","uid":7166361,"size":682307523,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:c83b601b80feca5c9c3876d223c77df5ba337290&amp;dn=Petty.Romance.DVDRip.Xvid-aKKoe&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"T3mp3r","files":5,"time":1333787396,"description":"I didn't expect much at all from this movie, in fact maybe it's because I had low expectations for this movie or something. But I found myself really enjoying this romantic comedy for adults. I didn't really find humor in Korean movies all that funny, but it really works in this one. I got some genuine laughs and chuckles from watching this. I never really liked Lee Sun-Gyun as an actor in some of the movies he is in, mainly because of his mannerism and they way he talks but it worked in this movie. And his character was actually sort of likable for the most part. The actress Choi Gang-Hee played a character that starts off sort of irritating to watch but becomes likable bit by bit as the plot progresses. I am not sure it that was intentional or not but it went down that way. The plot is about Jung-Bae(Lee Sun-Gyun) the cartoonist who is trying to win money by winning a adult manhwa contest and hires Da-Rim(Choi Gang-Hee) who works on adult magazines as a writer. Yes, the plot is predictable sometimes but has many elements that make it from being a generic romantic comedy for adults. Definitely worth seeing, it's basically a well crafted romantic comedy for adults with a great execution. The score would have been hire from me if it pulled some really unpredictable stuff, but still one of the best adult romantic comedy for 2010 despite it's formulaic direction sometimes.","torrent":{"xt":"urn:btih:c83b601b80feca5c9c3876d223c77df5ba337290","amp;dn":"Petty.Romance.DVDRip.Xvid-aKKoe","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c83b601b80feca5c9c3876d223c77df5ba337290","infoHashBuffer":{"type":"Buffer","data":[200,59,96,27,128,254,202,92,156,56,118,210,35,199,125,245,186,51,114,144]},"announce":[],"urlList":[]}}