{"title":"ExploitedCollegeGirls - Shay.wmv","uid":7130271,"size":1001474107,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:c84248df1990298d4f87da3ab720fd2f0ca4a4aa&amp;dn=ExploitedCollegeGirls+-+Shay.wmv&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"SplashPt","files":-1,"time":1332683192,"description":"ExploitedCollegeGirls - Shay.wmv\n\n\nDescription:\n\nSo this is what happens when a young lingerie model, who is so busy that she hasn't even started college yet, decides to shoot her first porn movie. Instead of the usual glitzy photo studio, 18 year old Shay finds herself in a cramped hotel bathroom, putting on her makeup while this stranger with a camcorder asks her questions. The kind of questions they don't usually ask on photo shoots, like when she lost her virginity. She hasn't had a lot of different guys in her life and we'll soon see how that affects her sexual know-how. The most interesting tidbit we learn when Shay reveals that she has never masturbated with sex toys before. In fact she claims to almost play with herself. So of course that's on Jay's priority list now. After exploring her fine ass a little, Jay gets her to remove her top. Her perky tits feel perfect but more importantly this little &quot;invasion&quot; sends a signal to Shay that this isn't going to be an ordinary day. Her life is about to change forever. Shay knows today will be about sex, but to what extent she has no idea yet.\nBut before anything can happen, Shay needs some serious relaxing time. The girl is pretty nervous and tense about doing her first porno shoot. She picks out her outfit (not that it matters 'cuz it comes off in about 2 seconds...) and is told to sit down on the bed for some more talk and boob grabbing. The girl is ridiculously hot and Jay can't wait to play with her pussy and eat her out. I'd like to say that she immediately has some mind blowing orgasms but that's not the case yet. Shay is still too tense to fully enjoy herself, but it's clear from her facial expressions that she wants to cum, but doesn't allow herself to do so. Shay keeps biting her lips, either when she tries not to cum, or when she isn't sure what's going to happen next. Both happens frequently. She is inexperienced with all this and it shows - and we love it!...\n\n\nTags: Hardcore, Teen, XxX, Blowjob, Doggystyle, Facial, Fuck\n\nResolution:   768x432\n\nDuration:     01:10:24\n\t\nSize:\t      955 MB\n\nScreens:\n &lt;a href=&quot;\nhttp://imgnix.com/show.php/2112_00.jpg.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgnix.com/show.php/2112_00.jpg.html&lt;/a&gt;\n &lt;a href=&quot;\nhttp://imgnix.com/show.php/2111_01.jpg.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgnix.com/show.php/2111_01.jpg.html&lt;/a&gt;\n\n\nor\n\n &lt;a href=&quot;\nhttp://p2pbay.me/torrents-details.php?id=1802&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://p2pbay.me/torrents-details.php?id=1802&lt;/a&gt;","torrent":{"xt":"urn:btih:c84248df1990298d4f87da3ab720fd2f0ca4a4aa","amp;dn":"ExploitedCollegeGirls+-+Shay.wmv","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c84248df1990298d4f87da3ab720fd2f0ca4a4aa","infoHashBuffer":{"type":"Buffer","data":[200,66,72,223,25,144,41,141,79,135,218,58,183,32,253,47,12,164,164,170]},"announce":[],"urlList":[]}}