{"title":"KSP Kerbal Space Program 0.14.1","uid":7114370,"size":160505124,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:c872400166fce345c105e31ae83934a9f5f60fd7&amp;dn=KSP+Kerbal+Space+Program+0.14.1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"sarsars","files":-1,"time":1332175774,"description":"This game is under heavy development. Also due to the fact they can not keep their servers up for more than 5 seconds, this is here. The updater WILL NOT WORK if you have not actually bought the game but you are free to delete it. Nothing bad will happen if you do.\n\n\n\nKerbal Space Program is a game focusing on making your own space program. Yes, that's it. But it does not end there, oh no; even though there are currently only three engines (more can be added with mods) it's the almost endless combinations possible that makes this so enjoyable to play. You see, much like real space rockets this game features multistage rockets that you design and create. Setting up these multistages is easy, though it can become rather complicated when your rocket has a gazillion stages.\nThere is no real goal. You might want to achieve a stable orbit around the planet or just reach for the stars. You can also satisfy your competetive side of yourself and challenge your friends to a game of &quot;who-can-reach-the-highest-altitude&quot; or &quot;can-you-get-to-the-moon-and-back-safely?&quot;.\nAnd have you ever wanted to prove to NASA how lousy their space rockets are? This is the time to prove to them how wrong they are in their designs!\n\nKerbal Space Program is currently in alpha: To quote the developers:\n\nThe game is currently under heavy development. This means the game will be improved on a regular basis, so be sure to check back for new updates.\nRight now, KSP is in Alpha state, but we want you to try it out and have fun with it. The first versions are free to download and play, and will remain so forever.\n\nThe KSP Team is strongly commited to the project, and we are always listening for feedback from the players.\nIf you have any questions, comments and ideas, please contact us, or join us on the Forums.\n\nTrailer/teaser for the game:\n\nInstructions:\nUnrar\nPlay","torrent":{"xt":"urn:btih:c872400166fce345c105e31ae83934a9f5f60fd7","amp;dn":"KSP+Kerbal+Space+Program+0.14.1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c872400166fce345c105e31ae83934a9f5f60fd7","infoHashBuffer":{"type":"Buffer","data":[200,114,64,1,102,252,227,69,193,5,227,26,232,57,52,169,245,246,15,215]},"announce":[],"urlList":[]}}