{"title":"Khottabych 2006 English subtitles","uid":7190331,"size":1356206080,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:c93a9a71d7fab5e18c45cb1c4fd57c80ed2a1590&amp;dn=Khottabych+2006+English+subtitles&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"e1m0","files":-1,"time":1334594343,"description":"If you're reading this I'm guessing you're a nmap user and I thought that it would be nice to share the movie since I couldn't find it as a torrent file.\n\n\nduration: 1:31:21\nsize: 1293.38mb\nresolution: 720x368\nbitrate: 242 kb/s\ntype: divx\n\nKhottabych (2006) (English subtitles).&quot;Khottabych&quot; is a 2006 Russian comedy folk-tale by STV Film Company a remake of the 1956 Soviet film &quot;Old Khottabych&quot;. This film has little in common with the first film except for some central elements. It is based on the novel &quot;The Copper Jag of Old Khottabych&quot; by Sergey Oblomov.This is classic tale of genie in the bottle has been updated to encompass the evil corporations Russian mafia and the brand new online culture. If youve ever spent hours in chat rooms or chasing each other around in online shooters this movie is for you!A teenager named Gena is a hacker hooked on computers and the Internet. His girlfriend is fed up with him because he pays so little attention to her and so much to his electronic exploits such as defacing the www.microsoft.com web site.Attempting to mend his relationship with his girlfriend he buys an ancient jar from an Internet-auction and finds a genie residing in it. Per the fairy-tale tradition he is offered three wishes. First the genie named Hottabych by Gena prints a huge number of US$100 banknotes. Unfortunately Hottabych is not familiar with modern paper and the banknotes are printed on Egyptian papyrus. This later sets off a chain of events leading back to Gena... STV 2006. ","torrent":{"xt":"urn:btih:c93a9a71d7fab5e18c45cb1c4fd57c80ed2a1590","amp;dn":"Khottabych+2006+English+subtitles","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c93a9a71d7fab5e18c45cb1c4fd57c80ed2a1590","infoHashBuffer":{"type":"Buffer","data":[201,58,154,113,215,250,181,225,140,69,203,28,79,213,124,128,237,42,21,144]},"announce":[],"urlList":[]}}