{"title":"My Little Pony: Friendship is Magic S01E19 [HD 720p AC3 5.1]","uid":7035388,"size":477517990,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:c98fa12959b4fa12a04cf723c9421b81b6a2093a&amp;dn=My+Little+Pony%3A+Friendship+is+Magic+S01E19+%5BHD+720p+AC3+5.1%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"PHR16384","files":2,"time":1329358220,"description":"============\nGENERAL INFO\n============\nSHOW TITLE\tMy Little Pony: Friendship is Magic\nSEASON #\t1\nEPISODE #\t19\nEPISODE TITLE\t&quot;A Dog and Pony Show&quot;\nORIG. AIRDATE\t2011/03/11\nDIRECTOR(S)\tJames Wootton\nWRITER(S)\tAmy Keating Rogers\n\n============\nVIDEO\n============\nSOURCE\t\tiTunes download\nRUNTIME\t\t22m 04s\nRESOLUTION\t1280 x 720 px\nFRAMERATE\t23.976 FPS\nVIDEO CODEC\tH.264/MPEG-4 AVC\nCONTAINER\tMatroska MKV**\n\n============\nAUDIO\n============\nCHANNELS\t5.1 Dolby Digital Surround Sound\nBITRATE\t\t384kbps (64kbps per channel)\nSAMPLE RATE\t48 kHz\nAUDIO CODEC\tAC3\n\n\n============\nNOTES\n============\nI've been sitting on this one awhile.  There's a torrent out there of the complete first season of MLP:FiM, 26 ~450MB MKVs.  It pretty much preserves all the files from the late PonyArchive, all of which are iTunes rips with colour correction.  They all have pretty impressive video quality, expecially episodes 16 to 26.\n\nThere's one problem, however:  Episode 19 has messed up audio.  It's hard to hear immediately, but the 5.1 channels are mixed differently -- music, voices and sound effects bleed into every channel, when they're supposed to be largely separated (i.e. SFX and voice occupy the center channel, with background music on the Front and Back L/R channels).\n\nSo I downloaded a more recent iTunes rip from YayPonies (PA's successor), and spliced its correct audio stream with the old video stream.\n\nI would have made this part of a full season 1 torrent, but I'd rather wait for the differences between iTunes and the TV broadcasts to be corrected.  (Example: In this iTunes-derived version of S01E19, three of the six ponies are missing when Spike does his second Big No [12:41].  There are other animation flubs present in the iTunes files that aren't present in the TV broadcasts.)\n\n\nRegarding web seeds:  I only have space for about 3 of these videos.  Older ones will be deleted to make room.  Don't forget to keep seeding!\n\n\nScreenshots from this and other 450MB-MKV torrents can be viewed here:\nbitDOTlySLASHxEkKb5\n[printed like that since TPB refuses to display the normal URL]\n\n\n**MKV files are compatible with media players such as Media Player Classic, VLC, ALLPlayer, foobar2000 and PowerDVD.  For other compatibility, try installing The Combined Community Codec Pack, or consult the website of your preferred media player. &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Matroska&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Matroska&lt;/a&gt; &lt;a href=&quot;\nhttp://www.cccp-project.net/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.cccp-project.net/&lt;/a&gt;\n\n\n\nFYI:  &quot;Why MKV files and not MP4, or AVI, or M2TS?&quot;\n\n- MP4s can only normally store AAC audio and other MPEG-style audio streams.\n- AVI is an extremely limited and outdated container format (look up on Wiki what ridiculous things AVI can't do without forcing it to).  It's bad and you should feel bad.\n- M2TS adds over 20 MB of data to the file compared to MP4 or MKV.  Smaller size is everything.\n- MKVs can contain any and as many video, audio and subtitle streams as you want.  Matroska also happens to be an open format.\n\n\nDon't like MKVs?  Losslessly convert to another container, such as M2TS (which should be compatible with Xbox 360, PlayStation 3 and certain Bluray players), with these tools: &lt;a href=&quot;\nhttp://www.videohelp.com/tools/tsMuxeR&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.videohelp.com/tools/tsMuxeR&lt;/a&gt; &lt;a href=&quot;\nhttp://www.videohelp.com/tools/mkvtoolnix&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.videohelp.com/tools/mkvtoolnix&lt;/a&gt;\n\n\nPLEASE SEED LIKE CRAZY (That is, um, if you don't mind...)  Expect moar torrents from yours truly of single episodes, and another for the 2nd half of the season as the episodes come out; until then, I will continue to seed this and other single-video torrents that need it.\n\nEnjoy your ponies, and don't forget to support the show and its community!  :D\n\n\n~PHR\n============\n\n","torrent":{"xt":"urn:btih:c98fa12959b4fa12a04cf723c9421b81b6a2093a","amp;dn":"My+Little+Pony%3A+Friendship+is+Magic+S01E19+%5BHD+720p+AC3+5.1%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c98fa12959b4fa12a04cf723c9421b81b6a2093a","infoHashBuffer":{"type":"Buffer","data":[201,143,161,41,89,180,250,18,160,76,247,35,201,66,27,129,182,162,9,58]},"announce":[],"urlList":[]}}