{"title":"Smoke 'em If You Got 'em","uid":7060461,"size":44137652,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:cace47f82e9c5f5fdd0214fb706b2cac0e6d4b79&amp;dn=Smoke+%5C%27em+If+You+Got+%5C%27em&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"liamcline","files":-1,"time":1330327118,"description":"The Reverend Horton Heat\\'s first Sub Pop release (1992), @ V4 MP3 VBR 128-256 kbps.\n\nAllMusic.com says:\n\nGiven how the psychobilly/punk/greaser/whatever underground just seemed to grow and grow throughout the '90s, there's every reason in the world to choose this album as one of the things that sparked it off. Little doubt as to why, too, re-recorded on two-track after a more technically complex version was deemed to lack that certain something, Smoke 'Em If You Got 'Em fires up strong with &quot;Bullet&quot; and doesn't stop there. Heat's fierce guitar playing is just as perfectly matched by Bentley's anything-but-polite drumming and Wallace's low-end mania, while Heat's occasional wails and yodels add the frosting to a cake, which is very clearly devil's food if anything. From there it's a dozen anti-meditations on everything from the joys of meat eating -- &quot;Eat Steak,&quot; how much more direct can one get? -- to the demon weed &quot;Marijuana&quot; and the perfectly appropriate &quot;Psychobilly Freakout.&quot; Heat's killer punch is his wide-ranging approach -- AC/DC is as much a reference point for what the heck's going on, as is the classic western swing that inspires &quot;Baby, You Know Who&quot; and the fierce, kicking &quot;Bad Reputation.&quot; Imagining what the Bob Wills crew could have done with this one is a fun game to play, though it's doubtful Wills himself would have allowed a line like &quot;You're the kind of girl I like to eat&quot; to surface. It's all sleaze, it's all wrong, and it's all so very, very right. How can anyone say no to the type of song that's a classic swampy rock strut with in-yer-face drumming, fiery solos and a title like &quot;Big Dwarf Rodeo,&quot; after all? Credit as well for the great front cover photo that makes Heat look somewhere between the oiliest insurance salesman alive, a refugee from the Nudie suit modeling school, and Elmer Gantry. \n &lt;a href=&quot;\nhttp://www.allmusic.com/album/smoke-em-if-you-got-em-r182062/review&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.allmusic.com/album/smoke-em-if-you-got-em-r182062/review&lt;/a&gt;\n\nGreat band, great album, live in Victoria, BC May 17th, 2012 @ Club 919!","torrent":{"xt":"urn:btih:cace47f82e9c5f5fdd0214fb706b2cac0e6d4b79","amp;dn":"Smoke+%5C%27em+If+You+Got+%5C%27em","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cace47f82e9c5f5fdd0214fb706b2cac0e6d4b79","infoHashBuffer":{"type":"Buffer","data":[202,206,71,248,46,156,95,95,221,2,20,251,112,107,44,172,14,109,75,121]},"announce":[],"urlList":[]}}