{"title":"The Vampire Diaries (Season 1-3) DVDRip - PrinceNahin","uid":7326263,"size":25085219436,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:cc3e5c257356a22ba5bb43a9e51638518c063024&amp;dn=The+Vampire+Diaries+%28Season+1-3%29+DVDRip+-+PrinceNahin&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"PrinceNahin","files":-1,"time":1338763208,"description":"The series follows the life of Elena Gilbert (Nina Dobrev) a 17 year-old girl, who falls for a 162-year-old vampire named Stefan Salvatore (Paul Wesley).Their relationship becomes increasingly complicated as Stefan's vicious and malevolent older brother Damon Salvatore (Ian Somerhalder) returns with a plan to wreak havoc on the town and a revenge against his younger brother. Both brothers begin to show affection towards Elena, mainly because of her resemblance to their past love Katherine Pierce. It is revealed that Elena is a descendant of Katherine, who eventually returns with plans against the trio.\n\nThe series is set in the fictional town of Mystic Falls, Virginia, a town charged with supernatural history since its settlement of migrants from New England in the late 17th century. Other story lines revolve around the other inhabitants of the town, most notably Elena's younger brother Jeremy Gilbert (Steven R. McQueen), her best friends Bonnie Bennett (Katerina Graham) and Caroline Forbes (Candice Accola) and their mutual friends Tyler Lockwood (Michael Trevino) and Matt Donovan (Zach Roerig). The town's politics are orchestrated by descendants of the original founding families, all comprising a &quot;Founders' Council&quot;. Some of the founding families of Mystic Falls include the Salvatores, the Gilberts, the Fells, the Forbes and the Lockwoods. They guard the town mainly from vampires, although there are other supernatural threats such as werewolves, witches and ghosts.","torrent":{"xt":"urn:btih:cc3e5c257356a22ba5bb43a9e51638518c063024","amp;dn":"The+Vampire+Diaries+%28Season+1-3%29+DVDRip+-+PrinceNahin","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cc3e5c257356a22ba5bb43a9e51638518c063024","infoHashBuffer":{"type":"Buffer","data":[204,62,92,37,115,86,162,43,165,187,67,169,229,22,56,81,140,6,48,36]},"announce":[],"urlList":[]}}