{"title":"Faust 2011 DVDRip Sonata Premiere","uid":7128778,"size":1397254481,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:d0180733d18b4ca415b74619e525bd8280a7ec81&amp;dn=Faust+2011+DVDRip+Sonata+Premiere&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"klinho","files":2,"time":1332624376,"description":"Russian screenwriter and director Alexandr Sokurov's fifteenth feature film was shot on location in Spain and Iceland and is a loose adaptation of the classic German legend &quot;Faust&quot; by German writer and poet Johann Wolfgang von Goethe (1749-1832). It tells the story of scholar Heinrich Faust, a man with a great hunger for knowledge. Heinrich is not pleased with his mundane life, but when allured by Mephistopheles he becomes enchanted by a woman named Margarete.\n\nThis character-driven and dialog-driven voyage into the human psyche has a stringently structured narrative with continuous dialog and is an atmospheric, dramatic and visually exceptional movie experience which is distinctly directed by a masterful director who creates versatile perspectives and invigorating scenes with is characteristic use of colors and soft focus. His detailed period piece takes place in the Harz mountain chain of Northern Germany between the Weser and Elbe Rivers during the 19th Century and has adventurous milieu depictions which are complimented by Elena Zhukova's ardent production design and French cinematographer Bruno Delbonnel's noticeable photography.\n\nThis wandering, philosophical and in-depth study of character about a man who makes a life-altering compromise for the sake of knowledge, is significantly reinforced by the marvelous use of light and the engaging acting performances by Austrian actor Johannes Zeiler, Russian actor Anton Adasinskiy and the understated acting performance by Russian actress Isolda Dychauk in her second feature film role. The fourth and final part of Alexandr Sokurov's tetralogy about the nature of power and how it influences man, was preceded by &quot;Moloch&quot; (1999), &quot;Telets&quot; (2001) and &quot;The Sun&quot; (2005). It gained among other awards the Golden Lion at the Venice Film Festival in 2011.","torrent":{"xt":"urn:btih:d0180733d18b4ca415b74619e525bd8280a7ec81","amp;dn":"Faust+2011+DVDRip+Sonata+Premiere","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d0180733d18b4ca415b74619e525bd8280a7ec81","infoHashBuffer":{"type":"Buffer","data":[208,24,7,51,209,139,76,164,21,183,70,25,229,37,189,130,128,167,236,129]},"announce":[],"urlList":[]}}