{"title":"Gta san andreas","uid":7128049,"size":5070898468,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:d031f2ed56150dcd586d07d8a95bceb47c31ca7d&amp;dn=Gta+san+andreas+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Monst33r","files":517,"time":1332597537,"description":"The game introduces a brand new main character - Carla Johnson. The story takes place in the early 90s, when after five years, Carl returns home to Los Santos in the state of San Andreas. Los Santos is at first glance an ideal city for movie stars and millionaires, but is hidden behind a veneer of hard reality in the form of warring gangs, drug dealers and corrupt police. Carl's mother is murdered under mysterious circumstances, such as the family is falling apart and his childhood friends from drowning in a variety of problems. To make matters worse, Carl is falsely accused of murder and left him nothing more than to go on a road run, searching for truth and revenge. The venue will become a game the whole territory of the state of San Andreas, which is dominated by three major cities (Los Santos, San Fierro and Las Venturas). As another character in GTA: San Andreas will be Carl's brother Sweet Johnson or his sister Kendall Johnson. All three with some other friends (such as Smoke, Ryder) have to belong to the Orange Grove Families Gang, against which - as usual - there is another opposing gang, named here as The Ballas. Significant figures also become two corrupt cops Eddie Pulaski and Frank Tenpenny and will play a significant role as a man who will be in the care of the whole story about the perfect hairstyle, then the quality and assess the remarks ordinary pedestrians on the street :) Of course, becomes a many buildings in which you can enter. In the game you can even buy a casino, to become the operator and, if so getting richer (or poorer) players on the passions of their fellow citizens. Other interesting features of the game we can pinpoint the opportunity to swim or hull household, will be added as applicable bicycle. As for weapons, you can count with a shotgun, or an UZI pistols, all models correspond to the time course.\n\n\n\nMinimum requirements:\n\n1GHz Intel Pentium III or AMD Athlon processor\n256MB of RAM\n8x DVD-ROM Drive\nat least 3.6 gigabytes of free hard disk space on local\nCrats 64MB video with DirectX 9 (&quot;GeForce3&quot; or better)\n\n\nRecommended requirements:\n\nIntel Pentium 4 or AMD Athlon XP processor (or better)\n384 (+) MB of RAM\n16x DVD-ROM Drive\n4.7 gigabytes of free hard disk space on local\n128 (+) MB video times with support for DirectX 9 (&quot;GeForce FX&quot; or better)","torrent":{"xt":"urn:btih:d031f2ed56150dcd586d07d8a95bceb47c31ca7d","amp;dn":"Gta+san+andreas+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d031f2ed56150dcd586d07d8a95bceb47c31ca7d","infoHashBuffer":{"type":"Buffer","data":[208,49,242,237,86,21,13,205,88,109,7,216,169,91,206,180,124,49,202,125]},"announce":[],"urlList":[]}}