{"title":"PassMark OSForensics Professional 1.1.1002","uid":7339214,"size":42335525,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:d0ff21f95354f4adb6ca9e49d586a6bb7fe4b522&amp;dn=PassMark+OSForensics+Professional+1.1.1002&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"nikita200","files":3,"time":1339176567,"description":"OSForensics is a new digital investigation tool which lets you extract forensic data or uncover hidden information from computers. OSForensics has a number of unique features which make the discovery of relevant forensic data even faster, such as high-performance deep file searching and indexing, e-mail and e-mail archive searching and the ability to analyze recent system activity and active memory. OSForensics can build and let you view an events timeline which shows you the context and time of activities. You can even recover data and files that have been deleted by users. OSForensics comes with a built-in file viewer which lets you examine a file contents, properties and meta-data, as well as an e-mail viewer which is compatible with most popular mail client formats.\n\nWhat is new in v1.1.1002\n- Addressed problems with indexing many EML Email files. Code for the handling of EML files was completely re-written to be 80% more memory efficient. This can prevent crashes due to lack of memory when indexing large numbers of E-mails.\n- Fixed a bug in the Windows Login Passwords function preventing the help page opening correctly.\n- Fixed a crash bug when retrieving IE cookies on some systems. This correction was in common code used by several modules and so might correct other (unknown) issue.\n\nHome Page: http://www.osforensics.com","torrent":{"xt":"urn:btih:d0ff21f95354f4adb6ca9e49d586a6bb7fe4b522","amp;dn":"PassMark+OSForensics+Professional+1.1.1002","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d0ff21f95354f4adb6ca9e49d586a6bb7fe4b522","infoHashBuffer":{"type":"Buffer","data":[208,255,33,249,83,84,244,173,182,202,158,73,213,134,166,187,127,228,181,34]},"announce":[],"urlList":[]}}