{"title":"rthtyj","uid":7332080,"size":25315984,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:d2274460dc2406347c9e255ab5177dd1134c53a9&amp;dn=rthtyj&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":2,"time":1338938132,"description":"Kristina Rose, Shyla Stylez, Krissy Lynn, Aletta Ocean, Chanel Preston, Sadie Swede\n\n&quot;All Anal!\n'The Double Penetration Settlement' - Danny and Scott have been offered a challenge; the fastest to get to her house gets to fuck her. They arrive bursting into her house and Aletta calls it a tie. She requests double penetration as the reward!\n'The Anal Queen' - Big wet butts has the pleasure present you Shyla Stylez, the girl who has participated in the widest variety of Brazzers sites. Watch her amazing big boobs and her tight round ass get oiled up and fucked by John Strong!\n'Hot &amp; Lustful' - Kristina shakes her bubble butt while Manuel Ferrara pours some oil all over her sexy body. He then fucks her asshole and her yummy pussy really hard. She is hot, lustful and hungry for cock!\n'The Superior Posterior' - Krissy is horny as hell. Luckily for her, her friend Tony has set up a playmate for her. When she goes back inside the house, she's thrilled to find James Deen waiting for her. Time for some fun!\n'Juicy Plump Ass' - Sadie enters the bathroom and starts watering and oiling her ass. Johnny is waiting for her to finish oiling her big ass. Johnny is waiting for her to finish oiling her big ass to worship it and fuck it like there's no tomorrow!&quot;\n\n\n\n\n\n\n\n         ","torrent":{"xt":"urn:btih:d2274460dc2406347c9e255ab5177dd1134c53a9","amp;dn":"rthtyj","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d2274460dc2406347c9e255ab5177dd1134c53a9","infoHashBuffer":{"type":"Buffer","data":[210,39,68,96,220,36,6,52,124,158,37,90,181,23,125,209,19,76,83,169]},"announce":[],"urlList":[]}}