{"title":"In Memoria di Me 2007 DVDRip Sonata Premiere","uid":7162976,"size":733552294,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:d37cb9db4c216ab22b3f196477183e87b3df6763&amp;dn=In+Memoria+di+Me+2007+DVDRip+Sonata+Premiere&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"klinho","files":2,"time":1333678051,"description":"Andrea is an intelligent, handsome young man who seems to have everything necessary to succeed. But the worlds infinite possibilities have only confused him. In this disoriented state, he undertakes the novitiate, a period of spiritual training leading to priesthood. Within the large religious community of novices, Father Superiors and retired priests, Andrea discovers more than a simple world of semi-silence and prayer. The monastery becomes a mysterious universe where every look, every sound, reveals intrigue as the novices are encouraged to denounce one anothers shortcomings. Daily routines, rituals and readings are marked by constant surveillance and questioning, as the novices struggle to lose themselves on behalf of God.\n\nAndreas attention turns to the nervous Fausto, obviously tormented and not a strong public speaker. Andrea is also shaken by his encounters with zealous novice Zanna, who rebelliously accuses the novitiate and the Church itself of using Gods Word to gain power and influence. In comparison, Andrea begins to profoundly feel he is merely feigning faith.\n\nDespite strong support from the Father Superior, Andrea flounders on his mystical test of absolute faith. As his frustration for solid answers grows, he risks to abandon the Order like others before him","torrent":{"xt":"urn:btih:d37cb9db4c216ab22b3f196477183e87b3df6763","amp;dn":"In+Memoria+di+Me+2007+DVDRip+Sonata+Premiere","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d37cb9db4c216ab22b3f196477183e87b3df6763","infoHashBuffer":{"type":"Buffer","data":[211,124,185,219,76,33,106,178,43,63,25,100,119,24,62,135,179,223,103,99]},"announce":[],"urlList":[]}}