{"title":"Falling Backwards.epub","uid":7190643,"size":8933606,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d4268036dcd49cddfc62ffce40efeaba910369aa&amp;dn=Falling+Backwards.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"tduckin","files":-1,"time":1334607509,"description":"PER REQUEST \n\nJann Arden is funny. And sincere. She has legions of devoted fans. And a radio show. She is a darling of the music scene - always candid, always unplugged. You thought you knew Jann Arden, but there is more - to her readers' delight, in Falling Backwards Jann reveals her childhood, her bond with family, her struggle in the formative years and what keeps her so grounded in the whirlwind entertainment industry. Jann has always been true to herself, except for a minor lapse when she was young. Oh wait, wasn't that all of us? \n\nFrom the tender and honest to the laugh-out-loud funny, Jann's stories from home and from the road during her pre-celebrity years will take you to unexpected places, including high school parties in farmer's fields, sleepovers under the stars, hard-to-believe summer jobs and the time she was stuck upside down in a brick barbecue. She reminds us of the inestimable value to a child of having teachers who believe in you and wide open spaces to play. But with the good times come the bad (and not just the bad perm). Jann opens up about the darker side of her so-called prairie perfect nuclear family and the first signs that her eldest brother was a uniquely troubled young man. In the days when Jann was experiencing a lot of firsts - first school play, first home perm, first kiss - how lucky for all of us that she stole away to her basement and taught herself her first song on her mother's guitar. \n\nIn addition to being an incredible musician and multi-award-winning lyricist, Jann is a natural writer and simply an inspiration. Jann will capture your heart - and keep you in stitches - with her powerful stories about coming of age as an artist and as a human being. Jann brings her wit and that infectious sparkle to everything she does. This book is no exception.","torrent":{"xt":"urn:btih:d4268036dcd49cddfc62ffce40efeaba910369aa","amp;dn":"Falling+Backwards.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d4268036dcd49cddfc62ffce40efeaba910369aa","infoHashBuffer":{"type":"Buffer","data":[212,38,128,54,220,212,156,221,252,98,255,206,64,239,234,186,145,3,105,170]},"announce":[],"urlList":[]}}