{"title":"Racism: A History   (BBC 2007 - Complete Series)","uid":7242401,"size":1735323024,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:d57d62994da23582c522876b9775c78c489615a1&amp;dn=Racism%3A+A+History+++%28BBC+2007+-+Complete+Series%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Lucybabe","files":6,"time":1336165975,"description":"Racism: A History is a three-part British documentary series originally broadcast on BBC Four in March 2007.\n\nIt was part of the season of programmes broadcast on the BBC marking the 200th anniversary of the Slave Trade Act 1807, a landmark piece of legislation which abolished the slave trade in the British Empire. The series explores the impact of racism on a global scale and chronicles the shifts in the perception of race and the history of racism in Europe, the Americas, Australia and Asia. The series was narrated by Sophie Okonedo.\n\nEpisodes\n\n#1 &quot;The Colour of Money&quot; 22 March 2007\n\nIn its first episode the series begins by assessing the implications of the relationship between Europe, Africa and the Americas in the 15th century. It considers how racist ideas and practices developed in key religious and secular institutions, and how they showed up in writings by European philosophers Aristotle and Immanuel Kant.\n\n#2 &quot;Fatal Impact&quot; 28 March 2007\n\nExamines the idea of scientific racism, an ideology invented during the 19th century that drew on now discredited practices such as phrenology and provided an ideological justification for racism and slavery. The episode shows how these theories ultimately led to eugenics and Nazi racial policies of the master race.\n\n#3 &quot;A Savage Legacy&quot; 4 April 2007\n\nExamines the impact of racism in the 20th century. By 1900 European colonial expansion had reached deep into the heart of Africa. Under the rule of King Leopold II, the Belgian Congo was turned into a vast rubber plantation. Men, women and children who failed to gather their latex quotas would have their limbs dismembered. The country became the scene of one of the century's greatest racial genocides, as an estimated 10 million Africans perished under colonial rule.\n\nA short sample is included for evaluation.","torrent":{"xt":"urn:btih:d57d62994da23582c522876b9775c78c489615a1","amp;dn":"Racism%3A+A+History+++%28BBC+2007+-+Complete+Series%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d57d62994da23582c522876b9775c78c489615a1","infoHashBuffer":{"type":"Buffer","data":[213,125,98,153,77,162,53,130,197,34,135,107,151,117,199,140,72,150,21,161]},"announce":[],"urlList":[]}}