{"title":"Photo Cube Live Wallpape Full v1.22","uid":7041696,"size":1400969,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:d8fb96644c1c081950b2ff50631de6f6ba6d2cde&amp;dn=Photo+Cube+Live+Wallpape+Full+v1.22&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"cad40","files":1,"time":1329572094,"description":"Requires Android: 2.1+\n\nRelease Date: January 10, 2012\n\n\nDescription\n\nA cool spinning 3d cube showing pictures and photos from your phone's gallery.\nThis stunning Live Wallpaper features a rotating 3d photo cube showing pictures and photos from your gallery and photo albums. \n\n* Select different pictures for each side, or show a single picture on all sides.\n\n* Change the size, position, rotation style and speed of your photocube.\n\n* Select from a wide variety of beautiful frames that can be shown around your pictures.\n\n* Try a little photo-editing and add some built in special effects to your photos such as black &amp; white, vintage, vignettes and other fun colour filters.\n\n* Choose a background image, background colour and transparency.\n\n* Now with extra floating panels.. click on a panel to watch it spin off into oblivion.\n\n* Double tap the wallpaper to bring up the Quick Size and Position screen, simply drag your photo cube to the required size and position.\n\n* Enjoy the Kube! More features coming soon!\n\n* IMPORTANT INSTALLATION INFORMATION: Once installed, on the home screen choose Menu-&gt;Wallpapers-&gt;Live Wallpapers, then select Photo Cube Live Wallpaper from the list shown. Click on the Settings button to change options, or use the convenient Photo Cube Settings app in the launcher. \n\nWhat's in this version:\n\n- Settings Screen now fully supports Android 3.0 Honeycomb and Android 4.0 Ice Cream Sandwich!\n- Better handling of Double Click Quick Settings screen.\n\nEnjoy","torrent":{"xt":"urn:btih:d8fb96644c1c081950b2ff50631de6f6ba6d2cde","amp;dn":"Photo+Cube+Live+Wallpape+Full+v1.22","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d8fb96644c1c081950b2ff50631de6f6ba6d2cde","infoHashBuffer":{"type":"Buffer","data":[216,251,150,100,76,28,8,25,80,178,255,80,99,29,230,246,186,109,44,222]},"announce":[],"urlList":[]}}