{"title":"MAX PAYNE 3 - GLOBE","uid":7339754,"size":9987917103,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:d98a3b8996f7084a488c4c9c702d37a5427b154c&amp;dn=MAX+PAYNE+3+-+GLOBE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"globeplus","files":50,"time":1339193468,"description":"Hello PC games fans ...\n\n\nPlay the new Max Payne game ...\n\n\nFILE INFO : pratical file with portability with necessary conversion work ...\n\n\n\n\n* Gameplay :\n \nMax Payne 3 is a third-person shooter in which the player assumes the role of its titular character, Max Payne. Max Payne 3 features a similar over-the-shoulder camera as its predecessors, with the addition of a cover mechanic, while also retaining much of the same run-and-gun style of gameplay. Max Payne 3 also marks the return of bullet-time in action sequences, for which the franchise is notable. In bullet-time it is possible to see every bullet strike an enemy in detail. New to the series is a &quot;Last Stand&quot; mechanic, which gives the player a grace period after losing all health during which time the player may kill the enemy that wounded them in order to continue playing, however this mechanic is only usable if the player has one or more bottles of painkillers in their possession.\n \nMax Payne 3 retains the shoot-dodge mechanic from the previous games in the series. Players are able to stay grounded after a dive, which enables them to shoot 360 degrees around. Rockstar has blended physics and animation, so that when a player dives, they do so appropriately according to their surroundings. Through advanced use of the Euphoria dynamic animation engine, shooting and killing enemies in Max Payne 3 will look noticeably more realistic than in any preceding Rockstar game .\n\n\n\n\n\n\n\n\n* enjoy ...\n\n\n\n\n\n\n\n* GLOBE FILES 2012\n","torrent":{"xt":"urn:btih:d98a3b8996f7084a488c4c9c702d37a5427b154c","amp;dn":"MAX+PAYNE+3+-+GLOBE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d98a3b8996f7084a488c4c9c702d37a5427b154c","infoHashBuffer":{"type":"Buffer","data":[217,138,59,137,150,247,8,74,72,140,76,156,112,45,55,165,66,123,21,76]},"announce":[],"urlList":[]}}