{"title":"A League Of Their Own - S05E02","uid":7336248,"size":393109504,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:daa034a28eda807ad141933cb54d811b40162160&amp;dn=A+League+Of+Their+Own+-+S05E02&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"hansimand","files":1,"time":1339080850,"description":"A League of Their Own is back on Sky1 HD for its fifth and best ever series. \n\nHost James Corden, nominated for Best Entertainment Performance for A League of Their Own at the RTS Awards, is back in the driving seat alongside team captains Jamie Redknapp and Freddie Flintoff.\n\nAnd in an exciting change to the usual line up, comedian Jack Whitehall will join the blue team as a regular panellist. Georgie Thompson will be reunited with the gang for one show inbetween her Formula 1 hosting duties and returning as a special guest on four shows is the ever popular John Bishop.\n\nHaving established itself amongst the elite of panel shows, A League of Their Own continues to give Sky1 HD viewers a first class serving of humour, guests at the top of their game and spectacular challenges.\n\nIn this new series the League panel stop at nothing, trying their hand at hurdling against World Champion Dai Greene, wing walking, speed skating, sky diving, and ice hockey.\n \nAs ever, an amazing array of guests are lined up to join the teams in the studio including England star and Liverpool FC Captain Steven Gerrard, England and Manchester City goalkeeper Joe Hart, Stoke City striker Peter Crouch, the multi-medalled Jessica Ennis, current 5000m World Champion Mo Farrah plus comedy stars David Walliams, Jimmy Carr and Micky Flanagan plus Christine Bleakley, Gaby Logan, Claudia Winkleman, Zoe Ball and many others.","torrent":{"xt":"urn:btih:daa034a28eda807ad141933cb54d811b40162160","amp;dn":"A+League+Of+Their+Own+-+S05E02","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"daa034a28eda807ad141933cb54d811b40162160","infoHashBuffer":{"type":"Buffer","data":[218,160,52,162,142,218,128,122,209,65,147,60,181,77,129,27,64,22,33,96]},"announce":[],"urlList":[]}}