{"title":"WinRAR 4.00 32Bit And 64Bit Full-Version","uid":7129713,"size":1576313,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:dc7c53a0f553c9dd07fd241ad88fa3311d162bd4&amp;dn=WinRAR+4.00+32Bit+And+64Bit+Full-Version&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"jagpalsingh","files":-1,"time":1332658152,"description":"Just Install.\n\nInstallation Must Be Done From Inside This Downloaded Folder.\nREASON : The   &quot;rarreg.key&quot; Get's Imported During Installation , So No Need For U To Go and Copy and Paste anything To any installation Directory.\nIf You Would Like To Carry Winrar Onto a Flash-Drive , Just To Install On Another Computer. Just Send This Entire Folder To Your Flash Drive And Install From There.\n\nHave Fun !!!!!!\n\nBrought To You By blaze69 .\n\n\n* Using WinRAR puts you ahead of the crowd when it comes to compression by consistently making smaller archives than the competition, saving disk space and transmission costs.\n* WinRAR provides complete support for RAR and ZIP archives and is able to unpack CAB, ARJ, LZH, TAR, GZ, ACE, UUE, BZ2, JAR, ISO, 7Z, Z archives.\n* WinRAR offers a graphic interactive interface utilizing mouse and menus as well as the command line interface.\n* When you purchase WinRAR license you are buying a license to the complete technology, no need to purchase add-ons to create self-extracting files, it's all included.\n* WinRAR is easier to use than many other archivers with the inclusion of a special &quot;Wizard&quot; mode which allows instant access to the basic archiving functions through a simple question and answer procedure. This avoids confusion in       the early stages of use.\n* WinRAR offers you the benefit of industry strength archive encryption using AES (Advanced Encryption Standard) with a key of 128 bits.\n* WinRAR supports files and archives up to 8,589 billion gigabytes in size. The number of archived files is, for all practical purposes, unlimited.\n* WinRAR offers the ability to create selfextracting and multivolume archives.\n* Recovery record and recovery volumes allow to reconstruct even physically damaged archives.\n* WinRAR features are constantly being developed to keep WinRAR ahead of the pack. \n\n\t\t","torrent":{"xt":"urn:btih:dc7c53a0f553c9dd07fd241ad88fa3311d162bd4","amp;dn":"WinRAR+4.00+32Bit+And+64Bit+Full-Version","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dc7c53a0f553c9dd07fd241ad88fa3311d162bd4","infoHashBuffer":{"type":"Buffer","data":[220,124,83,160,245,83,201,221,7,253,36,26,216,143,163,49,29,22,43,212]},"announce":[],"urlList":[]}}