{"title":"BBC Knowledge India - June 2012 (gnv64)","uid":7261086,"size":20878041,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:dc89460f71a3ac6e82be964f275020067ea602ba&amp;dn=BBC+Knowledge+India+-+June+2012+%28gnv64%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"gnv65","files":-1,"time":1336731115,"description":"BBC Knowledge India - June 2012\nEnglish | 100 pages | PDF | 19.9 mb\n\nFEATURES\n32 The Biggest Bang\nRobert Matthews demystifies the secrets about the Gamma-ray bursts, also called Death Stars\n40 Portfolio: Mountain Gorillas\nAndy Rouse peeks into the intimate details of a mountain gorilla's daily life\n45 How to make anything Invisible\nWill bending lights around objects help physicists create a real invisibility cloak? Paul Parsons reveals more on this technology\n52 How to Live Online\nShould you befriend you boss on Facebook or google before a date? JV Chamary solves such digital dilemmas\n57 Evolution of Language\nGuy Deutscher traces the emergence of language and how it derives influences from biology and culture\n64 What do Your Hands Say About You?\nFrom personality traits to medical complaints, your digits can reveal a lot about your physical well being, explains Kieran Allen\n66 The Weird World of the Bug\nPeter Marren explores the amusing and occasionally revolting meeting ground between bugs and humans\n70 The History of Science in 10 Objects\nThe objects that have transformed human understanding of the world over the past 500\n72 Electric Dreams\nPaul Parsons explains the new technology that can finally transfer power across our homes without wires\n76 Black Mamba\nThea Litschka handles these snakes, one of the most venomous species on Earth efficiently, conserving them and saving several human lives\n82 Romulus Whitaker\nThis world renowned herpetologist and conservationist talks about conserving the King Cobras and the Gharials\n86 The Big Idea: The Game Theory\nFrom card games to nuclear deterrance, game theory is the mathematics that can help to work out a strategy to lead to the best possible outcome\n\nREGULARS\n6 Inbox\nRead what's on the editor's mind and a selection of your letters on topics covered in our recent issues\n11 Think &amp; Win\nStretch your mind and win a cash prize\n12 Q&amp;A\nQuestions that boggle the mind until they're answered\n18 Snapshot\nThree amazing pictures from the world over to enlighten, tantalise and amaze\n91 Edu Talk\nGrace Pinto from Ryan Group of Schools talks about the state of the Indian education system\n96 Gadgets\nExplore the latest gadgets and apps in the market\n24 The Latest Intelligence\nKeep abreast of the latest developments from the worlds of science, nature and history\n28 Comment &amp; Analysis\nInvisible computing wizard, Pranav Mistry, tells how human interaction with future technology is set to change\n30 World News in Context\nDavid Keys unravels the causes of the Cold War in the Middle East between Iran and Israel\n92 Reviews\nRecommendations of books and websites to keep the little grey cells well-nourished\n98 Last Word\nAstrophysicist Dibyendu Nandy explains the science behind the recent solar storms\n27 PIXELS - Student Photo Contest\nCan urban environment excite the shutterbug in you? Prove it and win this photo contest","torrent":{"xt":"urn:btih:dc89460f71a3ac6e82be964f275020067ea602ba","amp;dn":"BBC+Knowledge+India+-+June+2012+%28gnv64%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dc89460f71a3ac6e82be964f275020067ea602ba","infoHashBuffer":{"type":"Buffer","data":[220,137,70,15,113,163,172,110,130,190,150,79,39,80,32,6,126,166,2,186]},"announce":[],"urlList":[]}}