{"title":"The Best Exotic Marigold Hotel XVID CAM GLOBE","uid":7195401,"size":1293038619,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:dcef71294c9da5fc70156d278f7f705901961de4&amp;dn=The+Best+Exotic+Marigold+Hotel+XVID+CAM+GLOBE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"globeplus","files":-1,"time":1334764781,"description":"* XVID CAM  * 01H57M01S    * + 1300 Bitrate    * Worked with the Dub plugins\n\n\n* FILE INFO :\n\n\n- Black borders at the top and the bottom in full screen corrected\n\n- particles on the picture background reduced to the minimum\n\n- colours improved\n\n\n\n\n* Plot :\n\nA group of British retirees have outsourced their retirement, attracted by the less expensive and seemingly exotic India. They are enticed by advertisements about the newly restored Marigold Hotel and given false dreams of a life with leisure. The group arrives at the hotel to find that it does not meet prior expectations and, although the new environment is less luxurious than imagined, the retirees are profoundly transformed by their subsequent experiences.\n\nHaving arrived in Mumbai following the cancellation of their connecting flight, Graham (Tom Wilkinson) organizes for the group to be driven by bus and tuk-tuk overnight to the hotel. However, The Best Exotic Marigold Hotel is not what the seven retirees expect, as the phones are out of order, the building is dilapidated and the Indian food is not quite what they are used to.\n\nJean (Penelope Wilton) is reluctant to explore the new culture, as well as her fellow guests (apart from Graham, due mainly to his former position as a High Court judge); but her husband, Douglas (Bill Nighy), proceeds to explore the city, visiting the sights that Graham recommends. Meanwhile, Graham disappears each day and no-one is quite sure where he goes.\n\nMuriel (Maggie Smith) has a scheduled operation almost immediately, as is promised, and is told that as soon as she can walk she can return home. Despite her racism, she is grateful to her doctor and grudgingly admits his team's success with her operation. Then, recognising the kindness of the hotel cleaner, Muriel tries to reciprocate with help but is told by Graham that the girl speaks no English. The narrative subsequently reveals that the cleaner is a member of the &quot;untouchable&quot; caste (also known as &quot;Dalits&quot;), a social status that persists even though the title is an anachronism.\n\n\n\n\n\n\n* enjoy ...\n\n\n\n\n\n\n\n\n\n* GLOBE FILES 2012","torrent":{"xt":"urn:btih:dcef71294c9da5fc70156d278f7f705901961de4","amp;dn":"The+Best+Exotic+Marigold+Hotel+XVID+CAM+GLOBE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dcef71294c9da5fc70156d278f7f705901961de4","infoHashBuffer":{"type":"Buffer","data":[220,239,113,41,76,157,165,252,112,21,109,39,143,127,112,89,1,150,29,228]},"announce":[],"urlList":[]}}