{"title":"The.X.Files.4CD.[PSX-PAL].[JERORO]","uid":7196883,"size":2777648387,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:dd1b234bf8df0267d622077a5a8f997d7248969b&amp;dn=The.X.Files.4CD.%5BPSX-PAL%5D.%5BJERORO%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"_antongirdeux_","files":12,"time":1334812054,"description":"This is it! my first upload!\n\nThe X-Files Game is an interactive movie point-and-click adventure game for the PC and PlayStation and is based on the television series The X-Files. \n\nPlot Summary:\nThe game takes place somewhere within the timeline of the third season of The X-Files series. The story follows a young Seattle-based FBI agent named Craig Willmore (played by Jordan Lee Williams) who is assigned by Assistant Director Walter Skinner to investigate the disappearance of agents Fox Mulder and Dana Scully, who were last seen in the Everett, Washington area. Agent Willmore must use his state-of-the-art spy tools: night vision goggles, a digital camera, PDA (an Apple Newton), lock picks, evidence kit, a standard issue handgun, handcuffs and badge, to follow their trail. Along the way, he is partnered with a Seattle Police Department detective named Mary Astadourian (played by Paige Witte) and a minor subplot involves a relationship developing between the two.\n\nGameplay:\nThe game uses a point-and-click interface, uses full motion video technology called Virtual Cinema, and includes a large number of cut scenes. Included in the gameplay are numerous occasions in which the player can alter other character's attitudes and reactions depending upon responses and actions (or inactions). Dubbed &quot;UberVariables&quot;, certain decisions made by the player can set them along one of three tracks: Paranoia (Willmore will start seeing things like twitching corpses and shadowy figures), Loss (messages from his ex-wife are kinder), and &quot;The X-Track&quot; (more details are revealed about mytharc-related conspiracies). The player can also affect Willmore's relationship with Astadourian positively and negatively based upon how he responds to her suggestions and ideas.\n\n\nBurn with Alcohol 120%\nUse a CD-R of good quality media and burn @ the lowest possible speed.\nIt's working\n\n**ripped by: juanXmilloza (this is also my twitter account! so please send me thanks ;))***\n\npls help me SEED this game...seriously!","torrent":{"xt":"urn:btih:dd1b234bf8df0267d622077a5a8f997d7248969b","amp;dn":"The.X.Files.4CD.%5BPSX-PAL%5D.%5BJERORO%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dd1b234bf8df0267d622077a5a8f997d7248969b","infoHashBuffer":{"type":"Buffer","data":[221,27,35,75,248,223,2,103,214,34,7,122,90,143,153,125,114,72,150,155]},"announce":[],"urlList":[]}}