{"title":"alasdair Roberts The Amber Gatherers","uid":7060694,"size":225064054,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:ddeafb4a342ef17f375aa70b4c5c1f3e0189792c&amp;dn=alasdair+Roberts+The+Amber+Gatherers&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"akasyliphone","files":-1,"time":1330335836,"description":"On 2005's No Earthly Man, Scottish singer/songwriter Alasdair Roberts offered up eight traditional ballads with minimal accompaniment. That he pulled it off without nailing the listeners eyes shut within the first two minutes is a testament to both his gift as an interpreter, and his reedy, yet impossibly fluid and melodious voice. On the Amber Gatherers, Roberts balances regional folk songs with his own self-penned odes to heartache, death and drink, successfully blurring the line between the two like a young Nic Jones or Martin Carthy. A full band is employed this time around, and their lightly brushed drums, fingerpicked guitars, accordions, and backing vocals wrap themselves around Roberts' careful phrasing like a winter coat. Standout tracks such as &quot;I Had a Kiss of the King's Hand,&quot; &quot;Cruel War&quot; and &quot;Old Men of the Shells&quot; sound like lost cuts from the late-'60s and early-'70s British folk heydays, and a hand-drawn map of the U.K. with songtitles for cities, as well as a handy tuning chart that explains where to capo your guitar for each song, gives the whole affair a rustic, communal vibe that manages to avoid feeling contrived. ","torrent":{"xt":"urn:btih:ddeafb4a342ef17f375aa70b4c5c1f3e0189792c","amp;dn":"alasdair+Roberts+The+Amber+Gatherers","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ddeafb4a342ef17f375aa70b4c5c1f3e0189792c","infoHashBuffer":{"type":"Buffer","data":[221,234,251,74,52,46,241,127,55,90,167,11,76,92,31,62,1,137,121,44]},"announce":[],"urlList":[]}}