{"title":"Yukon Flight [1940] @ .avi","uid":7126092,"size":665781662,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:df348e088d891ec43df3fa95a19f0c76a21fe820&amp;dn=Yukon+Flight+%5B1940%5D+%40+.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"alien99","files":1,"time":1332535263,"description":"ONE OF THEM $1.99 DVD'S OF A SOMEWHAT UNHEARD OF MOVIE JUST THOUGHT I WOULD SHARE\nMUST BE THE SAME COPY THE REVIEWER HAS SINCE IT DOES HAVE SOME DARK SPOTS IN IT.\n\nStoryline\nWhen the plane owned by the &quot;Yukon and Columbia Mail Service&quot; crashes, RCMP Sergeant Renfrew (James Newill) and Constable Kelly (Dave O'Brien) suspect murder. Their suspicions are confirmed when Renfrew finds the control stick has been jammed, forcing the plane to fly in one direction until the gas ran out. Mine owner Louise Howard (Louise Stanley) reports that her superintendent is missing. The Mounties find him murdered and that too has been made to look like an accident. A new mail service pilot, Bill Shipley (Warren Hull), arrives. He had gone to training school with Renfrew but had been cashiered for misconduct. The Mounties discover that Raymond (Karl Hackett), who had been working for Louise, really owns the flying line managed by Yuke Cardoe (William Pawley.) They find proof that all the gold from the mine isn't being turned over to Louise, and suspect that Raymond and Yuke are stealing the gold and shipping it to Seattle by plane...\n\nUSER REVIEW:\n\nThis is an exciting blend of cowboy and pilot, of horse and airplane.\nTex O'Brien is in it and that would be enough for me, but in fact there is an exceptional cast, with some colorfully named characters who add some weight and who flesh out the story.\nMy copy of &quot;Yukon Flight&quot; is pretty bad, with some godawful dark scenes that make it hard to follow. As a result of the poor quality picture, I have had to extrapolate a bit, and I still loved this movie.\nIt is part of the Great American Western series from Echo Bridge Entertainment, Volume 35 of &quot;over 30 Volumes,&quot; as it says on the case and &quot;over 40&quot; as it says on the other case in the box.\nJames Newill is the nominal star and is the title character, Sergeant Renfrew, who also sings. He is more Nelson Eddy than Gene Autry in style, so anyone who doesn't like operetta might feel like fast-forwarding. That's not a problem for me, though.\nRoy Barcroft is one of the minor bad guys, in a different kind of role for him.\nJack Clifford plays a character named &quot;Whispering Smith,&quot; but he has no resemblance to any other &quot;Whispering Smith,&quot; such as that of Alan Ladd, Richard Carlson, or Audie Murphy. Apparently his character shows up in two other Renfrew films.\nThis is fun. I only hope you find a better copy than mine, which is still fun.","torrent":{"xt":"urn:btih:df348e088d891ec43df3fa95a19f0c76a21fe820","amp;dn":"Yukon+Flight+%5B1940%5D+%40+.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"df348e088d891ec43df3fa95a19f0c76a21fe820","infoHashBuffer":{"type":"Buffer","data":[223,52,142,8,141,137,30,196,61,243,250,149,161,159,12,118,162,31,232,32]},"announce":[],"urlList":[]}}