{"title":"Charles Mingus - Mingus Mingus Mingus Mingus Mingus (2010 Hybrid","uid":7203789,"size":251313687,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:e0ce3a33092e667a642588aff00ba820788f5b53&amp;dn=Charles+Mingus+-+Mingus+Mingus+Mingus+Mingus+Mingus+%282010+Hybrid&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"tiddler222","files":11,"time":1335025099,"description":"\nRecorded January to September 1963. This Hybrid SACD release 2010 on Analogue Productions/Impulse.\n\nReview by Steve Huey (AMG):\nHaving completed what he (and many critics) regarded as his masterwork in The Black Saint and the Sinner Lady, Charles Mingus' next sessions for Impulse found him looking back over a long and fruitful career. Mingus, Mingus, Mingus, Mingus, Mingus is sort of a &quot;greatest hits revisited&quot; record, as the bassist revamps or tinkers with some of his best-known works. The titles are altered as well - &quot;II B.S.&quot; is basically &quot;Haitian Fight Song&quot; (this is the version used in the late-'90s car commercial); &quot;Theme for Lester Young&quot; is &quot;Goodbye Pork Pie Hat&quot;; &quot;Better Get Hit in Your Soul&quot; adds a new ending, but just one letter to the title; &quot;Hora Decubitus&quot; is a growling overhaul of &quot;E's Flat Ah's Flat Too&quot;; and &quot;I X Love&quot; modifies &quot;Nouroog,&quot; which was part of &quot;Open Letter to Duke.&quot; There's also a cover of Duke Ellington's &quot;Mood Indigo,&quot; leaving just one new composition, &quot;Celia.&quot; Which naturally leads to the question: With the ostensible shortage of ideas, what exactly makes this a significant Mingus effort? The answer is that the 11-piece bands assembled here (slightly different for the two separate recording sessions) are among Mingus' finest, featuring some of the key personnel (Eric Dolphy, pianist Jaki Byard) that would make up the legendary quintet/sextet with which Mingus toured Europe in 1964. And they simply burn, blasting through versions that equal and often surpass the originals -- which is, of course, no small feat. This was Mingus' last major statement for quite some time, and aside from a solo piano album and a series of live recordings from the 1964 tour, also his last album until 1970. It closes out the most productive and significant chapter of his career, and one of the most fertile, inventive hot streaks of any composer in jazz history.\n\n01. II B.S.    \n02. I X Love   \n03. Celia    \n04. Mood Indigo   \n05. Better Get Hit In Yo' Soul   \n06. Theme For Lester Young    \n07. Hora Decubitus\n\n   \n","torrent":{"xt":"urn:btih:e0ce3a33092e667a642588aff00ba820788f5b53","amp;dn":"Charles+Mingus+-+Mingus+Mingus+Mingus+Mingus+Mingus+%282010+Hybrid","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e0ce3a33092e667a642588aff00ba820788f5b53","infoHashBuffer":{"type":"Buffer","data":[224,206,58,51,9,46,102,122,100,37,136,175,240,11,168,32,120,143,91,83]},"announce":[],"urlList":[]}}