{"title":"The Cold Light Of The Day XVID CAM GLOBE","uid":7192027,"size":1046505001,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:e2180c459388a75c2408a85a132b6edf734bee6e&amp;dn=The+Cold+Light+Of+The+Day+XVID+CAM+GLOBE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"globeplus","files":-1,"time":1334662575,"description":"* XVID CAM  * 01H34M44S    * + 1300 Bitrate    * Worked with the Dub plugins\n\n\n\n* FILE INFO :\n\n\n- Black borders at the top and the bottom in full screen corrected\n\n- particles on the picture background reduced to the minimum\n\n- colours improved\n\n- english audio with arabic and french subtitles\n\n\n\n* Plot :\n\nA young American (Cavill) uncovers a conspiracy during his attempt to save his family, who were kidnapped while on vacation in Spain.\n\nWill Shaw arrives in Spain from San Francisco for a holiday he really doesn't want. He is met at the airport by his father Martin(Bruce Willis). There is a bit of tension between the two. His father works in various different countries for the government and currently works in Spain. They join the rest of his family on their boat and in the evening, dinner is interrupted by constant phone calls Will has to take. He finds out the company he works for is now bankrupt. It puts him in a foul mood and his father does make an attempt to sympathise. The next day they go out to sea. Will is still preoccupied with his work phone, resulting in an accident which causes his brother's girlfriend being hit on the side of her head by the sail. His father in a fit of anger throws Will's phone into the sea. Will gets mad but decides to swim into town to calm down.\n\nWhen he decides to swim back, the ship has gone and only finds it much later, abandoned and ransacked. He runs to the local police station where the officer in charge finds out his name and makes a phone call, before asking Will to take him to the ship. They are met there by a man who knows who Will is. He invites him to show him the way but is then spooked by the man's handgun tucked into his trousers. Will escapes in the police car but doesn't get far. He crashes into a tree and is beaten by the police. However, his dad shows up and escapes with him. He reveals he is a CIA agent and that the people who have taken their family are after a briefcase he took during one of his operations. He calls his colleague who agrees to meet him in Madrid. After getting freshened up, they go to the rendezvous and Will stays in the car while Martin talks to his partner Jean(Sigourney Weaver). She says the briefcase has gone higher up in the chain and she doesn't have it anymore. He doesn't believe her and thinks something isn't right which she denies. As he returns to the car, he is taken out by a hitman. Will barely escapes but the hitman is in pursuit through the streets of Madrid. Policemen are also killed during the gunfight but Will escapes through a park. He has no money and decides to hide his dad's gun in the trash.\n\n\n\n\n\n\n\n* enjoy ...\n\n\n\n\n\n\n\n\n\n\n* GLOBE FILES 2012","torrent":{"xt":"urn:btih:e2180c459388a75c2408a85a132b6edf734bee6e","amp;dn":"The+Cold+Light+Of+The+Day+XVID+CAM+GLOBE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e2180c459388a75c2408a85a132b6edf734bee6e","infoHashBuffer":{"type":"Buffer","data":[226,24,12,69,147,136,167,92,36,8,168,90,19,43,110,223,115,75,238,110]},"announce":[],"urlList":[]}}