{"title":"Noordzee, Texas / North sea, Texas (2011) GTM Multi Subs","uid":7193559,"size":627725697,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:e4e9058dcd314a7e64e27982e907047c0785cac6&amp;dn=Noordzee%2C+Texas+%2F+North+sea%2C+Texas+%282011%29+GTM+Multi+Subs&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"lumpy30","files":4,"time":1334716298,"description":"Beautifully directed, emotionally engaging coming-of-age drama with a sharp script, a strong sense of time and place and terrific performances from its entire cast.\n\nDirected by Bavo Defume, North Sea Texas (Noordzee, Texas, original title fans) is based on a novel by Andre Sollie and stars Jelle Florizoone as Pim, an artistic 15 year old boy who lives in a 1960s Belgian coastal town with his accordion-playing, bar-cruising mother Yvette (Eva Van der Gucht). As a younger boy (played by Ben Van den Heuvel), Pim frequently dressed in his mother's clothes and make-up, but as his 15th birthday approaches, Pim finds his attentions drawn elsewhere and develops an intense crush on his best friend Gino (Mathias Vergel), drawing him in private and collecting a box of fetishised objects that he associates with their relationship.\n\nWhen the pair begin exploring their sexuality together, Pim is overjoyed as their motorbike rides and nights spent camping in the dunes take on a whole new meaning. Meanwhile, Gino's little sister Sabrina (Nina Marie Kortekaas) is nursing her own crush on Pim and there's heartbreak in store when Gino starts spending time with a French girl he meets in Dunkirk.\n\n598 MB\nSubtitles: English and Brazilian Portuguese","torrent":{"xt":"urn:btih:e4e9058dcd314a7e64e27982e907047c0785cac6","amp;dn":"Noordzee%2C+Texas+%2F+North+sea%2C+Texas+%282011%29+GTM+Multi+Subs","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e4e9058dcd314a7e64e27982e907047c0785cac6","infoHashBuffer":{"type":"Buffer","data":[228,233,5,141,205,49,74,126,100,226,121,130,233,7,4,124,7,133,202,198]},"announce":[],"urlList":[]}}