{"title":"TEL-EVIL-SION: Reptilian Shapeshifters Exposed:The Most Importan","uid":7181333,"size":2337254904,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:e53005548135f165f4266aa9e07cd9705f108597&amp;dn=TEL-EVIL-SION%3A+Reptilian+Shapeshifters+Exposed%3AThe+Most+Importan&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"TELEVIL","files":33,"time":1334278515,"description":"TEL-EVIL-SION : The Most Important Documentary Series You'll Ever See\n\n Reptilian Shapeshifters are amongst us. Everything you will see in this series is key to understanding how mankind has been deceived by entities that exist beyond\nour five senses. They could be your neighbors, your teachers, police or pastors. They ARE real and they are seizing power right now.\n We need to put aside any notions of racial conflict, class warfare and focus on the real enemies, whom are hidden amongst us, usually in positions of power, \noften not, but with the information relayed in these videos, you will be able to identify them through the colors they wear, and the dirty habits they promote.\n\n This series has been uploaded and separated into 33 parts, which are vital to understanding how deep we are in it. It's beyond politics, beyond Aliens, beyond the New World Order.\n\n I am the Creator of this series. You may ask how I know about this. The answer is in the question. I've been jailed, beaten and jailed again to bring you this information.\n\n This is Real, this is the threat we face. Don't judge until you've seen the series, and please seed, the world needs this information now more than ever. I will be seeding this series all Summer long..Please spread the word, all of this was done for free, and is given for free...Do what you will with the information, as long as it gets out to the people. Thank you.","torrent":{"xt":"urn:btih:e53005548135f165f4266aa9e07cd9705f108597","amp;dn":"TEL-EVIL-SION%3A+Reptilian+Shapeshifters+Exposed%3AThe+Most+Importan","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e53005548135f165f4266aa9e07cd9705f108597","infoHashBuffer":{"type":"Buffer","data":[229,48,5,84,129,53,241,101,244,38,106,169,224,124,217,112,95,16,133,151]},"announce":[],"urlList":[]}}