{"title":"Free Media Converter 1.0","uid":7075054,"size":7323532,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:e64a6efede7849f9c8d5db18442780a53a4b50b3&amp;dn=Free+Media+Converter+1.0&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"CuteJunky","files":3,"time":1330806601,"description":"Free Media Converter enables you to easily convert your video and audio files from one format to another. You can convert single files or batch convert a list of files, download videos from online sources, rip DVD-video disks, and even record video and audio from your webcam or desktop. The Free Media Converter not only allows you to import video in many ways, it also supports a lot of output formats. Among video formats: MPEG-4, H.264/MPEG-4 AVC, DivX, XviD, AVI, MOV, M4V, MPEG-1, MPEG-2, 3GP, 3GPP, ASF, FLV, SWF, VOB, WMV, MKV, DV, Super VCD, VCD , DVD and HD video. Supported audio formats: MP3, OGG, WAV, AAC, FLAC, M4A, MP2, AC3, AIFF, AMR, WMA. Free Media Converter is optimized for multi-core processors, so you will be amazed by the speed of the software. As well as by quality of converted media.\n\nRecord your own videos from different sources\nFree Media Converter allows you to record your own videos from different sources. You can capture video from desktop or a part of the screen. You can also record video from web cam and record audio. Then you can convert recorded video/audio to any supported multimedia format.\n\nDownload online video\nFound cool online video? With Free Media Converter you can download and convert videos from all popular online resources, such as YouTube, Hulu, Facebook, Google Video and many more, including adult sites.\n\nEdit and adjust media\nFree Media Converter also has several tools for editing and adjusting video and audio. Thus you can trim the file if you don't need to convert the full-length video/audio. Or you can crop the video frame, change aspect ratio and adjust brightness, saturation or contrast. The software even allows you to merge converted fiels on output.\n\nConvert for Multimedia devices\nIn addition to common video and audio formats, this program is able to convert media to formats optimized for specific model of multimedia device, portable video player of cell phone. Among these devices: iPod, iPhone, iPad, PSP, Archos, Xbox, HTC, Nokia, Motorola, Sony, Samsung and many more.\n\nRip DVD videos\nYou can easy and fast convert your DVD collection to all popular video and audio formats. Protected DVDs are supported as well.\n\n===================================================================================\n\nCodecPack.Co - Download Audio and Video Software\n\nCodecPack.co delivers quality multimedia software for Windows. Updated Daily!\n\n===================================================================================","torrent":{"xt":"urn:btih:e64a6efede7849f9c8d5db18442780a53a4b50b3","amp;dn":"Free+Media+Converter+1.0","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e64a6efede7849f9c8d5db18442780a53a4b50b3","infoHashBuffer":{"type":"Buffer","data":[230,74,110,254,222,120,73,249,200,213,219,24,68,39,128,165,58,75,80,179]},"announce":[],"urlList":[]}}