{"title":"GONE XVID GLOBE","uid":7127884,"size":1049343082,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:e64de665d296c965157ebc3d15bc6db4983f44ae&amp;dn=GONE+XVID+GLOBE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"globeplus","files":-1,"time":1332547487,"description":"* XVID CAM  * 01H30M56S    * + 1200 Bitrate    * Worked with the Dub plugins\n\n\n* FILE INFO :\n\n\n- particles on the picture background reduced to the minimum\n\n- colours improved\n\n\n\n* Plot :\n\nJill Conway (Amanda Seyfried) is a young woman who lives in Portland with her sister, recovering alcoholic Molly (Emily Wickersham). One year prior, Jill was kidnapped by a serial killer who abandoned her in a hole in the forest, where she found human remains. When her abductor descended into the hole to kill her, Jill was able to knock him unconscious with a bone and climb his rope and return to civilization. However, the police didn't find the hole and discovered that Jill had been committed to a psychiatric institution for several years after her parents' death. Believing that the abduction only happened in Jill's head, they closed the case.\n\nOne day, after returning home from work at a local diner, where she and her friend Sharon Ames (Jennifer Carpenter) are generously tipped by a regular customer about to move out of town, Jill finds Molly gone and is unable to reach her boyfriend, Billy (Sebastian Stan). Knowing that Molly wouldn't leave the house with Jill absent and that she had an important test the following day, Jill becomes convinced that the man who took her has now captured Molly and heads to the police station to ask for help, but Sargent Powers (Daniel Sunjata) and Detective Erica Lonsdale (Katherine Moennig) dismiss her claims and promise to look into the case after a few days, but Jill claims it will be too late then. Before she leaves, newcomer Detective Peter Hood (Wes Bentley) pulls her aside and tells her he believes her, giving Jill his card in case she needs help.\n\n\n\n\n\n\n\n* enjoy ...\n\n\n\n\n\n\n\n* GLOBE FILES 2012","torrent":{"xt":"urn:btih:e64de665d296c965157ebc3d15bc6db4983f44ae","amp;dn":"GONE+XVID+GLOBE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e64de665d296c965157ebc3d15bc6db4983f44ae","infoHashBuffer":{"type":"Buffer","data":[230,77,230,101,210,150,201,101,21,126,188,61,21,188,109,180,152,63,68,174]},"announce":[],"urlList":[]}}