{"title":"NASCAR 2012 NNS #08 Talladega Stream Capture [CARG]","uid":7245506,"size":3643056521,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:e838a912b92030be5a4c8111376cd4b0dbbf2f39&amp;dn=NASCAR+2012+NNS+%2308+Talladega+Stream+Capture+%5BCARG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Hard2Find2","files":-1,"time":1336268926,"description":"***DISCLAIMER*** This is Web-Stream Capture and credit should also go to the original broadcaster. This file **DOES** Contain commercials and an occasional pop up ad that lasts only a few seconds..............Hello Racefans, Please do you part in seeding after download. This has been tested with VLC (for PC) and WD TV HD Media Player (on TV). [CARG] Rebuilding NASCAR one fan at a time. Expanding the fansbase to a Worldwide audience. Please check out our other NASCAR listings. Screens can be found at ExtraTorrent and KisckassTorrent as always.......................The 8th race of the 2012 NASCAR Nationwide Series the Aaron's 312 took place on a Saturday 05/05/2012 (Cinco de Mayo). Pole winner Elliott Sadler leads the field to the green flag in Talladega County, Alabama. The asphalt Tri-Oval is 2.66 miles. During 1960s Bill France was wanting to build a track faster and longer than Daytona International Speedway. He would end up breaking ground on an old airfield on May 23, 1968. The track would be named Alabama International Motor Speedway (AIMS), but the name would not carry on and was later changed to Talladega Superspeedway. The track opened on September 13, 1969 costing $4 million. The first race at the new track was unlike any other; all the original drivers abandoned the track because of tire problems which caused Bill France to hire substitute drivers. The first finish was amazing with three cars side by side with the winner being Richard Brickhouse. After the first race, Talladega would host two Sprint Cup Series races a year, one of which would become part of the 10-race Chase for the Sprint Cup. Since the opening year Talladega has hosted many races and has been repaved four times. Talladega would also have many first time winners such as Larry Schild Sr, Richard Brickhouse, Brian Vickers, and Brad Keselowski...................Video Codec: MPEG-1/2 Video (mpgv)......Resolution: 712x408......Frame Rate: 50......Audio Codec: MPEG Audio layer 1/2/3 (mpga)......Channels: Stereo.......Sample Rate: 48000 Hz.......Bitrate: 128 kb/s........RunTime: 3hrs 11mins","torrent":{"xt":"urn:btih:e838a912b92030be5a4c8111376cd4b0dbbf2f39","amp;dn":"NASCAR+2012+NNS+%2308+Talladega+Stream+Capture+%5BCARG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e838a912b92030be5a4c8111376cd4b0dbbf2f39","infoHashBuffer":{"type":"Buffer","data":[232,56,169,18,185,32,48,190,90,76,129,17,55,108,212,176,219,191,47,57]},"announce":[],"urlList":[]}}