{"title":"Sportys So You Want to Fly Helicopters","uid":7180302,"size":859603450,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:eb0f8ceb640799987db564421cc85e5bd57b9356&amp;dn=Sportys+So+You+Want+to+Fly+Helicopters&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"cdub2013","files":-1,"time":1334242486,"description":"So You Want to Fly Helicopters \n\nFILE TYPE: .WMV\n\nSIZE: 834MB\n\nThis remake of Sporty's very first video production brings helicopter flight into your living room like you've never seen before. Completely redesigned with vivid 3D animations and all new exciting in-flight video, this program will thoroughly prepare you for the challenges of rotary-wing flight and help you master the aerodynamic concepts with ease. In addition to covering all the specific information needed to pass the helicopter portion of the FAA Private Pilot exam, you will also be mentally prepared for your flight lessons. This comprehensive program includes preflight, basics of flight, hovering, taxiing, takeoffs and landings, maneuvers, weight and balance, autorotation, emergency procedures, systems and components, FARs and more. We'll also cover the fundamentals of helicopter navigation and cross-helicopters, such as the Robinson R22 and R44, Schweizer 269, and the Bell 206 Jetranger. After viewing this program, you'll know exactly what it takes to safely and proficiently fly a helicopter and open up a whole other world of powered flight. \n\nApprox. 89 min.","torrent":{"xt":"urn:btih:eb0f8ceb640799987db564421cc85e5bd57b9356","amp;dn":"Sportys+So+You+Want+to+Fly+Helicopters","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eb0f8ceb640799987db564421cc85e5bd57b9356","infoHashBuffer":{"type":"Buffer","data":[235,15,140,235,100,7,153,152,125,181,100,66,28,200,94,91,213,123,147,86]},"announce":[],"urlList":[]}}