{"title":"The Big Bang Theory : The Complete First Season         DVDrip","uid":7048309,"size":5116699310,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:edaafac3ae3e354beeada9f0f601fbcdf31e1932&amp;dn=The+Big+Bang+Theory+%3A+The+Complete+First+Season+++++++++DVDrip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"21KnownEnemies","files":17,"time":1329818980,"description":"The Big Bang Theory: The Complete First Season (2007)\n\n\n\n01 Pilot:\nA pair of brilliant theoretical physicists meet a woman who shows them how little they know about the real world.\n\n\n02 The Big Bran Hypothesis:\nPenny is furious and more than a little freaked out with Leonard and Sheldon when they sneak into her apartment overnight, and clean it while she is sleeping.\n\n\n03 The Fuzzy Boots Corollary:\nLeonard gets upset when he discovers that Penny is seeing a new guy, so he tries to trick her into going on a date with him.\n\n\n04 The Luminous Fish Effect:\nSheldon's Christian-fundamentalist mother visits to get him out of the funk he's in after he is fired for being disrespectful toward his new boss.\n\n\n05 The Hamburger Postulate:\nLeonard and his colleague Leslie spend the night together. But Leslie tells Leonard after the fact that she's only interested in a one-night stand.\n\n\n06 The Middle Earth Paradigm:\nThe guys are invited to Penny's Halloween costume party. During the party, Leonard has a run-in with Penny's ex-boyfriend.\n\n\n07 The Dumpling Paradox:\nWhen Howard hooks up with Penny's old friend, it ruins the nights on which all of the guys play the game &quot;Halo.&quot;\n\n\n08 The Grasshopper Experiment:\nRajnesh's parents, communicating from India by Web cam, arrange for him to go out with another Indian woman in the hopes of marriage, but his date turns out to have more in common with Sheldon.\n\n\n09 The Cooper-Hofstadter Polarization:\nLeonard and Sheldon's friendship is put to the test when Leonard wants to present a paper they co-authored at a physics convention, but Sheldon does not.\n\n\n10 The Loobenfeld Decay:\nLeonard lies to Penny so that he and Sheldon can get out of watching her perform. However, Sheldon believes that the lie has too many loose ends, so he comes up with a new, unnecessarily complex one to replace it.\n\n\n11 The Pancake Batter Anomaly:\nSheldon is sick, and Leonard and the guys sneak out to a &quot;Planet of the Apes&quot; movie marathon to get out of taking care of him--which leaves Penny as the only person to whom the needy Sheldon can turn.\n\n\n12 The Jerusalem Duality:\nSheldon is threatened when a new 15-year-old prodigy who is smarter than him joins the lab, so the guys come up with a plan to get rid of him.\n\n\n13 The Bat Jar Conjecture:\nSheldon becomes so intent on demonstrating his intellectual superiority over his Physics Bowl teammates that they boot him, and replace him with his nemesis.\n\n\n14 The Nerdvana Annihilation:\nPenny gets mad at Leonard because the guys' new &quot;time machine&quot; causes her to miss work. Leonard is so devastated that he vows to give up all of his nerd memorabilia.\n\n\n15 The Pork Chop Indetermincy:\nSheldon's sexy twin sister arrives in town from Texas, and all of Sheldon's friends fight over who will get to be with her.\n\n\n16 The Peanut Reaction:\nWhen Penny and the guys learn that Leonard has never had a birthday party, they decide to try to throw a surprise party for him.\n\n\n17 The Tangerine Factor:\nAfter Penny breaks up with her new guy, she agrees to go out on a date with Leonard. However, both of them have reservations about the date soon after agreeing to it.\n\n\n\n\n\nHope You Guys Enjoy This Torrent, Please Seed.\n","torrent":{"xt":"urn:btih:edaafac3ae3e354beeada9f0f601fbcdf31e1932","amp;dn":"The+Big+Bang+Theory+%3A+The+Complete+First+Season+++++++++DVDrip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"edaafac3ae3e354beeada9f0f601fbcdf31e1932","infoHashBuffer":{"type":"Buffer","data":[237,170,250,195,174,62,53,75,238,173,169,240,246,1,251,205,243,30,25,50]},"announce":[],"urlList":[]}}