{"title":"ONE FOR THE MONEY XVID GLOBE","uid":7069415,"size":960434959,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:ef30f39f7b2e876bc70a1a171550edd9c680721a&amp;dn=ONE+FOR+THE+MONEY+XVID+GLOBE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"globeplus","files":-1,"time":1330608374,"description":"* XVID   * 01H31M18S    * + 1200 Bitrate    * Worked with the Dub plugins\n\n\n* FILE INFO :\n\n\n- Black borders at the top and the bottom in full screen corrected\n\n- particles on the picture background reduced to the minimum\n\n- colours improved\n\n\n\n* Intro :\n\nOne for the Money is a 2012 comedy film based on the 1994 novel of the same name by Janet Evanovich. Directed by Julie Anne Robinson, the screenplay was written by Liz Brixius, Karen McCullah Lutz and Kirsten Smith. It stars Katherine Heigl, Jason O'Mara, Debbie Reynolds, Daniel Sunjata and Sherri Shepherd.\n\n* Plot :\n\nStephanie Plum (Katherine Heigl), out of work and out of cash, turns in desperation to her disreputable cousin Vinnie, of Vinnie's Bail Bonds, for work. Despite having no equipment, training or particular skill she becomes a bail enforcement agent, chasing after Vinnie's highest stakes bail jumper: Joe Morelli, a former vice cop who is wanted for murder, who also happened to seduce and dump Stephanie back in high school.\nIn the midst of the chase, Stephanie has to deal with meddling family, a problematic tendency of witnesses to die when she gets too close, and lessons in bounty hunting from the mysterious Ranger (Daniel Sunjata). When she finally catches up to Morelli, she realizes that the case against him doesn't add up and that the old flame from their school days may just be rekindling.\n\n\n\n\n\n* enjoy ...\n\n\n\n\n\n\n\n* GLOBE FILES 2012","torrent":{"xt":"urn:btih:ef30f39f7b2e876bc70a1a171550edd9c680721a","amp;dn":"ONE+FOR+THE+MONEY+XVID+GLOBE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ef30f39f7b2e876bc70a1a171550edd9c680721a","infoHashBuffer":{"type":"Buffer","data":[239,48,243,159,123,46,135,107,199,10,26,23,21,80,237,217,198,128,114,26]},"announce":[],"urlList":[]}}