{"title":"The Servant (1963) DVD9 PAL","uid":7059358,"size":7873104216,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:f12ad1999bfca1832032a350611d72c87223ff64&amp;dn=The+Servant+%281963%29+DVD9+PAL&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Mariann1","files":-1,"time":1330294698,"description":"Year: 1963\nDirector: Joseph Losey\nCountry: UK\nGenre: Drama. Intriga | Drama psicolÃƒÂ³gico\nRuntime: 115  Min.\nWriting credits: Robin Maugham, Harold Pinter\nPhotography: Douglas Slocombe (B&amp;W)\nOriginal Music: John Dankworth \nCast: Dirk Bogarde, Sarah Miles, Wendy Craig, James Fox, Catherine Lacey, Richard Vernon, Ann Firbank, Doris Knox, Patrick Magee, Jill Melford, Alun Owen, Harold Pinter, Derek Tansley, Brian Phelan, Hazel Terry, Philippa Hare, Dorothy Bromiley, Alison Seebohm, Chris Williams, Gerry Duggan, John Dankworth, Harriet Devine, Davy Graham, Colette Martin, Joanna Wake, Bruce Wells \n\n\n\n:: Synopsis ::\nThe Servant is Harold Pinter's 1963 film adaptation of a 1948 novelette by Robin Maugham. A British production directed by Joseph Losey, it stars Dirk Bogarde, Sarah Miles, Wendy Craig, and James Fox.\nThe first of Pinter's three film collaborations with Losey, which also include Accident (1967) and The Go-Between (1970), The Servant is a tightly-constructed psychological dramatic film about the relationships among the four central characters examining issues relating to class, servitude, and the ennui of the upper classes\nWealthy wastrel James Fox hires insouciant cockney Dirk Bogarde as a valet. No sooner has he donned his working clothes than Bogarde begins exercising a subtle but insidious control over his master. Suggesting that the house could use a little fixing up, Bogarde convinces Fox to spend a whopping amount of money on it. But this is just a warm-up session for Bogarde, who by mid-film is calling all the shots in the Fox household, all the while pretending to keep his place. Fox's fiance Wendy Craig sees through Bogarde's game. Bogarde then brings his own lady friend Sarah Miles into the house. At Bogarde's insistence, Miles seduces Fox, thereby loosening Craig's hold on the confused young man. And so it goes. The homosexual subtext of The Servant disturbed some of the more hidebound critics of 1963; Harold Pinter based his cryptic screenplay on a novel by Robin Maugham.\n\n\n\n:: Technical Info ::\nDVD Distributor: Studio Canal/Universal\nVideo Format: Pal\nDVD Source: DVD9\nAspect Ratio: 1.66:1\nAudio: English, German, Spanish, Italian\nSubtitles: Czech, Danis,  German, Spanish, Italian, , Hungarian, Dutch, Norwegian, Portuguese, Polish, Swedish, Finnish\nExtraction: DVD Decrypter\n","torrent":{"xt":"urn:btih:f12ad1999bfca1832032a350611d72c87223ff64","amp;dn":"The+Servant+%281963%29+DVD9+PAL","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f12ad1999bfca1832032a350611d72c87223ff64","infoHashBuffer":{"type":"Buffer","data":[241,42,209,153,155,252,161,131,32,50,163,80,97,29,114,200,114,35,255,100]},"announce":[],"urlList":[]}}