{"title":"Liberty City Textures Volume 1","uid":7167307,"size":2150997524,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:f16d77baf0c1b3d4d657e0f5cfea0243001aef2d&amp;dn=Liberty+City+Textures+Volume+1+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"NakedNedFlanders","files":16,"time":1333822128,"description":"Liberty City Textures Volume 1.\n\nA texture mod for the main city of Algonquin.\n\nI started this back in November as a pet project for myself,\nsince then it's grown to cover the whole main city [Algonquin],\nand gone from just roads and pavements to grass, walls, glass,\nwindows, buildings, shops, roofs, glues, metals, etc..\n\nEvery road and pavement has not only been updated to 1024 textures,\nbut they have also had their specular maps removed to stop shiny road\nsyndrome - often seen in most ENB configs, &amp; even non-ENB timecycle mods -\nMost ground specular maps have also been removed, mostly to try to stop\nshiny almost glass-looking grass, and the generic ground normal map has been\nimproved.\n\nMost stock Rockstar textures are left in, shops, buildings, ground, walls, etc..\nThese are often good enough to leave intact, but most require a lot of work to\nchange, such as shop textures which match their models they are mapped on to -\nthis is a lot of work to get new textures to fit to the stock models.\n\nI have colour-corrected most stock textures, sometimes darkening them if they're\ntoo bright, and lighting then if they're too dark.\n\nThe GTXD has had a big overhaul, it's also optimised - only 61Mb - and contains\nsome beta road textures for Broker - these are as close to Rockstar's originals\nas I can get wthout actually copying them.\n\nNo install is required, simply download all files and place them in their correct\nfolders.\n\nNOTE: PLEASE MAKE A BACKUP OF THE FOLLOWING\n\nC:Program Files (x86)Rockstar GamesGrand Theft Auto IVpcdatamapsmanhat\n\nIt is big, 1.9Gb, but I cannot provide backups for this, so incase this mod isn't\nfor you then please back this up somewhere so you can return to them if needed.\n\nAlso backup your gtxd here, C:Program Files (x86)Rockstar GamesGrand Theft Auto IVpcdatacdimages\n\nInstall, simply download all files and place manhat01 - manhat12 in\n\nC:Program Files (x86)Rockstar GamesGrand Theft Auto IVpcdatamapsmanhat\n\nand the gtxd goes here\n\nC:Program Files (x86)Rockstar GamesGrand Theft Auto IVpcdatacdimages\n\nThats it.\n\nPlease do not steal this mod, download it and modify it and upload as your own mod. If you want to include the gtxd in your ENB mod then please contact me first, I normally don't have a problem as long as I get asked. ","torrent":{"xt":"urn:btih:f16d77baf0c1b3d4d657e0f5cfea0243001aef2d","amp;dn":"Liberty+City+Textures+Volume+1+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f16d77baf0c1b3d4d657e0f5cfea0243001aef2d","infoHashBuffer":{"type":"Buffer","data":[241,109,119,186,240,193,179,212,214,87,224,245,207,234,2,67,0,26,239,45]},"announce":[],"urlList":[]}}