{"title":"THE WOMAN IN BLACK XVID cam GLOBE","uid":7036938,"size":917702857,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:f28cf6611edcfdc78db5f296363992d027aafa9b&amp;dn=THE+WOMAN+IN+BLACK+XVID+cam+GLOBE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"globeplus","files":-1,"time":1329416916,"description":"* XVID   * 01H29M34S    * + 1200 Bitrate    * Worked with the Dub plugins\n\n\n* FILE INFO :\n\n\n- Black borders at the top and the bottom in full screen corrected\n\n- particles on the picture background reduced to the minimum\n\n- colours improved\n\n\n\n* Intro :\n\nThe Woman in Black is a 2012 horror-thriller film directed by James Watkins and written by Jane Goldman, and is based on Susan Hill's novel of the same name. It is produced by Hammer Film Productions. The film stars Daniel Radcliffe, CiarÃƒÂ¡n Hinds, Janet McTeer, Sophie Stuckey, and Liz White. It was released in the United States and Canada on 3 February 2012 to generally positive reviews, and was released in the United Kingdom on 10 February 2012.\n\n\n* Plot :\n\nIn the Edwardian era, young solicitor Arthur Kipps (Daniel Radcliffe) lives with his four-year-old son Joseph (Misha Handley) and his son's nanny (Jessica Raine). Kipps' wife Stella (Sophie Stuckey) died after childbirth. Kipps has visions of her and is facing financial problems along with stress from his firm. He is assigned to handle the estate of Alice Drablow who owned Eel Marsh House in the North East of England, where she had lived with her husband, son Nathaniel and sister Jennet Humfrye (Liz White). Although the locals are unwelcoming, Kipps gets a room in the local village inn and makes friends with Sam Daily (CiarÃƒÂ¡n Hinds), a wealthy landowner who invites Kipps to have dinner with him and his wife Elizabeth (Janet McTeer).\n\nAt Eel Marsh House, located on an island in the marshes which is linked to the mainland only by a long causeway which is covered at high tide, Kipps starts working on the paperwork, but he repeatedly hears footsteps and sees a woman dressed in black. Kipps reports the sighting at the local police station. While there, two boys bring in their sister Victoria (Alexia Osborne) who has drunk lye and she dies in Kipps's arms. She is not the first child in town to commit suicide and the townspeople believe the &quot;Woman in Black&quot; comes for their children as revenge for her child being taken from her.\n\n\n\n\n\n\n* enjoy ...\n\n\n\n\n\n\n\n\n\n* GLOBE FILES 2012 *\n\n\n","torrent":{"xt":"urn:btih:f28cf6611edcfdc78db5f296363992d027aafa9b","amp;dn":"THE+WOMAN+IN+BLACK+XVID+cam+GLOBE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f28cf6611edcfdc78db5f296363992d027aafa9b","infoHashBuffer":{"type":"Buffer","data":[242,140,246,97,30,220,253,199,141,181,242,150,54,57,146,208,39,170,250,155]},"announce":[],"urlList":[]}}