{"title":"Syndicate - Full Origi  creed1994","uid":7040505,"size":7081701030,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:f2aeda040abc8b842714981dfd71f6b13f7b23f8&amp;dn=Syndicate+-+Full+Origi++creed1994+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"LetalM","files":1341,"time":1329520682,"description":"Syndicate - Full Origi  creed1994 \nINFO:\n\nNo longer governed by politicians, the developed world is divided up into regions controlled by mega-corporations known as syndicates. These syndicates have revolutionized how the consumer interacts with the digital world. Since the consumer requires a device to access the world's data and control technology, they can do this in the blink of an eye via neural chip implant.\nCivilians flocked to be &quot;Chip'd&quot; and enjoy all that their selected syndicate has to offer: housing, medical, banking, insurance, education, entertainment and jobs. One complete package. One complete lifestyle. In return, the syndicates gained unprecedented insights, and control, over the individual and their behavior. With little government oversight, business has become war. The syndicates will stop at nothing for ultimate market dominance.\n\nAt the first line of this war are the agents, the syndicate's bio-engineered and chip-augmented enforcers. They can breach anything in the wired dataverse, including their enemies, their weapons and the environment that surrounds them, making them the most efficient and deadly technological weapons in the world. Take on the role of Miles Kilo, EuroCorp's latest prototype agent, and embark on a brutal action adventure of corruption and revenge\n\nDeveloper: Starbreeze AB\nPublisher: Electronic Arts Inc.\nGenre: Action-FPS Shooter\nPlatform: PC / Windows\n\nRelease date: World: 21 February 2012\nUSA: 21 February 2012\nEurope: 21 February 2012\n\n\nPlay modes: Single player\n\nMedia Size: 2DVD\nGame language: ENGLISH + RUSSIAN\nAge requirements: 16+\nCore 2 Duo 2.4 GHz, 2 GB RAM (3 GB RAM - Vista/7), graphic card 512 MB (GeForce 8800 GT or better), 10.5 GB HDD, Windows XP/Vista/7.\n","torrent":{"xt":"urn:btih:f2aeda040abc8b842714981dfd71f6b13f7b23f8","amp;dn":"Syndicate+-+Full+Origi++creed1994+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f2aeda040abc8b842714981dfd71f6b13f7b23f8","infoHashBuffer":{"type":"Buffer","data":[242,174,218,4,10,188,139,132,39,20,152,29,253,113,246,177,63,123,35,248]},"announce":[],"urlList":[]}}