{"title":"Strap On Anal Lesbians [2xDVD5]","uid":7044023,"size":9361688576,"categoryP":"porn","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:f539de35267fe45177cecb1d2875b3e5413f5939&amp;dn=Strap+On+Anal+Lesbians+%5B2xDVD5%5D++&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"dzhzfyhan","files":116,"time":1329662093,"description":"Strap On Anal Lesbians [2xDVD5]\n\n\n\nStrap On Anal Lesbians Special [2xDVD5] Disc Set  \nStudio: Evil Angel Jay Sin\nCategory \tStrap-On Movies\n\nTo say that director Jay Sin is fascinated with female buttholes is an understatement. He's made a career of capturing rim jobs, rectal gapes and ass-to-mouth action. Jay's new &quot;Strap-On Anal Lesbians&quot; is a double-DVD set of gorgeous sluts reaming each other with outrageously huge strap-on dildos; it delivers all the eroticism of hard-core rectal sodomy, but with no dicks to spoil the girly vibe! Domineering ballet instructor Franceska Jaimes anally trains soft-assed blonde Chastity Lynn with a riding crop and an enormous rubber cock. Young Chastity turns the tables on the statuesque Latina bombshell, pounding her ass and licking Franceska's cavernous colon. The undisputed queens of insane anal stunts and monster gaping - Hotkinkyjo, Isabella Clark and Alysa - stretch one another's winking bunghole, plowing their elastic backsides with impossibly thick, black phalluses and enjoying the flavor of ass. Shorthaired Julie Night and exotic Annie Cruz share ass domination involving milk and whipped-cream enemas plus lots of sensuous butt licking. Latex-clad bitches Nicki Hunter and Dee Siren have a fetishistic bondage date; a perverse vacuum pump swells Dee's rosebud to a fleshy bulb. Locker room bad girls Roxy Raye and Jayda Diamonde initiate newby Amy Brooke into a sorority-style lesbian hazing that results in a nasty anal prolapse. A bonus orgy starring lovelies Leilani Leeane, Adrianna Nicole, Gia DiMarco, London Keyes, Sammie Spades, Holly Michaels and Emma Haize is the frosting on this pound cake. Jay's irrepressible sluts are strapped and ready for lesbian action!.\n\n Jay Sin's &quot;Strap-On Anal Lesbians&quot; is a double-disc DVD with bonus strap-on pool party featuring seven girls; extensive outtakes and behind-the-scenes footage; photo galleries, cast list, filmographies and trailers..\n &lt;a href=&quot;\nhttp://pornoshara.tv/item.php?tid=71269&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://pornoshara.tv/item.php?tid=71269&lt;/a&gt;","torrent":{"xt":"urn:btih:f539de35267fe45177cecb1d2875b3e5413f5939","amp;dn":"Strap+On+Anal+Lesbians+%5B2xDVD5%5D++","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f539de35267fe45177cecb1d2875b3e5413f5939","infoHashBuffer":{"type":"Buffer","data":[245,57,222,53,38,127,228,81,119,206,203,29,40,117,179,229,65,63,89,57]},"announce":[],"urlList":[]}}