{"title":"mashups-vol3 (UNZIPPED VERSION!)","uid":7249655,"size":2832944404,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:f62192c71d2483b0950b1fd76e4da66de665bdbd&amp;dn=mashups-vol3+%28UNZIPPED+VERSION%21%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"tin_star","files":391,"time":1336413594,"description":"The previous incarnations of these torrents (around 6 in all) were stymied by lack of seeders, and stuck in perpetuity in an infinite dearth of available completion! Hence, I decided to return to the source of the mp3s at goodblimey.com and download the tracks from scratch, individually. That's 391 tracks in this volume alone!\n\nIn addition, they are now presented unzipped, which though more bandwidth hungry, may mean each track can now be isolated in the event of a lack of seeders as before. So, now returned to the Pirate Bay for the first time in 6 years it would seem, are these delectable &quot;choons&quot; for your listening pleasure.\n\nThanks to goodblimey.com, and keeskoe for the original torrent.\n\nTrack list available by clicking the Files link, please seed as my connection is not the fastest in the world. Maybe someone can assist in returning the other volumes to the web, visit goodblimey.com, click on mashups and use the player to view each volume of tracks. This is only vol 3. In order to download the tracks individually you need to click the small &quot;down&quot; arrow to the right of each track name. There are almost 2,500 tracks available there! Please,if you like this music, upload the other volumes to The Bay!\n\nThank you.","torrent":{"xt":"urn:btih:f62192c71d2483b0950b1fd76e4da66de665bdbd","amp;dn":"mashups-vol3+%28UNZIPPED+VERSION%21%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f62192c71d2483b0950b1fd76e4da66de665bdbd","infoHashBuffer":{"type":"Buffer","data":[246,33,146,199,29,36,131,176,149,11,31,215,110,77,166,109,230,101,189,189]},"announce":[],"urlList":[]}}