{"title":"Shock - Movie 2 of 2","uid":7209615,"size":644120064,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:f6efea5a4886568b8620d5a719a3e4f33be792c8&amp;dn=Shock+-+Movie+2+of+2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"AussieLeech","files":1,"time":1335197071,"description":"Hey there discerner's of quality\n\nSo, by now you should have already downloaded and watched Latex.\n\nIf you have not, then you must do that 1st to get the storyline.\n\nThis epic sequel should blow your mind.\n\nMichael Ninn has done an amazing job and any accolades that went his way for this production were well deserved.\n\nMichael Ninn's 'Latex' certainly must have given a lot of people a wake up call that the adult business was coming of age. He has returned with a sequel to the most anticipated XXX films in recent times,but could he really pull off a second encounter ?\n\n'Shock' takes Ninn's dark futuristic vision of a fascist state from 'Latex' and propels us deep into the mind of Malcolm Stevens,where sex and degradation are permanent fixtures.\n\nDr Hellstrom(Ona Zee)is attempting to cure our patient(played once again by Jon Dough)via shock treatment,when her assistant Shayla Laveaux,becomes drawn into a world of decadence, a place what most of us would consider heaven,but to Shayla(who attempts to convince us 'I dont like pain')it is a catalyst to be ravished by 2 gargoyles played by T.T.Boy and Vince Vouyer.\n\nEnter Dr Mangroves(Tyffany Million)return from her first ordeal in 'Latex',however this time it's Million who will be quite literally inside Mr Stevens head,when she agrees to go into his subconscious and rescue the imprisoned Shayla.\n\nThe whole production is far superior to the original and Antonio Passolini's script is superb.Don't worry if it sounds like the plot overtakes any action.The film starts off with Jeanna Fine and Jon Dough together for a 15 minute XXX opener,Tyffany Million upon checking in at Stevens frontal lobe gets together with Peter North and John Decker. Shayla Laveaux not only gets her just rewards at the hands of Jon Dough but also succumbs to the patented 'Megasplash' sequence,executed by Jill Kelly,Juli Ashton,Misty Rain and Felecia.\n\nIf you are looking for sunburnt babes,in brightly lit palaces with happy endings,this may not be the film for you.But if Marilyn Manson's wet dreams are more of interest then 'Shock' will keep you enthralled. Quality of the DVD is excellent,the only drawback is the lack of extras but with movie production of this calibre who needs extras.\n\nEssential. \n\nSit back and marvel at this awesome offering.","torrent":{"xt":"urn:btih:f6efea5a4886568b8620d5a719a3e4f33be792c8","amp;dn":"Shock+-+Movie+2+of+2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f6efea5a4886568b8620d5a719a3e4f33be792c8","infoHashBuffer":{"type":"Buffer","data":[246,239,234,90,72,134,86,139,134,32,213,167,25,163,228,243,59,231,146,200]},"announce":[],"urlList":[]}}