{"title":"NCIS Complete Season 8","uid":7036091,"size":8841824280,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:f7a98b889c00eb29dd3a324dcf9ca2dfb46e5be3&amp;dn=NCIS+Complete+Season+8&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"stu181","files":24,"time":1329388551,"description":"\n\n    Ep 24 Pyramid\n    \n    When the Port-to-Port killer is finally revealed, the entire NCIS team finds themselves in grave danger.\n        \n    Ep 23 Swan Song\n    \n    The NCIS team has to chase every possible lead when the latest victim of the Port-to-Port killer turns out to be someone with personal ties to the team.\n        \n    Ep 22 Baltimore\n    \n    When Tony's former partner Danny Price is found murdered and linked to the Port-to-Port serial killer, Tony flashes back to his days as a detective in Baltimore and recounts his first meeting with Gibbs.\n        \n    Ep  Dead Reflection\n    \n    When a Pentagon security camera catches a petty officer committing a murder, the NCIS team has to track them down. Meanwhile, Gibbs reveals that Agent Barrett will be taking over the Port-to-Port murder case with her own team.\n       \n        \n    Ep 20 Two-Faced\n   \n    Much to Gibbs' displeasure, the NCIS team has to investigate a death of a seaman with a lead from Agent E.J. Barrett, leaving the rest of the team concerned that Gibbs may be leaving NCIS yet again. Meanwhile, Ziva introduces her new boyfriend to the team.\n        \n        \n    Ep 19  Tell-All\n   \n    When a Navy Commander found murdered leaves behind a message written in blood, the NCIS team links it to a manuscript that may hold a threat to the national security.\n       \n    Ep 18 Out of the Frying Pan...\n   \n    Gibbs is confused about Vance's order to cross-examine a teenage boy accused of killing his own father, a retired Marine.\n        \n    Ep 17 One Last Score\n    \n    When the NCIS team learns of a shocking murder of one of their former investigative assistants, they soon find out that the victim has been selling information on how to rob a warehouse full of expensive possessions. Meanwhile, a new special agent is added to the team.\n        \n    Ep 16 Kill Screen\n    \n    The NCIS team has to find a ruthless murderer after the dismembered fingertips and teeth of a murdered Marine are found in a pickpocketer's stolen purse.\n        \n    Ep 15  Defiance\n  \n    When a marine dies to save the life of a Belgravian prime minister from an assassination attempt, the NCIS team is put on the job of protecting the minister's daughter that is currently studying in the USA while investigating the death of the marine.\n       \n    Ep 14  A Man Walks Into a Bar...\n    \n    The team has to investigate the death of a naval commander found shot to his death on a navy vessel, while undergoing mandatory psych evaluations.\n        \n    Ep 13 Freedom\n    \n    The NCIS team has to locate the family and the murderer when a Marine is found beaten to death in his own backyard.\n        \n    Ep 12 Recruited\n    \n    When a recruitment session of a petty officer results in murder, the NCIS team sets out to find the culprit by teaming up with Ducky's predecessor.\n        \n    Ep 11  Ships in the Night\n   \n    The NCIS team partners up with the Coast Guard Investigative Service when they have to investigate the murder of a marine on a dinner boat cruise.\n       \n    Ep 10 False Witness\n    \n    When a Navy petty officer that was supposed to testify in an upcoming murder trial suddenly goes missing, the NCIS team gets help from the deputy district attorney to find the missing witness.\n        \n    Ep 9 Enemies Domestic\n    \n    After an ambush changes the course of the their investigation, the NCIS team has to quickly find answers, and one team member flashes back to their very first NCIS assignment.\n        \n    Ep 8\n    Enemies Foreign\n    11/16/10\n    8.8\n    go\n    The team has to protect Ziva's father when he attends the NCIS conference, which has Ziva confronting her past when a couple of unexpected surprises occur.\n        \n        \n    Ep 7 Broken Arrow\n    \n    The team is surprised when Gibbs asks Tony's father to join them in a murder investigation.\n       \n    Ep 6 Cracked\n    \n    Abby becomes too fixated to solving the murder of a Naval Scientist, while the rest of the team worries about her. Meanwhile, Tony's newest fling brings trouble.\n       \n        \n    Ep 5  Dead Air\n    \n    The team investigates the death of a radio DJ and a Naval Officer who were both killed live on air, and their job becomes more difficult by the discovery of various suspects.\n        \n    Ep 4  Royals &amp; Loyals\n    \n    The team is involved in an international incident as they investigate the murder of an American petty officer whose body was found aboard a British ship.\n       \n    Ep 3 Short Fuse\n    \n    The NCIS team has to work with the FBI when they learn that a female bomb tech is linked to a murder.\n       \n    Ep 2  Worst Nightmare\n    \n    The NCIS team has to find a young girl that was kidnapped, but their investigation turns into something else when her grandfather gets way too involved.\n        \n    Ep 1 Spider and the Fly\n    \n    The members of the NCIS team find themselves to be the targets of Paloma Reynosa, who is out there trying to fulfill her vendetta against Gibbs.","torrent":{"xt":"urn:btih:f7a98b889c00eb29dd3a324dcf9ca2dfb46e5be3","amp;dn":"NCIS+Complete+Season+8","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f7a98b889c00eb29dd3a324dcf9ca2dfb46e5be3","infoHashBuffer":{"type":"Buffer","data":[247,169,139,136,156,0,235,41,221,58,50,77,207,156,162,223,180,110,91,227]},"announce":[],"urlList":[]}}