{"title":"Big Aperture v. 1.1.2 [K]racked","uid":7080707,"size":159114644,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:f7bc92269db0e0bde866529e4d6b6ee4e5e6251d&amp;dn=Big+Aperture+v.+1.1.2+%5BK%5Dracked&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"polisdavid","files":-1,"time":1331016366,"description":"Official Web Site: &lt;a href=&quot; http://itunes.apple.com/us/app/big-aperture/id475038608?mt=12&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://itunes.apple.com/us/app/big-aperture/id475038608?mt=12&lt;/a&gt;\n\nBig Aperture gives your images the DSLR-Level Depth Of Field effect and other visual aspects normally seen with only professional grade big sensor cameras. Magically unleash your creative inspiration, while using tools for making great images with a mix of clear focus and selective blurring as well as awesome post-processing FX effects.\n\nFeatures:\n\n* Intelligent Focus System\n\nBig Aperture Intelligent Focus System allows you roughly define your focus area and then further refine your focus area precisely with one click\n\n* Aperture Size Control\n\nVaried aperture sizes are provided in the app and allow you define the blur level of the out-of-focus areas.\n\n* Bokeh effects\n\nBig Aperture also offers 16 unique Bokeh effects that aesthetically exaggerate the effect of the lights shinning in the out-of-focus area, into shapes like stars and hearts. This great feature transforms the overall look and feel of a fairly image into one to amaze your friends and family. Further options include an airy effect, inducing the dreamy effects to wedding photographs, thematic support for objects and beautiful imagery of scattered lights in the background of focused subjects.\n\n* Filter Effects\n\nOver 40 well defined Effects in various categories, including Lomo, Analog, Black and White, Classic Style, as well as 20 different styles of borders combined with DSLR depth-of-field effect give full play to your creativity and imagination\n\n* Instant Focus/Blur Tool\n\nBasic mode provide you customized settings for portraits, natural scenes, architecture and macro photography and you can instantly define your focus and blur area in real time.\n\n* Editing tools\n\nBig Aperture gives some of the most powerful and easy to use photography editing tools - brightness controls, contrast control, saturation control, rotation, etc.\n\n* Before &amp; After Comparison functionality\n\nFast switching between before &amp; after view in your processing stage allows you get the exactly results your are looking for.\n\n* File support\n\nBig aperture supports image resolution up to 40 mega-pixels, in numerous image formats including: TIFF, JPEG, PNG, BMP and over 100 RAW file formats.\n\nWhat's New\n\n* Improved processing speed\n\n* UI is improved\n\n* Fix a few bugs\n\nSystem requirements: \n\nIntel Mac, OS X.6 or greater\n\n\n--- PLEASE SEED ---","torrent":{"xt":"urn:btih:f7bc92269db0e0bde866529e4d6b6ee4e5e6251d","amp;dn":"Big+Aperture+v.+1.1.2+%5BK%5Dracked","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f7bc92269db0e0bde866529e4d6b6ee4e5e6251d","infoHashBuffer":{"type":"Buffer","data":[247,188,146,38,157,176,224,189,232,102,82,158,77,107,110,228,229,230,37,29]},"announce":[],"urlList":[]}}