{"title":"[PSP] Final Fantasy VII - Crysis Core GLOBE","uid":7120358,"size":743160231,"categoryP":"games","categoryS":"handheld","magnet":"?xt=urn:btih:f9313e8bd5849fab8cda38250ce92e48cb069b24&amp;dn=%5BPSP%5D+Final+Fantasy+VII+-+Crysis+Core+GLOBE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"globeplus","files":-1,"time":1332348918,"description":"HELLO FINAL FANTASY SERIES FANS ... \n\n\nPLAY THIS FINAL FANTASY GAME FOR THE PSP ...\nT\n\n\nFILE INFO : \n\n\n- QUALITY RIP WITH NOTHING RIPPED , JUST THE PMF VIDEOS AND AT3 AUDIO WORKED\n  PERFECTLY WITH QUALITY AND TESTED ON THE GAME \n\n\n- WORKING PERFECTLY ON THE JPCSP EMULATOR WITH THE NEXT CONFIGURATION :\n\n  \n  VIDEO : Only GE Graphics\n\n\n* Gameplay :\n\nCrisis Core is an action role-playing game in which the player controls the main character Zack through the game's storyline. During the main story of the game, the player moves Zack through and between open areas, allowing him to talk with non-playable characters, interact with the environment, or encounter monsters in battle. At any save point in these areas, the player may opt to take one of many side missions that are available; if selected, Zack is moved to a special area to complete the mission, usually to defeat one or more monsters. If the mission is successfully completed, the player is rewarded with one or more items, and often one or more new missions become available. Whether the mission is completed successfully or if Zack falls in battle, Zack is returned to the save point at the end. If Zack should fall in battle during the main story combat, the player will be forced to restart from their last saved game.\n\nCrisis Core uses a real-time combat system in which the player can move Zack around, initiate attacks, special abilities, spells, or item use, and have Zack block or dodge an attack. Zack's abilities in battle are set by what materia he is equipped with. Up to six materia can be equipped, and can impart special attacks, magic spells, or passive bonuses such as bonuses to Zack's health meter or the ability to display the statistics of the current foe in combat. Materia are gained throughout the game through exploration, rewards from side missions or spoils of war, or from shops. Materia can be fused together to make more powerful versions with improved bonuses; for example, fusing an attack skill materia with an elemental magic materia can create a new attack skill materia that inflicts elemental magic damage in addition to physical damage. Special items collected in the game can also be used in materia fusion to further increase the materia's power.\n\n\n\n\n\n\n\n* enjoy ...\n\n\n\n\n\n\n\n\n\n* GLOBE FILES 2012\n\n  ","torrent":{"xt":"urn:btih:f9313e8bd5849fab8cda38250ce92e48cb069b24","amp;dn":"%5BPSP%5D+Final+Fantasy+VII+-+Crysis+Core+GLOBE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f9313e8bd5849fab8cda38250ce92e48cb069b24","infoHashBuffer":{"type":"Buffer","data":[249,49,62,139,213,132,159,171,140,218,56,37,12,233,46,72,203,6,155,36]},"announce":[],"urlList":[]}}