{"title":"CalcLine v. 3.0 with [K]rack","uid":7042706,"size":5538814,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:f9e23ab1d265df3cfc9e04b489c7ace2b6c91e4a&amp;dn=CalcLine+v.+3.0+with+%5BK%5Drack&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"polisdavid","files":-1,"time":1329611532,"description":"Official Web Site: &lt;a href=&quot; http://www.pomola.com/products_calcline/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.pomola.com/products_calcline/&lt;/a&gt;\n\nCalcline is a latest generation algebra calculator. Is enough to insert a mathematical expression and Calcline will immediately show the result.\n\nIt can work in three way:\n\nAs a compact strip window utility providing an area to input and solve mathematical expressions\n\nAs a full size window application using variables and constants contained in a table and optionally showing calculations step by step in a log area.\n(Switching from small to full size window is performed with a simple click)\n\nAs a service available inside all the other apps you have\n\nIt manages two tables with variables and constant values inside, using the table values as in 'y=x+1' with 'x' value contained in the table.\nIf you write an expression as 'x= 1+1' calcline will automatically update for you the value of the variable 'x' in the variable table\nAuto-creates new variable in the table. in case the y variable was not present when you typed 'y=x+1', a 'y' variable is created for you with a correct value assigned!\n\nYou can manipulate how many variables and constants you like.\n\nOffers a wide range of functions:\n\nsqrt, cbrt, sin, cos, tan, asin, acos, atan, sinh, cosh, tanh, asinh, acosh, atanh, log, log10, exp, exp2, expm1, abs, ceil, floor, power, elevation and factorial.\n\nManages any nested level of parentheses\nCheck your expression syntax in advance signaling errors\nOffers popup menus for fast introduction of any literal values available in the tables (variables and constant) and can change on the fly calculation precision (up to 16 decimals thanks to use of long double calculation)\nManages unlimited numbers of variables you like in the table.\n\nConstants table is similar to the variables table but constant value can't be assigned via calculation but only typing directly in the constant table (it's a feature, assignment is refused, they are constant!)\nVariables and constants values are retained over different Calcline launches.\nPosition of the window is retained over different launches, in the small window way, is often useful to keep Calcline at the very bottom or top of the screen as a compact strip window switching to the full sized window when is required to use the additional functionalities\n\nCalcline can provide also a full report of executed calculations solved step by step.\n\n* When installed it can also be used as a services from other applications\n  via the services menu, to solve algebraic expressions from inside any \n  other application, you just have to select an equation and select form the\n  service menu 'Calc with Calcline' and the result will be pasted, this inside\n  any application you are using!\n\n* Evaluates mathematical expressions with parentheses, nested functions,\n  variables and constants\n\n* Easy to use and ideal substitute of the old desktop calculator\n\n* The user simply inserts an expression and Calcline displays the result\n\n* Variable creation and reference inside expressions are very easy using\n  an interactive table.\n\n* Constant table with editable values\n\n* Variables and constants values are retained over different runs\n\n* Expressions solved optionally step by step showing all the mathematical\n  passages.\n\n* Uses a very small window, expandable if necessary to show additional\n  details (switch with a simple click).\n\n* Offers calculation service to other Apps, just selecting an expression\n  and choosing 'Calc With Calcline' from the services menu.\n\n* Based on a custom fast calculation engine developed by Tension\n  Software on Mac OS X.\n\n* Uses long double calculation (High precision with up to 16 decimal\n  digit precision)\n\n* Popup for fast introduction of variables and constants in formula\n \n* DEG and RAD calculation for trigonometric functions\n\n* Native Help system\n\n*  Embedded PDF user guide\n\nSystem Requirement:\n\nIntel Mac, OS X.5 or better\n\n--- PLEASE SEED ---","torrent":{"xt":"urn:btih:f9e23ab1d265df3cfc9e04b489c7ace2b6c91e4a","amp;dn":"CalcLine+v.+3.0+with+%5BK%5Drack","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f9e23ab1d265df3cfc9e04b489c7ace2b6c91e4a","infoHashBuffer":{"type":"Buffer","data":[249,226,58,177,210,101,223,60,252,158,4,180,137,199,172,226,182,201,30,74]},"announce":[],"urlList":[]}}