{"title":"20120315-Stossel-[Is it fair].Fox Business.CF.avi","uid":7109252,"size":339268072,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:fb5cfdae76e01a920e1c8b8ee26b48da09944bc5&amp;dn=20120315-Stossel-%5BIs+it+fair%5D.Fox+Business.CF.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"skJGZV6z","files":-1,"time":1331979603,"description":"----------\n\nSTOSSEL - [Is It Fair...?] - Fox Business Network\n2012, March 15, Thursday\n\nXvid/MP3 AVI - encoded from medium quality ReplayTV stream\n\n----------\n\n[excerpted from John Stossel's blog:]\n\nThe President constantly talks about &quot;fairness.&quot; In a recent speech in Kansas, President Obama mentioned fairness a dozen times. The NY Times said the President's message was, &quot;...his most pointed appeal yet for a strong governmental role through tax and regulation to level the economic playing field.&quot;\n\nDoes a &quot;strong governmental role&quot; mean &quot;fairness?&quot;\n\nTonight, my guests discuss what &quot;fair&quot; means.\n\nStephen Moore responded to Obama with a fairness quiz. He joins us to discuss the fairness of things like the fact that 10 of the richest 15 counties that surround Washington, D.C. are now the riches counties in America.\n\nFormer George W. Bush's press secretary Dana Perino and Charles Goyette, author of the book Red and Blue and Broke All Over will discuss the growth of entitlements and the unfairness of younger, poorer people subsidizing care for old people like me.\n\nIs it fair that poor families have to be stuck in bad government schools? Former D.C. school chancellor Michelle Rhee joins us.\n\nOur government throws money at green energy companies. Solar-panel maker Solyndra was a small loss compared to other boondoggles. Koch Industries' Nancy Pfotenhauer will discuss the fairness of giving money to companies hand-picked by government, instead of growth through the market.\n\nFinally, do you pay your fair share in taxes? Economist Art Laffer says the rich pay too much.","torrent":{"xt":"urn:btih:fb5cfdae76e01a920e1c8b8ee26b48da09944bc5","amp;dn":"20120315-Stossel-%5BIs+it+fair%5D.Fox+Business.CF.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fb5cfdae76e01a920e1c8b8ee26b48da09944bc5","infoHashBuffer":{"type":"Buffer","data":[251,92,253,174,118,224,26,146,14,28,139,142,226,107,72,218,9,148,75,197]},"announce":[],"urlList":[]}}