{"title":"Cadavrul Viu 1975 DVDRip","uid":7034540,"size":909922888,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:fdad3ee92682588e74bb3fbae63c59e0c7ddd081&amp;dn=Cadavrul+Viu+1975+DVDRip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":-1,"time":1329333835,"description":"\nCadavrul viu (1975) (Teatru TV)\n\nDescriere:\nUna din putinele piese de teatru ale lui Tolstoi, &quot;Cadavrul Viu&quot; este drama unui om care, desi formal integrat social, se simte un ratat care nu mai poate juca comedia asta. Protasovii, Fiodor si sotia sa, Liza, fac parte din aristocratia rusa. Se iubesc din tinerete, au tot ce le trebuie, dar sunt nefericiti. El se considera un om slab in fata patimilor omenesti. Ea sufera din cauza sotului inadaptat si alcoolic, pana cand Fedia decide sa-si insceneze moartea, pentru a-si elibera sotia. Fuge de acasa. Presata de familie, Liza se casatoreste cu Viktor Karenin, un admirator mai vechi. E fericita, are doi copii. Fedia decade tot mai jos, ducandu-si traiul prin carciumi ca un anonim. Se refugiaza la tigani, unde se inamoreaza de frumoasa cantareata Masa. Respins de parintii fetei, Fedia fuge si de aici. Cu tot anonimatul sau, este descoperit. Lizei i se intenteaza proces de bigamie. Legea o obliga sa se intoarca la el. Fedia apare in instanta luandu-i apararea. Atunci realizeaza ca numai moartea ii va elibera pe ceilalti de povara lui. Fedia nu este miscat nici de lacrimile Masei si respinde planul ei de a fugi impreuna, in lume. Inutil si cu constiinta ca aduce numai nenorociri celor pe care ii iubeste, alege moartea si se impusca pe holul tribunalului. Liza, distrusa de remuscari, realizeaza ca Fedia a fost singura iubire a vietii ei. \n\nvideo: x264, 698x506, 25 fps\naudio: AC3, stereo, 192 kbps\nduration: 02:01:44.360\n\nlanguage: romanian\nsubtitle: none\n\ndon't forget to seed ...","torrent":{"xt":"urn:btih:fdad3ee92682588e74bb3fbae63c59e0c7ddd081","amp;dn":"Cadavrul+Viu+1975+DVDRip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fdad3ee92682588e74bb3fbae63c59e0c7ddd081","infoHashBuffer":{"type":"Buffer","data":[253,173,62,233,38,130,88,142,116,187,63,186,230,60,89,224,199,221,208,129]},"announce":[],"urlList":[]}}