{"title":"The Accidental Feminist (gnv64)","uid":7147837,"size":12849281,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:fe5a880171c4ccfc0b1a210832668347ee28e5e2&amp;dn=The+Accidental+Feminist+%28gnv64%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"gnv65","files":-1,"time":1333153732,"description":"The Accidental Feminist: How Elizabeth Taylor Raised Our Consciousness and We Were Too Distracted By Her Beauty to Notice\nby M. G. Lord\nWalker &amp; Company | January 2012 | ISBN-10: 0802716695 | ePUB/MOBI/LIT/PDF | 11.9 mb &lt;a href=&quot;\nhttp://www.amazon.com/The-Accidental-Feminist-Consciousness-Distracted/dp/0802716695&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/The-Accidental-Feminist-Consciousness-Distracted/dp/0802716695&lt;/a&gt;\n\nMovie stars establish themselves as brands--and Taylor's brand , in its most memorable outings, has repeatedly introduced a broad audience to feminist ideas. In her breakout film, &quot;National Velvet&quot; (1944), Taylor's character challenges gender discrimination,: Forbidden as a girl to ride her beloved horse in an important race, she poses as a male jockey. Her next milestone, &quot;A Place in the Sun&quot; (1951), can be seen as an abortion rights movie--a cautionary tale from a time before women had ready access to birth control. In &quot;Butterfield 8&quot; (1960), for which she won an Oscar, Taylor isn't censured because she's a prostitute, but because she chooses the men: she controls her sexuality, a core tenet of the third-wave feminism that emerged in the 1990s. Even &quot;Who's Afraid of Virginia Woolf?&quot; (1966) depicts the anguish that befalls a woman when the only way she can express herself is through her husband's stalled career and children.\nThe legendary actress has lived her life defiantly in public--undermining post-war reactionary sex roles, helping directors thwart the Hollywood Production Code, which censored film content between 1934 and 1967. Defying death threats she spearheaded fundraising for AIDS research in the first years of the epidemic, and has championed the rights of people to love whom they love, regardless of gender. Yet her powerful feminist impact has been hidden in plain sight. Drawing on unpublished letters and scripts as well as interviews with Kate Burton, Gore Vidal, Austin Pendleton, Kevin McCarthy, Liz Smith, and others, The Accidental Feminist will surprise Taylor and film fans with its originality and will add a startling dimension to the star's enduring mystique.\n\nAbout the Author\nM.G. Lord is a celebrated cultural critic and investigative journalist, and the author of Forever Barbie and Astro Turf. Since 1995 she has been a regular contributor to the New York Times Book Review and the Times's Arts &amp; Leisure section. Her work has appeared in numerous publications, including The New Yorker, Vogue, the Wall Street Journal, and ArtForum. Before becoming a freelance writer, Lord was a syndicated political cartoonist and a columnist for Newsday. She teaches at the University of Southern California and lives in Los Angeles.\n\nContents\n1. The Beautiful Somnambulist\n2. National Velvet, 1944\n3. 1945-1950\n4. A Place in the Sun, 1951\n5.1951-1955\n6. Giant, 1956\n7. 1956-1959\n8. Suddenly, Last Summer, 1959\n9. BUtterfield 8, 1960\n10. 1960-1962\n11. Cleopatra, 1963\n12. 1963-1965\n13. The Sandpiper, 1965\n14. Who's Afraid of Virginia Woolf? 1966\n15. 1967-1973\n16. Ash Wednesday, 1973\n17. The Litde Foxes, 1981\n18. 1982-1984\n19. Her Greatest Conscious Gift, 1984-2011\nAcknowledgments\nNotes\nFootnotes\nBibliography\nPlate Section","torrent":{"xt":"urn:btih:fe5a880171c4ccfc0b1a210832668347ee28e5e2","amp;dn":"The+Accidental+Feminist+%28gnv64%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fe5a880171c4ccfc0b1a210832668347ee28e5e2","infoHashBuffer":{"type":"Buffer","data":[254,90,136,1,113,196,204,252,11,26,33,8,50,102,131,71,238,40,229,226]},"announce":[],"urlList":[]}}