{"title":"Bing Crosby - Whilst Bregman Swings [1956] 1996 [EAC - FLAC](oan","uid":7038095,"size":128733273,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:fed4a334931377a8c800f86b906dd4deae9d37cb&amp;dn=Bing+Crosby+-+Whilst+Bregman+Swings+%5B1956%5D+1996+%5BEAC+-+FLAC%5D%28oan&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"oneanight","files":-1,"time":1329455519,"description":"Bing Crosby - Whilst Bregman Swings [1956] 1996 [EAC - FLAC](oan) MFSL\n &lt;a href=&quot;\nhttp://nimga.com/f/hh4Ng.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://nimga.com/f/hh4Ng.jpg&lt;/a&gt;\n\n\nIn early 1956, Bing Crosby ended the two long-term company affiliations that had defined his career for more than 20 years \nleaving his exclusive associations with Paramount Pictures and Decca Records. Thereafter, he made movies and records on a \nfreelance basis. The immediate results were more felicitous for his film work than his recording, as he went to MGM for \nthe successful movie High Society. As a recording artist, in rapid succession he cut the movie soundtrack for Capitol \n(January-February) a new album for Decca, Songs I Wish I Had Sung (The First Time Around) (April) and a new album for \nVerve, Bing Sings Whilst Bregman Swings (June). The third was the least likely. Twenty-five-year-old Buddy Bregman, a \nfriend of Crosby's son Gary, had recently been appointed an A&amp;R executive at the fledgling Verve. His idea for Crosby \nwas to copy the formula of recent Nelson Riddle-arranged Frank Sinatra successes such as Songs for Swingin' Lovers\ntake a collection of inter-war standards and give them punchy big-band arrangements. The approach was well-suited to the \naggressive Sinatra, who wasn't shy about editing the arrangements himself, but singularly inappropriate to the affable \nCrosby, who left everything to his arranger/conductor. The 12 songs, none of which Crosby had released commercially before, \nwere great standards from the likes of Kern, Rodgers and Hart, Berlin, and Gershwin, and Crosby turned in typically witty \ninterpretations. But Bregman's repetitive, overly busy arrangements, full of loud, sudden horn blats and splats, forced \nthe singer to compete for attention and occasionally smothered him completely. Crosby was looking for a way back to \ncommercial appeal with this experiment. But the three albums were all released within a period of weeks in August and \nSeptember, and only the film soundtrack got a fair hearing and became a hit. \n\n\n   1. Bing Crosby - Mountain Greenery (Richard Rodgers, Lorenz Hart)      [03:39]\n   2. Bing Crosby - Deed I Do (Walter Hirsch, Fred Rose)                  [02:52]\n   3. Bing Crosby - The Song Is You (Oscar Hammerstein II, Jerome Kern)   [03:56]\n   4. Bing Crosby - Heat Wave (Berlin)                                    [03:01]\n   5. Bing Crosby - Cheek to Cheek (Irving Berlin)                        [04:02]\n   6. Bing Crosby - Have You Met Miss Jones? (Rodgers, Hart)              [02:30]\n   7. Bing Crosby - The Blue Room (Rodgers, Hart)                         [02:23]\n   8. Bing Crosby - They All Laughed (George Gershwin, Ira Gershwin)      [02:42]\n   9. Bing Crosby - I've Got Five Dollars (Rodgers, Hart)                 [03:15]\n  10. Bing Crosby - September in the Rain (Al Dubin, Harry Warren)        [02:56]\n  11. Bing Crosby - Nice Work If You Can Get It (G. Gershwin, I. Gershwin)[02:36]\n  12. Bing Crosby - Jeepers Creepers (Johnny Mercer, Warren)              [02:33]\n\nPlaying Time.........: 36:31\nTotal Size...........: 117.41 MB\n\n\nartwork included .JEPG 600dpi format\n\n\nThanks to the original Riper / Poster\n\n\nEAC [Secure mode] | Stereo / 44100 HZ / 16 Bit | VorbisComment | Lossless Audio Codec | [avg. compression: 53%]","torrent":{"xt":"urn:btih:fed4a334931377a8c800f86b906dd4deae9d37cb","amp;dn":"Bing+Crosby+-+Whilst+Bregman+Swings+%5B1956%5D+1996+%5BEAC+-+FLAC%5D%28oan","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fed4a334931377a8c800f86b906dd4deae9d37cb","infoHashBuffer":{"type":"Buffer","data":[254,212,163,52,147,19,119,168,200,0,248,107,144,109,212,222,174,157,55,203]},"announce":[],"urlList":[]}}