{"title":"WINDOWS 7 USB STICK and EXTERNAL HDD (ACRONIS)","uid":7160353,"size":3308660760,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:ff31bdac24ccfca70ec5745ef994710d46ef6904&amp;dn=WINDOWS+7+USB+STICK+and+EXTERNAL+HDD+%28ACRONIS%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"bloxwich0","files":1,"time":1333589580,"description":"WINDOWS 7 ULTIMATE USB STICK and EXTERNAL HDD EDITION (ACRONIS .TIB FILES)\n\n\nTHE INITIAL PROGRAM WAS PRODUCED BY iMortaluz...it's his work, not mine, so please give him the credit!\n\n\n\nYOU CAN CARRY WINDOWS 7 ULTIMATE WITH YOU ANYWHERE YOU GO, ON A USB MEMORY STICK OR AN EXTERNAL HARD DISK DRIVE!\n\n\n\nI HAVE PRODUCED AN ACRONIS TRUE IMAGE BACKUP, USING ACRONIS TRUE IMAGE HOME 2010, IN AN ATTEMPT TO MAKE IT EASIER TO \n\nINSTALL &quot;iMortaluz's&quot; SOFTWARE ON A USB MEMORY STICK OR EXTERNAL USB/HDD\n\n(YOU WILL ALSO NEED A COPY OF ACRONIS TRUE IMAGE HOME 2010 INSTALLED ON YOUR PC)\n\n\n\nTHE ACRONIS BACKUP FILE &quot;Windows 7-USB-STICK-Edition.tib&quot; WILL WORK ON BOTH USB STICK AND AN EXTERNAL USB HARD DISK DRIVE\n\n\n\nBEFORE YOU START EITHER OF THE FOLLOWING TWO METHODS, MAKE SURE YOUR USB or HDD IS FORMATTED IN NTFS AND ALSO PLEASE BEAR \n\nIN MIND THAT ANY SOFTWARE ON THESE TWO DRIVES WILL BE ERASED, SOMETHING FOR WHICH I AM NOT RESPONSIBLE!\n\n\n\n\n1.) METHOD FOR USB MEMORY STICK:-\n\n\na] MAKE SURE YOU USE A USB MEMORY STICK WITH A MINIMUM CAPACITY OF AT LEAST 8GB AND IS FAIRLY QUICK WITH DATA TRANSFER.\n\n(YOU SHOULD MAKE SURE THAT THE USB WHICH YOU USE IS CAPABLE OF HAVING THE REMOVABLE BIT &quot;FLIPPED&quot;)\n\nI USED A LEXAR 8GB JUMPDRIVE RETRAX USB AND BOOTIT.EXE, WHICH IS A LEXAR FILE UTILITY TO FLIP THE REMOVABLE BIT.\n\n\nb] PLUG THE USB INTO YOUR PC AND RUN BOOTIT.EXE, FOLLOW THE ON-SCREEN INSTRUCTIONS.\n\n\nc] IN ORDER TO RUN WINDOWS ON A USB, THE PC MUST RECOGNISE THE USB AS A FIXED DRIVE AND NOT A REMOVABLE ONE.\n\nCHECK IN WINDOWS EXPLORER/COMPUTER AND ENSURE THAT THE USB IS NOW SHOWN IN THE HARD DISK DRIVES SECTION AND NOT AS A \n\nREMOVABLE STORAGE DEVICE. WHERE THE USB DRIVE IS FOUND INDICATES WHETHER THE BIT IS FLIPPED OR NOT!\n\nYOU MAY NEED TO TRY SEVERAL MANUFACTURERS USB's AS NOT ALL OF THEM WILL &quot;FLIP THE BIT&quot;. \n\nSEE THE FILE &quot;USB's WHICH FLIP THE RMB.TXT&quot; FOR MORE DETAILS.\n\n\nd] IF THE USB IS RECOGNISED AS A HARD DISK DRIVE, JUST IMAGE &quot;WINDOWS 7-USB-STICK-Edition.tib&quot; ACROSS TO YOUR USB STICK \n\nWITH ACRONIS TRUE IMAGE HOME 2010 USING THE RECOVERY SECTION.\n\n\ne] RE-BOOT YOUR PC WITH THE USB INSERTED AND CHECK THAT THE BIOS WILL SEE THE USB AS THE FIRST BOOTABLE MEDIA.\n\n\n\nPLEASE BE PATIENT, THE FIRST TIME WILL TAKE A WHILE, BUT IT DOES WORK FAIRLY QUICKLY ONCE DRIVERS ETC ARE LOCATED.\n\n\n\n\n\n\n2.) METHOD FOR EXTERNAL USB/HDD:-\n\n\na] CONNECT THE HDD, USING A SUITABLE CABLE, TO A USB PORT ON YOUR PC.\n\n\nb] IMAGE &quot;WINDOWS 7-USB-STICK-Edition.tib&quot; ACROSS TO YOUR USB/EXTERNAL HDD (I USED A 2.5&quot; SEAGATE SATA 20GB CAPACITY HDD) \n\nWITH ACRONIS TRUE IMAGE HOME 2010 USING THE RECOVERY SECTION.\n\n\nc] RE-BOOT YOUR PC WITH THE USB/HDD CABLE STILL CONNECTED AND CHECK THAT THE BIOS WILL SEE THE USB/HDD AS THE FIRST \n\nBOOTABLE MEDIA.\n\n\n\nPLEASE BE PATIENT, THE FIRST TIME WILL TAKE A WHILE, BUT IT DOES WORK FAIRLY QUICKLY ONCE DRIVERS ETC ARE INSTALLED.\n\n\n\n\nPLEASE LEAVE FEEDBACK, I WILL TRY TO HELP OR ADVISE ABOUT MY METHOD IF YOU HAVE A PROBLEM!\n\n\n\n\nTHE PROGRAM &quot;Windows 7 USB Stick Edition v4 Beta&quot; WAS PRODUCED BY iMortaluz...\n...it's his work, not mine, so please give him the credit! &lt;a href=&quot;\nhttp://ub3r.1337.cx/forum.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://ub3r.1337.cx/forum.php&lt;/a&gt;\n","torrent":{"xt":"urn:btih:ff31bdac24ccfca70ec5745ef994710d46ef6904","amp;dn":"WINDOWS+7+USB+STICK+and+EXTERNAL+HDD+%28ACRONIS%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ff31bdac24ccfca70ec5745ef994710d46ef6904","infoHashBuffer":{"type":"Buffer","data":[255,49,189,172,36,204,252,167,14,197,116,94,249,148,113,13,70,239,105,4]},"announce":[],"urlList":[]}}